Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/STM32V873/Includes/Registers/stm32V873_rcc.h
/*
 * SPDX-License-Identifier: MIT
 *
 * Goal:     stm32V873_rcc equates.
 */
#pragma once

#include    <stdint.h>

// RCC address definitions
// -----------------------

typedef struct {
    volatile    uint32_t    CR;
    volatile    uint32_t    SR;
    volatile    uint32_t    CFGR1;
    volatile    uint32_t    CFGR2;
    volatile    uint32_t    MCGCALR1;
    volatile    uint32_t    MCGCALR2;
    volatile    uint32_t    MCGCALR3;
    volatile    uint32_t    RESERVED0;
    volatile    uint32_t    MCGCFGR1;
    volatile    uint32_t    MCGCFGR2;
    volatile    uint32_t    RESERVED1[8];
    volatile    uint32_t    PLL1CFGR;
    volatile    uint32_t    PLL1DIVR1;
    volatile    uint32_t    PLL1DIVR2;
    volatile    uint32_t    PLL1DIVR3;
    volatile    uint32_t    PLL1DIVR4;
    volatile    uint32_t    PLL1SSCGR;
    volatile    uint32_t    PLL2CFGR;
    volatile    uint32_t    PLL2DIVR1;
    volatile    uint32_t    PLL2DIVR2;
    volatile    uint32_t    PLL2DIVR3;
    volatile    uint32_t    PLL2DIVR4;
    volatile    uint32_t    PLL2SSCGR;
    volatile    uint32_t    RESERVED2[6];
    volatile    uint32_t    CIER;
    volatile    uint32_t    CIFR;
    volatile    uint32_t    CICR;
    volatile    uint32_t    RESERVED3;
    volatile    uint32_t    BMCFGR;
    volatile    uint32_t    AHBCFGR;
    volatile    uint32_t    APBCFGR;
    volatile    uint32_t    RESERVED4;
    volatile    uint32_t    ICLKENR;
    volatile    uint32_t    ICLK1CFGR;
    volatile    uint32_t    ICLK2CFGR;
    volatile    uint32_t    ICLK3CFGR;
    volatile    uint32_t    ICLK4CFGR;
    volatile    uint32_t    ICLK5CFGR;
    volatile    uint32_t    ICLK6CFGR;
    volatile    uint32_t    ICLK7CFGR;
    volatile    uint32_t    ICLK8CFGR;
    volatile    uint32_t    ICLK9CFGR;
    volatile    uint32_t    ICLK10CFGR;
    volatile    uint32_t    ICLK11CFGR;
    volatile    uint32_t    ICLK12CFGR;
    volatile    uint32_t    ICLK13CFGR;
    volatile    uint32_t    RESERVED5[2];
    volatile    uint32_t    CCIPR1;
    volatile    uint32_t    CCIPR2;
    volatile    uint32_t    CCIPR3;
    volatile    uint32_t    CCIPR4;
    volatile    uint32_t    CCIPR5;
    volatile    uint32_t    CCIPR6;
    volatile    uint32_t    CCIPR7;
    volatile    uint32_t    CCIPR8;
    volatile    uint32_t    CCIPR9;
    volatile    uint32_t    CCIPR10;
    volatile    uint32_t    CCIPR11;
    volatile    uint32_t    CCIPR12;
    volatile    uint32_t    RESERVED6[4];
    volatile    uint32_t    AHB1RSTR;
    volatile    uint32_t    AHB2RSTR;
    volatile    uint32_t    AHB3RSTR;
    volatile    uint32_t    AHB4RSTR;
    volatile    uint32_t    AHB5RSTR1;
    volatile    uint32_t    RESERVED7[3];
    volatile    uint32_t    APB1RSTR1;
    volatile    uint32_t    APB1RSTR2;
    volatile    uint32_t    APB2RSTR;
    volatile    uint32_t    RESERVED8;
    volatile    uint32_t    APB4RSTR;
    volatile    uint32_t    APB5RSTR;
    volatile    uint32_t    RESERVED9[6];
    volatile    uint32_t    AHB1ENR;
    volatile    uint32_t    AHB2ENR;
    volatile    uint32_t    AHB3ENR;
    volatile    uint32_t    AHB4ENR;
    volatile    uint32_t    AHB5ENR1;
    volatile    uint32_t    AHB5ENR2;
    volatile    uint32_t    RESERVED10[2];
    volatile    uint32_t    APB1ENR1;
    volatile    uint32_t    APB1ENR2;
    volatile    uint32_t    APB2ENR;
    volatile    uint32_t    RESERVED11[3];
    volatile    uint32_t    APB4ENR;
    volatile    uint32_t    RESERVED12;
    volatile    uint32_t    APB5ENR;
    volatile    uint32_t    RESERVED13[7];
    volatile    uint32_t    AHB1LPENR;
    volatile    uint32_t    AHB2LPENR;
    volatile    uint32_t    AHB3LPENR;
    volatile    uint32_t    AHB4LPENR;
    volatile    uint32_t    AHB5LPENR1;
    volatile    uint32_t    AHB5LPENR2;
    volatile    uint32_t    RESERVED14[2];
    volatile    uint32_t    APB1LPENR1;
    volatile    uint32_t    APB1LPENR2;
    volatile    uint32_t    APB2LPENR;
    volatile    uint32_t    RESERVED15[3];
    volatile    uint32_t    APB4LPENR;
    volatile    uint32_t    RESERVED16;
    volatile    uint32_t    APB5LPENR;
    volatile    uint32_t    RESERVED17[9];
    volatile    uint32_t    BDCR;
    volatile    uint32_t    CSR;
    volatile    uint32_t    RSR;
    volatile    uint32_t    RESERVED18;
    volatile    uint32_t    DBGCR;
    volatile    uint32_t    RESERVED19;
    volatile    uint32_t    SECCFGR;
    volatile    uint32_t    PRIVCFGR;
    volatile    uint32_t    RCFGLOCKR;
    volatile    uint32_t    PUBCFGR;
} RCC_TypeDef;

#if (defined(__cplusplus))
#define RCC_NS  reinterpret_cast<RCC_TypeDef *>(0x46028000u)
#define RCC_S   reinterpret_cast<RCC_TypeDef *>(0x56028000u)

#else
#define RCC_NS  ((RCC_TypeDef *)0x46028000u)
#define RCC_S   ((RCC_TypeDef *)0x56028000u)
#endif

// CR Configuration

#define RCC_CR_PLL2ON                               (0x1u<<25)
#define RCC_CR_PLL1ON                               (0x1u<<24)
#define RCC_CR_HSECSSON                             (0x1u<<19)
#define RCC_CR_HSEEXT                               (0x1u<<18)
#define RCC_CR_HSEBYP                               (0x1u<<17)
#define RCC_CR_HSEON                                (0x1u<<16)
#define RCC_CR_MCGPLLFAST                           (0x1u<<11)
#define RCC_CR_MCGPLLSEL                            (0x1u<<10)
#define RCC_CR_MCGPLLEN                             (0x1u<<9)
#define RCC_CR_MCG48MCKEN                           (0x1u<<7)
#define RCC_CR_MCGAUDIOCKEN                         (0x1u<<6)
#define RCC_CR_MCGREFCKEN                           (0x1u<<5)
#define RCC_CR_MCGPLLCKEN                           (0x1u<<4)
#define RCC_CR_MCGKER2CKEN                          (0x1u<<3)
#define RCC_CR_MCGKER1CKEN                          (0x1u<<2)
#define RCC_CR_MCGSYSCKEN                           (0x1u<<1)

#define RCC_CR_PLL2ON_B_0X0                         (0x0u<<25)
#define RCC_CR_PLL2ON_B_0X1                         (0x1u<<25)
#define RCC_CR_PLL1ON_B_0X0                         (0x0u<<24)
#define RCC_CR_PLL1ON_B_0X1                         (0x1u<<24)
#define RCC_CR_HSECSSON_B_0X0                       (0x0u<<19)
#define RCC_CR_HSECSSON_B_0X1                       (0x1u<<19)
#define RCC_CR_HSEEXT_B_0X0                         (0x0u<<18)
#define RCC_CR_HSEEXT_B_0X1                         (0x1u<<18)
#define RCC_CR_HSEBYP_B_0X0                         (0x0u<<17)
#define RCC_CR_HSEBYP_B_0X1                         (0x1u<<17)
#define RCC_CR_HSEON_B_0X0                          (0x0u<<16)
#define RCC_CR_HSEON_B_0X1                          (0x1u<<16)
#define RCC_CR_MCGPLLFAST_B_0X0                     (0x0u<<11)
#define RCC_CR_MCGPLLFAST_B_0X1                     (0x1u<<11)
#define RCC_CR_MCGPLLSEL_B_0X0                      (0x0u<<10)
#define RCC_CR_MCGPLLSEL_B_0X1                      (0x1u<<10)
#define RCC_CR_MCGPLLEN_B_0X0                       (0x0u<<9)
#define RCC_CR_MCGPLLEN_B_0X1                       (0x1u<<9)
#define RCC_CR_MCG48MCKEN_B_0X0                     (0x0u<<7)
#define RCC_CR_MCG48MCKEN_B_0X1                     (0x1u<<7)
#define RCC_CR_MCGAUDIOCKEN_B_0X0                   (0x0u<<6)
#define RCC_CR_MCGAUDIOCKEN_B_0X1                   (0x1u<<6)
#define RCC_CR_MCGREFCKEN_B_0X0                     (0x0u<<5)
#define RCC_CR_MCGREFCKEN_B_0X1                     (0x1u<<5)
#define RCC_CR_MCGPLLCKEN_B_0X0                     (0x0u<<4)
#define RCC_CR_MCGPLLCKEN_B_0X1                     (0x1u<<4)
#define RCC_CR_MCGKER2CKEN_B_0X0                    (0x0u<<3)
#define RCC_CR_MCGKER2CKEN_B_0X1                    (0x1u<<3)
#define RCC_CR_MCGKER1CKEN_B_0X0                    (0x0u<<2)
#define RCC_CR_MCGKER1CKEN_B_0X1                    (0x1u<<2)
#define RCC_CR_MCGSYSCKEN_B_0X0                     (0x0u<<1)
#define RCC_CR_MCGSYSCKEN_B_0X1                     (0x1u<<1)

// SR Configuration

#define RCC_SR_PLL2RDY                              (0x1u<<25)
#define RCC_SR_PLL1RDY                              (0x1u<<24)
#define RCC_SR_HSERDY                               (0x1u<<16)
#define RCC_SR_MCGPLLRDY                            (0x1u<<9)
#define RCC_SR_MCG48RDY                             (0x1u<<7)
#define RCC_SR_MCG3072RDY                           (0x1u<<6)
#define RCC_SR_MCG256RDY                            (0x1u<<0)

#define RCC_SR_PLL2RDY_B_0X0                        (0x0u<<25)
#define RCC_SR_PLL2RDY_B_0X1                        (0x1u<<25)
#define RCC_SR_PLL1RDY_B_0X0                        (0x0u<<24)
#define RCC_SR_PLL1RDY_B_0X1                        (0x1u<<24)
#define RCC_SR_HSERDY_B_0X0                         (0x0u<<16)
#define RCC_SR_HSERDY_B_0X1                         (0x1u<<16)
#define RCC_SR_MCGPLLRDY_B_0X0                      (0x0u<<9)
#define RCC_SR_MCGPLLRDY_B_0X1                      (0x1u<<9)
#define RCC_SR_MCG48RDY_B_0X0                       (0x0u<<7)
#define RCC_SR_MCG48RDY_B_0X1                       (0x1u<<7)
#define RCC_SR_MCG3072RDY_B_0X0                     (0x0u<<6)
#define RCC_SR_MCG3072RDY_B_0X1                     (0x1u<<6)
#define RCC_SR_MCG256RDY_B_0X0                      (0x0u<<0)
#define RCC_SR_MCG256RDY_B_0X1                      (0x1u<<0)

// CFGR1 Configuration

#define RCC_CFGR1_SYSSWS                            (0x3u<<28)
#define RCC_CFGR1_SYSSWS_0                          (0x1u<<28)
#define RCC_CFGR1_SYSSW                             (0x3u<<24)
#define RCC_CFGR1_SYSSW_0                           (0x1u<<24)
#define RCC_CFGR1_MCG48FON                          (0x1u<<7)
#define RCC_CFGR1_MCG3072FON                        (0x1u<<6)
#define RCC_CFGR1_MCG256FON                         (0x1u<<0)

#define RCC_CFGR1_SYSSWS_B_0X0                      (0x0u<<28)
#define RCC_CFGR1_SYSSWS_B_0X1                      (0x1u<<28)
#define RCC_CFGR1_SYSSWS_B_0X2                      (0x2u<<28)
#define RCC_CFGR1_SYSSW_B_0X0                       (0x0u<<24)
#define RCC_CFGR1_SYSSW_B_0X1                       (0x1u<<24)
#define RCC_CFGR1_SYSSW_B_0X2                       (0x2u<<24)
#define RCC_CFGR1_MCG48FON_B_0X0                    (0x0u<<7)
#define RCC_CFGR1_MCG48FON_B_0X1                    (0x1u<<7)
#define RCC_CFGR1_MCG3072FON_B_0X0                  (0x0u<<6)
#define RCC_CFGR1_MCG3072FON_B_0X1                  (0x1u<<6)
#define RCC_CFGR1_MCG256FON_B_0X0                   (0x0u<<0)
#define RCC_CFGR1_MCG256FON_B_0X1                   (0x1u<<0)

// CFGR2 Configuration

