Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/STM32V873/Includes/Registers/stm32V873_rcc.h
#define RCC_CFGR2_MCO2PRE                           (0x7u<<28)
#define RCC_CFGR2_MCO2PRE_0                         (0x1u<<28)
#define RCC_CFGR2_MCO2SEL                           (0xFu<<24)
#define RCC_CFGR2_MCO2SEL_0                         (0x1u<<24)
#define RCC_CFGR2_MCO1PRE                           (0x7u<<20)
#define RCC_CFGR2_MCO1PRE_0                         (0x1u<<20)
#define RCC_CFGR2_MCO1SEL                           (0xFu<<16)
#define RCC_CFGR2_MCO1SEL_0                         (0x1u<<16)
#define RCC_CFGR2_RTCPRE                            (0x3Fu<<0)
#define RCC_CFGR2_RTCPRE_0                          (0x1u<<0)

#define RCC_CFGR2_MCO2PRE_B_0X0                     (0x0u<<28)
#define RCC_CFGR2_MCO2PRE_B_0X1                     (0x1u<<28)
#define RCC_CFGR2_MCO2PRE_B_0X2                     (0x2u<<28)
#define RCC_CFGR2_MCO2PRE_B_0X3                     (0x3u<<28)
#define RCC_CFGR2_MCO2PRE_B_0X4                     (0x4u<<28)
#define RCC_CFGR2_MCO2PRE_B_0X5                     (0x5u<<28)
#define RCC_CFGR2_MCO2PRE_B_0X6                     (0x6u<<28)
#define RCC_CFGR2_MCO2SEL_B_0X1                     (0x1u<<24)
#define RCC_CFGR2_MCO2SEL_B_0X2                     (0x2u<<24)
#define RCC_CFGR2_MCO2SEL_B_0X3                     (0x3u<<24)
#define RCC_CFGR2_MCO2SEL_B_0X4                     (0x4u<<24)
#define RCC_CFGR2_MCO2SEL_B_0X5                     (0x5u<<24)
#define RCC_CFGR2_MCO2SEL_B_0X6                     (0x6u<<24)
#define RCC_CFGR2_MCO2SEL_B_0X7                     (0x7u<<24)
#define RCC_CFGR2_MCO2SEL_B_0X8                     (0x8u<<24)
#define RCC_CFGR2_MCO2SEL_B_0X9                     (0x9u<<24)
#define RCC_CFGR2_MCO2SEL_B_0XA                     (0xAu<<24)
#define RCC_CFGR2_MCO2SEL_B_0XB                     (0xBu<<24)
#define RCC_CFGR2_MCO2SEL_B_0XC                     (0xCu<<24)
#define RCC_CFGR2_MCO2SEL_B_0XD                     (0xDu<<24)
#define RCC_CFGR2_MCO1PRE_B_0X0                     (0x0u<<20)
#define RCC_CFGR2_MCO1PRE_B_0X1                     (0x1u<<20)
#define RCC_CFGR2_MCO1PRE_B_0X2                     (0x2u<<20)
#define RCC_CFGR2_MCO1PRE_B_0X3                     (0x3u<<20)
#define RCC_CFGR2_MCO1PRE_B_0X4                     (0x4u<<20)
#define RCC_CFGR2_MCO1PRE_B_0X5                     (0x5u<<20)
#define RCC_CFGR2_MCO1PRE_B_0X6                     (0x6u<<20)
#define RCC_CFGR2_MCO1SEL_B_0X1                     (0x1u<<16)
#define RCC_CFGR2_MCO1SEL_B_0X2                     (0x2u<<16)
#define RCC_CFGR2_MCO1SEL_B_0X3                     (0x3u<<16)
#define RCC_CFGR2_MCO1SEL_B_0X4                     (0x4u<<16)
#define RCC_CFGR2_MCO1SEL_B_0X5                     (0x5u<<16)
#define RCC_CFGR2_MCO1SEL_B_0X6                     (0x6u<<16)
#define RCC_CFGR2_MCO1SEL_B_0X7                     (0x7u<<16)
#define RCC_CFGR2_MCO1SEL_B_0X8                     (0x8u<<16)
#define RCC_CFGR2_MCO1SEL_B_0X9                     (0x9u<<16)
#define RCC_CFGR2_MCO1SEL_B_0XA                     (0xAu<<16)
#define RCC_CFGR2_MCO1SEL_B_0XB                     (0xBu<<16)
#define RCC_CFGR2_MCO1SEL_B_0XC                     (0xCu<<16)
#define RCC_CFGR2_MCO1SEL_B_0XD                     (0xDu<<16)
#define RCC_CFGR2_RTCPRE_B_0X0                      (0x0u<<0)
#define RCC_CFGR2_RTCPRE_B_0X1                      (0x1u<<0)
#define RCC_CFGR2_RTCPRE_B_0X2                      (0x2u<<0)
#define RCC_CFGR2_RTCPRE_B_0X3                      (0x3u<<0)
#define RCC_CFGR2_RTCPRE_B_0X4                      (0x4u<<0)
#define RCC_CFGR2_RTCPRE_B_0X3E                     (0x3Eu<<0)
#define RCC_CFGR2_RTCPRE_B_0X3F                     (0x3Fu<<0)

// MCGCALR1 Configuration

#define RCC_MCGCALR1_MCG256TRIM                     (0x7Fu<<16)
#define RCC_MCGCALR1_MCG256TRIM_0                   (0x1u<<16)
#define RCC_MCGCALR1_MCG256CAL                      (0x7Fu<<0)
#define RCC_MCGCALR1_MCG256CAL_0                    (0x1u<<0)

// MCGCALR2 Configuration

#define RCC_MCGCALR2_MCG3072TRIM                    (0x7Fu<<16)
#define RCC_MCGCALR2_MCG3072TRIM_0                  (0x1u<<16)
#define RCC_MCGCALR2_MCG3072CAL                     (0x7Fu<<0)
#define RCC_MCGCALR2_MCG3072CAL_0                   (0x1u<<0)

// MCGCALR3 Configuration

#define RCC_MCGCALR3_MCG48CAL                       (0xFFFu<<0)
#define RCC_MCGCALR3_MCG48CAL_0                     (0x1u<<0)

// MCGCFGR1 Configuration

#define RCC_MCGCFGR1_MCGKER2DIV                     (0x1Fu<<24)
#define RCC_MCGCFGR1_MCGKER2DIV_0                   (0x1u<<24)
#define RCC_MCGCFGR1_MCGKER1DIV                     (0x1Fu<<16)
#define RCC_MCGCFGR1_MCGKER1DIV_0                   (0x1u<<16)
#define RCC_MCGCFGR1_MCGSYSDIV                      (0x1Fu<<8)
#define RCC_MCGCFGR1_MCGSYSDIV_0                    (0x1u<<8)

#define RCC_MCGCFGR1_MCGKER2DIV_B_0X0               (0x0u<<24)
#define RCC_MCGCFGR1_MCGKER2DIV_B_0X1F              (0x1Fu<<24)
#define RCC_MCGCFGR1_MCGKER1DIV_B_0X0               (0x0u<<16)
#define RCC_MCGCFGR1_MCGKER1DIV_B_0X1F              (0x1Fu<<16)
#define RCC_MCGCFGR1_MCGSYSDIV_B_0X0                (0x0u<<8)
#define RCC_MCGCFGR1_MCGSYSDIV_B_0X1F               (0x1Fu<<8)

// MCGCFGR2 Configuration

#define RCC_MCGCFGR2_MCGREFDIV                      (0x1Fu<<8)
#define RCC_MCGCFGR2_MCGREFDIV_0                    (0x1u<<8)
#define RCC_MCGCFGR2_MCGPLLDIV                      (0x1Fu<<0)
#define RCC_MCGCFGR2_MCGPLLDIV_0                    (0x1u<<0)

#define RCC_MCGCFGR2_MCGREFDIV_B_0X0                (0x0u<<8)
#define RCC_MCGCFGR2_MCGREFDIV_B_0X1F               (0x1Fu<<8)
#define RCC_MCGCFGR2_MCGPLLDIV_B_0X0                (0x0u<<0)
#define RCC_MCGCFGR2_MCGPLLDIV_B_0X1F               (0x1Fu<<0)

// PLL1CFGR Configuration

#define RCC_PLL1CFGR_DIVM                           (0x1Fu<<24)
#define RCC_PLL1CFGR_DIVM_0                         (0x1u<<24)
#define RCC_PLL1CFGR_VCORGE                         (0x3u<<20)
#define RCC_PLL1CFGR_VCORGE_0                       (0x1u<<20)
#define RCC_PLL1CFGR_PLLSRC                         (0x3u<<16)
#define RCC_PLL1CFGR_PLLSRC_0                       (0x1u<<16)
#define RCC_PLL1CFGR_DIVTEN                         (0x1u<<12)
#define RCC_PLL1CFGR_DIVSEN                         (0x1u<<11)
#define RCC_PLL1CFGR_DIVREN                         (0x1u<<10)
#define RCC_PLL1CFGR_DIVQEN                         (0x1u<<9)
#define RCC_PLL1CFGR_DIVPEN                         (0x1u<<8)
#define RCC_PLL1CFGR_PLLRGE                         (0x3u<<4)
#define RCC_PLL1CFGR_PLLRGE_0                       (0x1u<<4)
#define RCC_PLL1CFGR_PLLSSCGEN                      (0x1u<<2)
#define RCC_PLL1CFGR_PLLFRACLE                      (0x1u<<1)

