Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/STM32V873/Includes/Registers/stm32V873_rcc.h
#define RCC_PLL1SSCGR_DWNSPREAD_B_0X0               (0x0u<<15)
#define RCC_PLL1SSCGR_DWNSPREAD_B_0X1               (0x1u<<15)
#define RCC_PLL1SSCGR_RPDFN_DIS_B_0X0               (0x0u<<14)
#define RCC_PLL1SSCGR_RPDFN_DIS_B_0X1               (0x1u<<14)
#define RCC_PLL1SSCGR_TPDFN_DIS_B_0X0               (0x0u<<13)
#define RCC_PLL1SSCGR_TPDFN_DIS_B_0X1               (0x1u<<13)

// PLL2CFGR Configuration

#define RCC_PLL2CFGR_DIVM                           (0x1Fu<<24)
#define RCC_PLL2CFGR_DIVM_0                         (0x1u<<24)
#define RCC_PLL2CFGR_VCORGE                         (0x3u<<20)
#define RCC_PLL2CFGR_VCORGE_0                       (0x1u<<20)
#define RCC_PLL2CFGR_PLLSRC                         (0x3u<<16)
#define RCC_PLL2CFGR_PLLSRC_0                       (0x1u<<16)
#define RCC_PLL2CFGR_DIVTEN                         (0x1u<<12)
#define RCC_PLL2CFGR_DIVSEN                         (0x1u<<11)
#define RCC_PLL2CFGR_DIVREN                         (0x1u<<10)
#define RCC_PLL2CFGR_DIVQEN                         (0x1u<<9)
#define RCC_PLL2CFGR_DIVPEN                         (0x1u<<8)
#define RCC_PLL2CFGR_PLLRGE                         (0x3u<<4)
#define RCC_PLL2CFGR_PLLRGE_0                       (0x1u<<4)
#define RCC_PLL2CFGR_PLLSSCGEN                      (0x1u<<2)
#define RCC_PLL2CFGR_PLLFRACLE                      (0x1u<<1)

#define RCC_PLL2CFGR_DIVM_B_0X0                     (0x0u<<24)
#define RCC_PLL2CFGR_DIVM_B_0X1                     (0x1u<<24)
#define RCC_PLL2CFGR_DIVM_B_0X1F                    (0x1Fu<<24)
#define RCC_PLL2CFGR_VCORGE_B_0X0                   (0x0u<<20)
#define RCC_PLL2CFGR_VCORGE_B_0X1                   (0x1u<<20)
#define RCC_PLL2CFGR_VCORGE_B_0X2                   (0x2u<<20)
#define RCC_PLL2CFGR_VCORGE_B_0X3                   (0x3u<<20)
#define RCC_PLL2CFGR_PLLSRC_B_0X0                   (0x0u<<16)
#define RCC_PLL2CFGR_PLLSRC_B_0X1                   (0x1u<<16)
#define RCC_PLL2CFGR_PLLSRC_B_0X2                   (0x2u<<16)
#define RCC_PLL2CFGR_PLLSRC_B_0X3                   (0x3u<<16)
#define RCC_PLL2CFGR_DIVTEN_B_0X0                   (0x0u<<12)
#define RCC_PLL2CFGR_DIVTEN_B_0X1                   (0x1u<<12)
#define RCC_PLL2CFGR_DIVSEN_B_0X0                   (0x0u<<11)
#define RCC_PLL2CFGR_DIVSEN_B_0X1                   (0x1u<<11)
#define RCC_PLL2CFGR_DIVREN_B_0X0                   (0x0u<<10)
#define RCC_PLL2CFGR_DIVREN_B_0X1                   (0x1u<<10)
#define RCC_PLL2CFGR_DIVQEN_B_0X0                   (0x0u<<9)
#define RCC_PLL2CFGR_DIVQEN_B_0X1                   (0x1u<<9)
#define RCC_PLL2CFGR_DIVPEN_B_0X0                   (0x0u<<8)
#define RCC_PLL2CFGR_DIVPEN_B_0X1                   (0x1u<<8)
#define RCC_PLL2CFGR_PLLRGE_B_0X0                   (0x0u<<4)
#define RCC_PLL2CFGR_PLLRGE_B_0X1                   (0x1u<<4)
#define RCC_PLL2CFGR_PLLRGE_B_0X2                   (0x2u<<4)
#define RCC_PLL2CFGR_PLLRGE_B_0X3                   (0x3u<<4)
#define RCC_PLL2CFGR_PLLSSCGEN_B_0X0                (0x0u<<2)
#define RCC_PLL2CFGR_PLLSSCGEN_B_0X1                (0x1u<<2)

// PLL2DIVR1 Configuration

#define RCC_PLL2DIVR1_DIVN                          (0xFFu<<16)
#define RCC_PLL2DIVR1_DIVN_0                        (0x1u<<16)
#define RCC_PLL2DIVR1_FRACN                         (0x1FFFu<<3)
#define RCC_PLL2DIVR1_FRACN_0                       (0x1u<<3)

#define RCC_PLL2DIVR1_DIVN_B_0X011                  (0x11u<<16)
#define RCC_PLL2DIVR1_DIVN_B_0X080                  (0x80u<<16)
#define RCC_PLL2DIVR1_DIVN_B_0XC7                   (0xC7u<<16)

// PLL2DIVR2 Configuration

#define RCC_PLL2DIVR2_DIVQ                          (0x7Fu<<24)
#define RCC_PLL2DIVR2_DIVQ_0                        (0x1u<<24)
#define RCC_PLL2DIVR2_FRACQ                         (0x1Fu<<19)
#define RCC_PLL2DIVR2_FRACQ_0                       (0x1u<<19)
#define RCC_PLL2DIVR2_DIVP                          (0x7Fu<<8)
#define RCC_PLL2DIVR2_DIVP_0                        (0x1u<<8)
#define RCC_PLL2DIVR2_FRACP                         (0x1Fu<<3)
#define RCC_PLL2DIVR2_FRACP_0                       (0x1u<<3)

#define RCC_PLL2DIVR2_DIVQ_B_0X0                    (0x0u<<24)
#define RCC_PLL2DIVR2_DIVQ_B_0X1                    (0x1u<<24)
#define RCC_PLL2DIVR2_DIVQ_B_0X2                    (0x2u<<24)
#define RCC_PLL2DIVR2_DIVQ_B_0X3                    (0x3u<<24)
#define RCC_PLL2DIVR2_DIVQ_B_0X7F                   (0x7Fu<<24)
#define RCC_PLL2DIVR2_FRACQ_B_0X0                   (0x0u<<19)
#define RCC_PLL2DIVR2_FRACQ_B_0X1                   (0x1u<<19)
#define RCC_PLL2DIVR2_FRACQ_B_0X2                   (0x2u<<19)
#define RCC_PLL2DIVR2_FRACQ_B_0X1F                  (0x1Fu<<19)
#define RCC_PLL2DIVR2_DIVP_B_0X0                    (0x0u<<8)
#define RCC_PLL2DIVR2_DIVP_B_0X1                    (0x1u<<8)
#define RCC_PLL2DIVR2_DIVP_B_0X2                    (0x2u<<8)
#define RCC_PLL2DIVR2_DIVP_B_0X3                    (0x3u<<8)
#define RCC_PLL2DIVR2_DIVP_B_0X7F                   (0x7Fu<<8)
#define RCC_PLL2DIVR2_FRACP_B_0X0                   (0x0u<<3)
#define RCC_PLL2DIVR2_FRACP_B_0X1                   (0x1u<<3)
#define RCC_PLL2DIVR2_FRACP_B_0X2                   (0x2u<<3)
#define RCC_PLL2DIVR2_FRACP_B_0X1F                  (0x1Fu<<3)

// PLL2DIVR3 Configuration

#define RCC_PLL2DIVR3_DIVS                          (0x7Fu<<24)
#define RCC_PLL2DIVR3_DIVS_0                        (0x1u<<24)
#define RCC_PLL2DIVR3_FRACS                         (0x1Fu<<19)
#define RCC_PLL2DIVR3_FRACS_0                       (0x1u<<19)
#define RCC_PLL2DIVR3_DIVR                          (0x7Fu<<8)
#define RCC_PLL2DIVR3_DIVR_0                        (0x1u<<8)
#define RCC_PLL2DIVR3_FRACR                         (0x1Fu<<3)
#define RCC_PLL2DIVR3_FRACR_0                       (0x1u<<3)

#define RCC_PLL2DIVR3_DIVS_B_0X0                    (0x0u<<24)
#define RCC_PLL2DIVR3_DIVS_B_0X1                    (0x1u<<24)
#define RCC_PLL2DIVR3_DIVS_B_0X2                    (0x2u<<24)
#define RCC_PLL2DIVR3_DIVS_B_0X3                    (0x3u<<24)
#define RCC_PLL2DIVR3_DIVS_B_0X7F                   (0x7Fu<<24)
#define RCC_PLL2DIVR3_FRACS_B_0X0                   (0x0u<<19)
#define RCC_PLL2DIVR3_FRACS_B_0X1                   (0x1u<<19)
#define RCC_PLL2DIVR3_FRACS_B_0X2                   (0x2u<<19)
#define RCC_PLL2DIVR3_FRACS_B_0X1F                  (0x1Fu<<19)
#define RCC_PLL2DIVR3_DIVR_B_0X0                    (0x0u<<8)
#define RCC_PLL2DIVR3_DIVR_B_0X1                    (0x1u<<8)
#define RCC_PLL2DIVR3_DIVR_B_0X2                    (0x2u<<8)
#define RCC_PLL2DIVR3_DIVR_B_0X3                    (0x3u<<8)
#define RCC_PLL2DIVR3_DIVR_B_0X7F                   (0x7Fu<<8)
#define RCC_PLL2DIVR3_FRACR_B_0X0                   (0x0u<<3)
#define RCC_PLL2DIVR3_FRACR_B_0X1                   (0x1u<<3)
#define RCC_PLL2DIVR3_FRACR_B_0X2                   (0x2u<<3)
#define RCC_PLL2DIVR3_FRACR_B_0X1F                  (0x1Fu<<3)

// PLL2DIVR4 Configuration

