Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/STM32V873/Includes/Registers/stm32V873_rcc.h
#define RCC_PLL2DIVR4_DIVT                          (0x7Fu<<8)
#define RCC_PLL2DIVR4_DIVT_0                        (0x1u<<8)
#define RCC_PLL2DIVR4_FRACT                         (0x1Fu<<3)
#define RCC_PLL2DIVR4_FRACT_0                       (0x1u<<3)

#define RCC_PLL2DIVR4_DIVT_B_0X0                    (0x0u<<8)
#define RCC_PLL2DIVR4_DIVT_B_0X1                    (0x1u<<8)
#define RCC_PLL2DIVR4_DIVT_B_0X2                    (0x2u<<8)
#define RCC_PLL2DIVR4_DIVT_B_0X3                    (0x3u<<8)
#define RCC_PLL2DIVR4_DIVT_B_0X7F                   (0x7Fu<<8)
#define RCC_PLL2DIVR4_FRACT_B_0X0                   (0x0u<<3)
#define RCC_PLL2DIVR4_FRACT_B_0X1                   (0x1u<<3)
#define RCC_PLL2DIVR4_FRACT_B_0X2                   (0x2u<<3)
#define RCC_PLL2DIVR4_FRACT_B_0X1F                  (0x1Fu<<3)

// PLL2SSCGR Configuration

#define RCC_PLL2SSCGR_INC_STEP                      (0x7FFFu<<16)
#define RCC_PLL2SSCGR_INC_STEP_0                    (0x1u<<16)
#define RCC_PLL2SSCGR_DWNSPREAD                     (0x1u<<15)
#define RCC_PLL2SSCGR_RPDFN_DIS                     (0x1u<<14)
#define RCC_PLL2SSCGR_TPDFN_DIS                     (0x1u<<13)
#define RCC_PLL2SSCGR_MOD_PER                       (0x1FFFu<<0)
#define RCC_PLL2SSCGR_MOD_PER_0                     (0x1u<<0)

#define RCC_PLL2SSCGR_DWNSPREAD_B_0X0               (0x0u<<15)
#define RCC_PLL2SSCGR_DWNSPREAD_B_0X1               (0x1u<<15)
#define RCC_PLL2SSCGR_RPDFN_DIS_B_0X0               (0x0u<<14)
#define RCC_PLL2SSCGR_RPDFN_DIS_B_0X1               (0x1u<<14)
#define RCC_PLL2SSCGR_TPDFN_DIS_B_0X0               (0x0u<<13)
#define RCC_PLL2SSCGR_TPDFN_DIS_B_0X1               (0x1u<<13)

// CIER Configuration

#define RCC_CIER_MCGPLLUIE                          (0x1u<<20)
#define RCC_CIER_LSECSSIE                           (0x1u<<16)
#define RCC_CIER_PLL2RDYIE                          (0x1u<<9)
#define RCC_CIER_PLL1RDYIE                          (0x1u<<8)
#define RCC_CIER_HSERDYIE                           (0x1u<<5)
#define RCC_CIER_MCG48RDYIE                         (0x1u<<4)
#define RCC_CIER_MCG3072RDYIE                       (0x1u<<3)
#define RCC_CIER_MCG256RDYIE                        (0x1u<<2)
#define RCC_CIER_LSERDYIE                           (0x1u<<1)
#define RCC_CIER_LSIRDYIE                           (0x1u<<0)

#define RCC_CIER_MCGPLLUIE_B_0X0                    (0x0u<<20)
#define RCC_CIER_MCGPLLUIE_B_0X1                    (0x1u<<20)
#define RCC_CIER_LSECSSIE_B_0X0                     (0x0u<<16)
#define RCC_CIER_LSECSSIE_B_0X1                     (0x1u<<16)
#define RCC_CIER_PLL2RDYIE_B_0X0                    (0x0u<<9)
#define RCC_CIER_PLL2RDYIE_B_0X1                    (0x1u<<9)
#define RCC_CIER_PLL1RDYIE_B_0X0                    (0x0u<<8)
#define RCC_CIER_PLL1RDYIE_B_0X1                    (0x1u<<8)
#define RCC_CIER_HSERDYIE_B_0X0                     (0x0u<<5)
#define RCC_CIER_HSERDYIE_B_0X1                     (0x1u<<5)
#define RCC_CIER_MCG48RDYIE_B_0X0                   (0x0u<<4)
#define RCC_CIER_MCG48RDYIE_B_0X1                   (0x1u<<4)
#define RCC_CIER_MCG3072RDYIE_B_0X0                 (0x0u<<3)
#define RCC_CIER_MCG3072RDYIE_B_0X1                 (0x1u<<3)
#define RCC_CIER_MCG256RDYIE_B_0X0                  (0x0u<<2)
#define RCC_CIER_MCG256RDYIE_B_0X1                  (0x1u<<2)
#define RCC_CIER_LSERDYIE_B_0X0                     (0x0u<<1)
#define RCC_CIER_LSERDYIE_B_0X1                     (0x1u<<1)
#define RCC_CIER_LSIRDYIE_B_0X0                     (0x0u<<0)
#define RCC_CIER_LSIRDYIE_B_0X1                     (0x1u<<0)

// CIFR Configuration

#define RCC_CIFR_MCGPLLUF                           (0x1u<<20)
#define RCC_CIFR_HSECSSF                            (0x1u<<17)
#define RCC_CIFR_LSECSSF                            (0x1u<<16)
#define RCC_CIFR_PLL2RDYF                           (0x1u<<9)
#define RCC_CIFR_PLL1RDYF                           (0x1u<<8)
#define RCC_CIFR_HSERDYF                            (0x1u<<5)
#define RCC_CIFR_MCG48RDYF                          (0x1u<<4)
#define RCC_CIFR_MCG3072RDYF                        (0x1u<<3)
#define RCC_CIFR_MCG256RDYF                         (0x1u<<2)
#define RCC_CIFR_LSERDYF                            (0x1u<<1)
#define RCC_CIFR_LSIRDYF                            (0x1u<<0)

#define RCC_CIFR_MCGPLLUF_B_0X0                     (0x0u<<20)
#define RCC_CIFR_MCGPLLUF_B_0X1                     (0x1u<<20)
#define RCC_CIFR_HSECSSF_B_0X0                      (0x0u<<17)
#define RCC_CIFR_HSECSSF_B_0X1                      (0x1u<<17)
#define RCC_CIFR_LSECSSF_B_0X0                      (0x0u<<16)
#define RCC_CIFR_LSECSSF_B_0X1                      (0x1u<<16)
#define RCC_CIFR_PLL2RDYF_B_0X0                     (0x0u<<9)
#define RCC_CIFR_PLL2RDYF_B_0X1                     (0x1u<<9)
#define RCC_CIFR_PLL1RDYF_B_0X0                     (0x0u<<8)
#define RCC_CIFR_PLL1RDYF_B_0X1                     (0x1u<<8)
#define RCC_CIFR_HSERDYF_B_0X0                      (0x0u<<5)
#define RCC_CIFR_HSERDYF_B_0X1                      (0x1u<<5)
#define RCC_CIFR_MCG48RDYF_B_0X0                    (0x0u<<4)
#define RCC_CIFR_MCG48RDYF_B_0X1                    (0x1u<<4)
#define RCC_CIFR_MCG3072RDYF_B_0X0                  (0x0u<<3)
#define RCC_CIFR_MCG3072RDYF_B_0X1                  (0x1u<<3)
#define RCC_CIFR_MCG256RDYF_B_0X0                   (0x0u<<2)
#define RCC_CIFR_MCG256RDYF_B_0X1                   (0x1u<<2)
#define RCC_CIFR_LSERDYF_B_0X0                      (0x0u<<1)
#define RCC_CIFR_LSERDYF_B_0X1                      (0x1u<<1)
#define RCC_CIFR_LSIRDYF_B_0X0                      (0x0u<<0)
#define RCC_CIFR_LSIRDYF_B_0X1                      (0x1u<<0)

// CICR Configuration

#define RCC_CICR_MCGPLLUC                           (0x1u<<20)
#define RCC_CICR_HSECSSC                            (0x1u<<17)
#define RCC_CICR_LSECSSC                            (0x1u<<16)
#define RCC_CICR_PLL2RDYC                           (0x1u<<9)
#define RCC_CICR_PLL1RDYC                           (0x1u<<8)
#define RCC_CICR_HSERDYC                            (0x1u<<5)
#define RCC_CICR_MCG48RDYC                          (0x1u<<4)
#define RCC_CICR_MCG3072RDYC                        (0x1u<<3)
#define RCC_CICR_MCG256RDYC                         (0x1u<<2)
#define RCC_CICR_LSERDYC                            (0x1u<<1)
#define RCC_CICR_LSIRDYC                            (0x1u<<0)

#define RCC_CICR_MCGPLLUC_B_0X0                     (0x0u<<20)
#define RCC_CICR_MCGPLLUC_B_0X1                     (0x1u<<20)
#define RCC_CICR_HSECSSC_B_0X0                      (0x0u<<17)
#define RCC_CICR_HSECSSC_B_0X1                      (0x1u<<17)
#define RCC_CICR_LSECSSC_B_0X0                      (0x0u<<16)
#define RCC_CICR_LSECSSC_B_0X1                      (0x1u<<16)
#define RCC_CICR_PLL2RDYC_B_0X0                     (0x0u<<9)
#define RCC_CICR_PLL2RDYC_B_0X1                     (0x1u<<9)
#define RCC_CICR_PLL1RDYC_B_0X0                     (0x0u<<8)
#define RCC_CICR_PLL1RDYC_B_0X1                     (0x1u<<8)
#define RCC_CICR_HSERDYC_B_0X0                      (0x0u<<5)
#define RCC_CICR_HSERDYC_B_0X1                      (0x1u<<5)
#define RCC_CICR_MCG48RDYC_B_0X0                    (0x0u<<4)
#define RCC_CICR_MCG48RDYC_B_0X1                    (0x1u<<4)
#define RCC_CICR_MCG3072RDYC_B_0X0                  (0x0u<<3)
#define RCC_CICR_MCG3072RDYC_B_0X1                  (0x1u<<3)
#define RCC_CICR_MCG256RDYC_B_0X0                   (0x0u<<2)
#define RCC_CICR_MCG256RDYC_B_0X1                   (0x1u<<2)
#define RCC_CICR_LSERDYC_B_0X0                      (0x0u<<1)
#define RCC_CICR_LSERDYC_B_0X1                      (0x1u<<1)
#define RCC_CICR_LSIRDYC_B_0X0                      (0x0u<<0)
#define RCC_CICR_LSIRDYC_B_0X1                      (0x1u<<0)

