Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/STM32V873/Includes/Registers/stm32V873_rcc.h
// BMCFGR Configuration

#define RCC_BMCFGR_BMPRE                            (0x3u<<0)
#define RCC_BMCFGR_BMPRE_0                          (0x1u<<0)

#define RCC_BMCFGR_BMPRE_B_0X0                      (0x0u<<0)
#define RCC_BMCFGR_BMPRE_B_0X1                      (0x1u<<0)
#define RCC_BMCFGR_BMPRE_B_0X2                      (0x2u<<0)

// AHBCFGR Configuration

#define RCC_AHBCFGR_HPRE                            (0x3u<<0)
#define RCC_AHBCFGR_HPRE_0                          (0x1u<<0)

#define RCC_AHBCFGR_HPRE_B_0X0                      (0x0u<<0)
#define RCC_AHBCFGR_HPRE_B_0X1                      (0x1u<<0)
#define RCC_AHBCFGR_HPRE_B_0X2                      (0x2u<<0)
#define RCC_AHBCFGR_HPRE_B_0X3                      (0x3u<<0)

// APBCFGR Configuration

#define RCC_APBCFGR_PPRE5                           (0x7u<<16)
#define RCC_APBCFGR_PPRE5_0                         (0x1u<<16)
#define RCC_APBCFGR_PPRE4                           (0x7u<<12)
#define RCC_APBCFGR_PPRE4_0                         (0x1u<<12)
#define RCC_APBCFGR_PPRE2                           (0x7u<<4)
#define RCC_APBCFGR_PPRE2_0                         (0x1u<<4)
#define RCC_APBCFGR_PPRE1                           (0x7u<<0)
#define RCC_APBCFGR_PPRE1_0                         (0x1u<<0)

#define RCC_APBCFGR_PPRE5_B_0X0                     (0x0u<<16)
#define RCC_APBCFGR_PPRE5_B_0X1                     (0x1u<<16)
#define RCC_APBCFGR_PPRE5_B_0X2                     (0x2u<<16)
#define RCC_APBCFGR_PPRE5_B_0X3                     (0x3u<<16)
#define RCC_APBCFGR_PPRE5_B_0X4                     (0x4u<<16)
#define RCC_APBCFGR_PPRE4_B_0X0                     (0x0u<<12)
#define RCC_APBCFGR_PPRE4_B_0X1                     (0x1u<<12)
#define RCC_APBCFGR_PPRE4_B_0X2                     (0x2u<<12)
#define RCC_APBCFGR_PPRE4_B_0X3                     (0x3u<<12)
#define RCC_APBCFGR_PPRE4_B_0X4                     (0x4u<<12)
#define RCC_APBCFGR_PPRE2_B_0X0                     (0x0u<<4)
#define RCC_APBCFGR_PPRE2_B_0X1                     (0x1u<<4)
#define RCC_APBCFGR_PPRE2_B_0X2                     (0x2u<<4)
#define RCC_APBCFGR_PPRE2_B_0X3                     (0x3u<<4)
#define RCC_APBCFGR_PPRE2_B_0X4                     (0x4u<<4)
#define RCC_APBCFGR_PPRE1_B_0X0                     (0x0u<<0)
#define RCC_APBCFGR_PPRE1_B_0X1                     (0x1u<<0)
#define RCC_APBCFGR_PPRE1_B_0X2                     (0x2u<<0)
#define RCC_APBCFGR_PPRE1_B_0X3                     (0x3u<<0)
#define RCC_APBCFGR_PPRE1_B_0X4                     (0x4u<<0)

// ICLKENR Configuration

#define RCC_ICLKENR_ICLK13EN                        (0x1u<<12)
#define RCC_ICLKENR_ICLK12EN                        (0x1u<<11)
#define RCC_ICLKENR_ICLK11EN                        (0x1u<<10)
#define RCC_ICLKENR_ICLK10EN                        (0x1u<<9)
#define RCC_ICLKENR_ICLK9EN                         (0x1u<<8)
#define RCC_ICLKENR_ICLK8EN                         (0x1u<<7)
#define RCC_ICLKENR_ICLK7EN                         (0x1u<<6)
#define RCC_ICLKENR_ICLK6EN                         (0x1u<<5)
#define RCC_ICLKENR_ICLK5EN                         (0x1u<<4)
#define RCC_ICLKENR_ICLK4EN                         (0x1u<<3)
#define RCC_ICLKENR_ICLK3EN                         (0x1u<<2)
#define RCC_ICLKENR_ICLK2EN                         (0x1u<<1)
#define RCC_ICLKENR_ICLK1EN                         (0x1u<<0)

#define RCC_ICLKENR_ICLK13EN_B_0X0                  (0x0u<<12)
#define RCC_ICLKENR_ICLK13EN_B_0X1                  (0x1u<<12)
#define RCC_ICLKENR_ICLK12EN_B_0X0                  (0x0u<<11)
#define RCC_ICLKENR_ICLK12EN_B_0X1                  (0x1u<<11)
#define RCC_ICLKENR_ICLK11EN_B_0X0                  (0x0u<<10)
#define RCC_ICLKENR_ICLK11EN_B_0X1                  (0x1u<<10)
#define RCC_ICLKENR_ICLK10EN_B_0X0                  (0x0u<<9)
#define RCC_ICLKENR_ICLK10EN_B_0X1                  (0x1u<<9)
#define RCC_ICLKENR_ICLK9EN_B_0X0                   (0x0u<<8)
#define RCC_ICLKENR_ICLK9EN_B_0X1                   (0x1u<<8)
#define RCC_ICLKENR_ICLK8EN_B_0X0                   (0x0u<<7)
#define RCC_ICLKENR_ICLK8EN_B_0X1                   (0x1u<<7)
#define RCC_ICLKENR_ICLK7EN_B_0X0                   (0x0u<<6)
#define RCC_ICLKENR_ICLK7EN_B_0X1                   (0x1u<<6)
#define RCC_ICLKENR_ICLK6EN_B_0X0                   (0x0u<<5)
#define RCC_ICLKENR_ICLK6EN_B_0X1                   (0x1u<<5)
#define RCC_ICLKENR_ICLK5EN_B_0X0                   (0x0u<<4)
#define RCC_ICLKENR_ICLK5EN_B_0X1                   (0x1u<<4)
#define RCC_ICLKENR_ICLK4EN_B_0X0                   (0x0u<<3)
#define RCC_ICLKENR_ICLK4EN_B_0X1                   (0x1u<<3)
#define RCC_ICLKENR_ICLK3EN_B_0X0                   (0x0u<<2)
#define RCC_ICLKENR_ICLK3EN_B_0X1                   (0x1u<<2)
#define RCC_ICLKENR_ICLK2EN_B_0X0                   (0x0u<<1)
#define RCC_ICLKENR_ICLK2EN_B_0X1                   (0x1u<<1)
#define RCC_ICLKENR_ICLK1EN_B_0X0                   (0x0u<<0)
#define RCC_ICLKENR_ICLK1EN_B_0X1                   (0x1u<<0)

// ICLK1CFGR Configuration

#define RCC_ICLK1CFGR_SEL                           (0x3u<<28)
#define RCC_ICLK1CFGR_SEL_0                         (0x1u<<28)
#define RCC_ICLK1CFGR_DIV                           (0xFFu<<16)
#define RCC_ICLK1CFGR_DIV_0                         (0x1u<<16)
#define RCC_ICLK1CFGR_FRAC                          (0x1Fu<<11)
#define RCC_ICLK1CFGR_FRAC_0                        (0x1u<<11)

#define RCC_ICLK1CFGR_SEL_B_0X0                     (0x0u<<28)
#define RCC_ICLK1CFGR_SEL_B_0X1                     (0x1u<<28)
#define RCC_ICLK1CFGR_SEL_B_0X2                     (0x2u<<28)
#define RCC_ICLK1CFGR_SEL_B_0X3                     (0x3u<<28)
#define RCC_ICLK1CFGR_DIV_B_0X0                     (0x0u<<16)
#define RCC_ICLK1CFGR_DIV_B_0X1                     (0x1u<<16)
#define RCC_ICLK1CFGR_DIV_B_0X2                     (0x2u<<16)
#define RCC_ICLK1CFGR_DIV_B_0X3                     (0x3u<<16)
#define RCC_ICLK1CFGR_DIV_B_0XFF                    (0xFFu<<16)
#define RCC_ICLK1CFGR_FRAC_B_0X0                    (0x0u<<11)
#define RCC_ICLK1CFGR_FRAC_B_0X1                    (0x1u<<11)
#define RCC_ICLK1CFGR_FRAC_B_0X2                    (0x2u<<11)
#define RCC_ICLK1CFGR_FRAC_B_0X1F                   (0x1Fu<<11)

// ICLK2CFGR Configuration

#define RCC_ICLK2CFGR_SEL                           (0x3u<<28)
#define RCC_ICLK2CFGR_SEL_0                         (0x1u<<28)
#define RCC_ICLK2CFGR_DIV                           (0xFFu<<16)
#define RCC_ICLK2CFGR_DIV_0                         (0x1u<<16)
#define RCC_ICLK2CFGR_FRAC                          (0x1Fu<<11)
#define RCC_ICLK2CFGR_FRAC_0                        (0x1u<<11)

#define RCC_ICLK2CFGR_SEL_B_0X0                     (0x0u<<28)
#define RCC_ICLK2CFGR_SEL_B_0X1                     (0x1u<<28)
#define RCC_ICLK2CFGR_SEL_B_0X2                     (0x2u<<28)
#define RCC_ICLK2CFGR_SEL_B_0X3                     (0x3u<<28)
#define RCC_ICLK2CFGR_DIV_B_0X0                     (0x0u<<16)
#define RCC_ICLK2CFGR_DIV_B_0X1                     (0x1u<<16)
#define RCC_ICLK2CFGR_DIV_B_0X2                     (0x2u<<16)
#define RCC_ICLK2CFGR_DIV_B_0X3                     (0x3u<<16)
#define RCC_ICLK2CFGR_DIV_B_0XFF                    (0xFFu<<16)
#define RCC_ICLK2CFGR_FRAC_B_0X0                    (0x0u<<11)
#define RCC_ICLK2CFGR_FRAC_B_0X1                    (0x1u<<11)
#define RCC_ICLK2CFGR_FRAC_B_0X2                    (0x2u<<11)
#define RCC_ICLK2CFGR_FRAC_B_0X1F                   (0x1Fu<<11)

// ICLK3CFGR Configuration

