Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/STM32V873/Includes/Registers/stm32V873_rcc.h
#define RCC_ICLK3CFGR_SEL                           (0x3u<<28)
#define RCC_ICLK3CFGR_SEL_0                         (0x1u<<28)
#define RCC_ICLK3CFGR_DIV                           (0xFFu<<16)
#define RCC_ICLK3CFGR_DIV_0                         (0x1u<<16)
#define RCC_ICLK3CFGR_FRAC                          (0x1Fu<<11)
#define RCC_ICLK3CFGR_FRAC_0                        (0x1u<<11)

#define RCC_ICLK3CFGR_SEL_B_0X0                     (0x0u<<28)
#define RCC_ICLK3CFGR_SEL_B_0X1                     (0x1u<<28)
#define RCC_ICLK3CFGR_SEL_B_0X2                     (0x2u<<28)
#define RCC_ICLK3CFGR_SEL_B_0X3                     (0x3u<<28)
#define RCC_ICLK3CFGR_DIV_B_0X0                     (0x0u<<16)
#define RCC_ICLK3CFGR_DIV_B_0X1                     (0x1u<<16)
#define RCC_ICLK3CFGR_DIV_B_0X2                     (0x2u<<16)
#define RCC_ICLK3CFGR_DIV_B_0X3                     (0x3u<<16)
#define RCC_ICLK3CFGR_DIV_B_0XFF                    (0xFFu<<16)
#define RCC_ICLK3CFGR_FRAC_B_0X0                    (0x0u<<11)
#define RCC_ICLK3CFGR_FRAC_B_0X1                    (0x1u<<11)
#define RCC_ICLK3CFGR_FRAC_B_0X2                    (0x2u<<11)
#define RCC_ICLK3CFGR_FRAC_B_0X1F                   (0x1Fu<<11)

// ICLK4CFGR Configuration

#define RCC_ICLK4CFGR_SEL                           (0x3u<<28)
#define RCC_ICLK4CFGR_SEL_0                         (0x1u<<28)
#define RCC_ICLK4CFGR_DIV                           (0xFFu<<16)
#define RCC_ICLK4CFGR_DIV_0                         (0x1u<<16)
#define RCC_ICLK4CFGR_FRAC                          (0x1Fu<<11)
#define RCC_ICLK4CFGR_FRAC_0                        (0x1u<<11)

#define RCC_ICLK4CFGR_SEL_B_0X0                     (0x0u<<28)
#define RCC_ICLK4CFGR_SEL_B_0X1                     (0x1u<<28)
#define RCC_ICLK4CFGR_SEL_B_0X2                     (0x2u<<28)
#define RCC_ICLK4CFGR_SEL_B_0X3                     (0x3u<<28)
#define RCC_ICLK4CFGR_DIV_B_0X0                     (0x0u<<16)
#define RCC_ICLK4CFGR_DIV_B_0X1                     (0x1u<<16)
#define RCC_ICLK4CFGR_DIV_B_0X2                     (0x2u<<16)
#define RCC_ICLK4CFGR_DIV_B_0X3                     (0x3u<<16)
#define RCC_ICLK4CFGR_DIV_B_0XFF                    (0xFFu<<16)
#define RCC_ICLK4CFGR_FRAC_B_0X0                    (0x0u<<11)
#define RCC_ICLK4CFGR_FRAC_B_0X1                    (0x1u<<11)
#define RCC_ICLK4CFGR_FRAC_B_0X2                    (0x2u<<11)
#define RCC_ICLK4CFGR_FRAC_B_0X1F                   (0x1Fu<<11)

// ICLK5CFGR Configuration

#define RCC_ICLK5CFGR_SEL                           (0x3u<<28)
#define RCC_ICLK5CFGR_SEL_0                         (0x1u<<28)
#define RCC_ICLK5CFGR_DIV                           (0xFFu<<16)
#define RCC_ICLK5CFGR_DIV_0                         (0x1u<<16)
#define RCC_ICLK5CFGR_FRAC                          (0x1Fu<<11)
#define RCC_ICLK5CFGR_FRAC_0                        (0x1u<<11)

#define RCC_ICLK5CFGR_SEL_B_0X0                     (0x0u<<28)
#define RCC_ICLK5CFGR_SEL_B_0X1                     (0x1u<<28)
#define RCC_ICLK5CFGR_SEL_B_0X2                     (0x2u<<28)
#define RCC_ICLK5CFGR_SEL_B_0X3                     (0x3u<<28)
#define RCC_ICLK5CFGR_DIV_B_0X0                     (0x0u<<16)
#define RCC_ICLK5CFGR_DIV_B_0X1                     (0x1u<<16)
#define RCC_ICLK5CFGR_DIV_B_0X2                     (0x2u<<16)
#define RCC_ICLK5CFGR_DIV_B_0X3                     (0x3u<<16)
#define RCC_ICLK5CFGR_DIV_B_0XFF                    (0xFFu<<16)
#define RCC_ICLK5CFGR_FRAC_B_0X0                    (0x0u<<11)
#define RCC_ICLK5CFGR_FRAC_B_0X1                    (0x1u<<11)
#define RCC_ICLK5CFGR_FRAC_B_0X2                    (0x2u<<11)
#define RCC_ICLK5CFGR_FRAC_B_0X1F                   (0x1Fu<<11)

// ICLK6CFGR Configuration

#define RCC_ICLK6CFGR_SEL                           (0x3u<<28)
#define RCC_ICLK6CFGR_SEL_0                         (0x1u<<28)
#define RCC_ICLK6CFGR_DIV                           (0xFFu<<16)
#define RCC_ICLK6CFGR_DIV_0                         (0x1u<<16)
#define RCC_ICLK6CFGR_FRAC                          (0x1Fu<<11)
#define RCC_ICLK6CFGR_FRAC_0                        (0x1u<<11)

#define RCC_ICLK6CFGR_SEL_B_0X0                     (0x0u<<28)
#define RCC_ICLK6CFGR_SEL_B_0X1                     (0x1u<<28)
#define RCC_ICLK6CFGR_SEL_B_0X2                     (0x2u<<28)
#define RCC_ICLK6CFGR_SEL_B_0X3                     (0x3u<<28)
#define RCC_ICLK6CFGR_DIV_B_0X0                     (0x0u<<16)
#define RCC_ICLK6CFGR_DIV_B_0X1                     (0x1u<<16)
#define RCC_ICLK6CFGR_DIV_B_0X2                     (0x2u<<16)
#define RCC_ICLK6CFGR_DIV_B_0X3                     (0x3u<<16)
#define RCC_ICLK6CFGR_DIV_B_0XFF                    (0xFFu<<16)
#define RCC_ICLK6CFGR_FRAC_B_0X0                    (0x0u<<11)
#define RCC_ICLK6CFGR_FRAC_B_0X1                    (0x1u<<11)
#define RCC_ICLK6CFGR_FRAC_B_0X2                    (0x2u<<11)
#define RCC_ICLK6CFGR_FRAC_B_0X1F                   (0x1Fu<<11)

// ICLK7CFGR Configuration

#define RCC_ICLK7CFGR_SEL                           (0x3u<<28)
#define RCC_ICLK7CFGR_SEL_0                         (0x1u<<28)
#define RCC_ICLK7CFGR_DIV                           (0xFFu<<16)
#define RCC_ICLK7CFGR_DIV_0                         (0x1u<<16)
#define RCC_ICLK7CFGR_FRAC                          (0x1Fu<<11)
#define RCC_ICLK7CFGR_FRAC_0                        (0x1u<<11)

#define RCC_ICLK7CFGR_SEL_B_0X0                     (0x0u<<28)
#define RCC_ICLK7CFGR_SEL_B_0X1                     (0x1u<<28)
#define RCC_ICLK7CFGR_SEL_B_0X2                     (0x2u<<28)
#define RCC_ICLK7CFGR_SEL_B_0X3                     (0x3u<<28)
#define RCC_ICLK7CFGR_DIV_B_0X0                     (0x0u<<16)
#define RCC_ICLK7CFGR_DIV_B_0X1                     (0x1u<<16)
#define RCC_ICLK7CFGR_DIV_B_0X2                     (0x2u<<16)
#define RCC_ICLK7CFGR_DIV_B_0X3                     (0x3u<<16)
#define RCC_ICLK7CFGR_DIV_B_0XFF                    (0xFFu<<16)
#define RCC_ICLK7CFGR_FRAC_B_0X0                    (0x0u<<11)
#define RCC_ICLK7CFGR_FRAC_B_0X1                    (0x1u<<11)
#define RCC_ICLK7CFGR_FRAC_B_0X2                    (0x2u<<11)
#define RCC_ICLK7CFGR_FRAC_B_0X1F                   (0x1Fu<<11)

// ICLK8CFGR Configuration

#define RCC_ICLK8CFGR_SEL                           (0x3u<<28)
#define RCC_ICLK8CFGR_SEL_0                         (0x1u<<28)
#define RCC_ICLK8CFGR_DIV                           (0xFFu<<16)
#define RCC_ICLK8CFGR_DIV_0                         (0x1u<<16)
#define RCC_ICLK8CFGR_FRAC                          (0x1Fu<<11)
#define RCC_ICLK8CFGR_FRAC_0                        (0x1u<<11)

#define RCC_ICLK8CFGR_SEL_B_0X0                     (0x0u<<28)
#define RCC_ICLK8CFGR_SEL_B_0X1                     (0x1u<<28)
#define RCC_ICLK8CFGR_SEL_B_0X2                     (0x2u<<28)
#define RCC_ICLK8CFGR_SEL_B_0X3                     (0x3u<<28)
#define RCC_ICLK8CFGR_DIV_B_0X0                     (0x0u<<16)
#define RCC_ICLK8CFGR_DIV_B_0X1                     (0x1u<<16)
#define RCC_ICLK8CFGR_DIV_B_0X2                     (0x2u<<16)
#define RCC_ICLK8CFGR_DIV_B_0X3                     (0x3u<<16)
#define RCC_ICLK8CFGR_DIV_B_0XFF                    (0xFFu<<16)
#define RCC_ICLK8CFGR_FRAC_B_0X0                    (0x0u<<11)
#define RCC_ICLK8CFGR_FRAC_B_0X1                    (0x1u<<11)
#define RCC_ICLK8CFGR_FRAC_B_0X2                    (0x2u<<11)
#define RCC_ICLK8CFGR_FRAC_B_0X1F                   (0x1Fu<<11)

// ICLK9CFGR Configuration

