Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/STM32V873/Includes/Registers/stm32V873_rcc.h
#define RCC_ICLK9CFGR_SEL                           (0x3u<<28)
#define RCC_ICLK9CFGR_SEL_0                         (0x1u<<28)
#define RCC_ICLK9CFGR_DIV                           (0xFFu<<16)
#define RCC_ICLK9CFGR_DIV_0                         (0x1u<<16)
#define RCC_ICLK9CFGR_FRAC                          (0x1Fu<<11)
#define RCC_ICLK9CFGR_FRAC_0                        (0x1u<<11)

#define RCC_ICLK9CFGR_SEL_B_0X0                     (0x0u<<28)
#define RCC_ICLK9CFGR_SEL_B_0X1                     (0x1u<<28)
#define RCC_ICLK9CFGR_SEL_B_0X2                     (0x2u<<28)
#define RCC_ICLK9CFGR_SEL_B_0X3                     (0x3u<<28)
#define RCC_ICLK9CFGR_DIV_B_0X0                     (0x0u<<16)
#define RCC_ICLK9CFGR_DIV_B_0X1                     (0x1u<<16)
#define RCC_ICLK9CFGR_DIV_B_0X2                     (0x2u<<16)
#define RCC_ICLK9CFGR_DIV_B_0X3                     (0x3u<<16)
#define RCC_ICLK9CFGR_DIV_B_0XFF                    (0xFFu<<16)
#define RCC_ICLK9CFGR_FRAC_B_0X0                    (0x0u<<11)
#define RCC_ICLK9CFGR_FRAC_B_0X1                    (0x1u<<11)
#define RCC_ICLK9CFGR_FRAC_B_0X2                    (0x2u<<11)
#define RCC_ICLK9CFGR_FRAC_B_0X1F                   (0x1Fu<<11)

// ICLK10CFGR Configuration

#define RCC_ICLK10CFGR_SEL                          (0x3u<<28)
#define RCC_ICLK10CFGR_SEL_0                        (0x1u<<28)
#define RCC_ICLK10CFGR_DIV                          (0xFFu<<16)
#define RCC_ICLK10CFGR_DIV_0                        (0x1u<<16)
#define RCC_ICLK10CFGR_FRAC                         (0x1Fu<<11)
#define RCC_ICLK10CFGR_FRAC_0                       (0x1u<<11)

#define RCC_ICLK10CFGR_SEL_B_0X0                    (0x0u<<28)
#define RCC_ICLK10CFGR_SEL_B_0X1                    (0x1u<<28)
#define RCC_ICLK10CFGR_SEL_B_0X2                    (0x2u<<28)
#define RCC_ICLK10CFGR_SEL_B_0X3                    (0x3u<<28)
#define RCC_ICLK10CFGR_DIV_B_0X0                    (0x0u<<16)
#define RCC_ICLK10CFGR_DIV_B_0X1                    (0x1u<<16)
#define RCC_ICLK10CFGR_DIV_B_0X2                    (0x2u<<16)
#define RCC_ICLK10CFGR_DIV_B_0X3                    (0x3u<<16)
#define RCC_ICLK10CFGR_DIV_B_0XFF                   (0xFFu<<16)
#define RCC_ICLK10CFGR_FRAC_B_0X0                   (0x0u<<11)
#define RCC_ICLK10CFGR_FRAC_B_0X1                   (0x1u<<11)
#define RCC_ICLK10CFGR_FRAC_B_0X2                   (0x2u<<11)
#define RCC_ICLK10CFGR_FRAC_B_0X1F                  (0x1Fu<<11)

// ICLK11CFGR Configuration

#define RCC_ICLK11CFGR_SEL                          (0x3u<<28)
#define RCC_ICLK11CFGR_SEL_0                        (0x1u<<28)
#define RCC_ICLK11CFGR_DIV                          (0xFFu<<16)
#define RCC_ICLK11CFGR_DIV_0                        (0x1u<<16)
#define RCC_ICLK11CFGR_FRAC                         (0x1Fu<<11)
#define RCC_ICLK11CFGR_FRAC_0                       (0x1u<<11)

#define RCC_ICLK11CFGR_SEL_B_0X0                    (0x0u<<28)
#define RCC_ICLK11CFGR_SEL_B_0X1                    (0x1u<<28)
#define RCC_ICLK11CFGR_SEL_B_0X2                    (0x2u<<28)
#define RCC_ICLK11CFGR_SEL_B_0X3                    (0x3u<<28)
#define RCC_ICLK11CFGR_DIV_B_0X0                    (0x0u<<16)
#define RCC_ICLK11CFGR_DIV_B_0X1                    (0x1u<<16)
#define RCC_ICLK11CFGR_DIV_B_0X2                    (0x2u<<16)
#define RCC_ICLK11CFGR_DIV_B_0X3                    (0x3u<<16)
#define RCC_ICLK11CFGR_DIV_B_0XFF                   (0xFFu<<16)
#define RCC_ICLK11CFGR_FRAC_B_0X0                   (0x0u<<11)
#define RCC_ICLK11CFGR_FRAC_B_0X1                   (0x1u<<11)
#define RCC_ICLK11CFGR_FRAC_B_0X2                   (0x2u<<11)
#define RCC_ICLK11CFGR_FRAC_B_0X1F                  (0x1Fu<<11)

// ICLK12CFGR Configuration

#define RCC_ICLK12CFGR_SEL                          (0x3u<<28)
#define RCC_ICLK12CFGR_SEL_0                        (0x1u<<28)
#define RCC_ICLK12CFGR_DIV                          (0xFFu<<16)
#define RCC_ICLK12CFGR_DIV_0                        (0x1u<<16)
#define RCC_ICLK12CFGR_FRAC                         (0x1Fu<<11)
#define RCC_ICLK12CFGR_FRAC_0                       (0x1u<<11)

#define RCC_ICLK12CFGR_SEL_B_0X0                    (0x0u<<28)
#define RCC_ICLK12CFGR_SEL_B_0X1                    (0x1u<<28)
#define RCC_ICLK12CFGR_SEL_B_0X2                    (0x2u<<28)
#define RCC_ICLK12CFGR_SEL_B_0X3                    (0x3u<<28)
#define RCC_ICLK12CFGR_DIV_B_0X0                    (0x0u<<16)
#define RCC_ICLK12CFGR_DIV_B_0X1                    (0x1u<<16)
#define RCC_ICLK12CFGR_DIV_B_0X2                    (0x2u<<16)
#define RCC_ICLK12CFGR_DIV_B_0X3                    (0x3u<<16)
#define RCC_ICLK12CFGR_DIV_B_0XFF                   (0xFFu<<16)
#define RCC_ICLK12CFGR_FRAC_B_0X0                   (0x0u<<11)
#define RCC_ICLK12CFGR_FRAC_B_0X1                   (0x1u<<11)
#define RCC_ICLK12CFGR_FRAC_B_0X2                   (0x2u<<11)
#define RCC_ICLK12CFGR_FRAC_B_0X1F                  (0x1Fu<<11)

// ICLK13CFGR Configuration

#define RCC_ICLK13CFGR_SEL                          (0x3u<<28)
#define RCC_ICLK13CFGR_SEL_0                        (0x1u<<28)
#define RCC_ICLK13CFGR_DIV                          (0xFFu<<16)
#define RCC_ICLK13CFGR_DIV_0                        (0x1u<<16)
#define RCC_ICLK13CFGR_FRAC                         (0x1Fu<<11)
#define RCC_ICLK13CFGR_FRAC_0                       (0x1u<<11)

#define RCC_ICLK13CFGR_SEL_B_0X0                    (0x0u<<28)
#define RCC_ICLK13CFGR_SEL_B_0X1                    (0x1u<<28)
#define RCC_ICLK13CFGR_SEL_B_0X2                    (0x2u<<28)
#define RCC_ICLK13CFGR_SEL_B_0X3                    (0x3u<<28)
#define RCC_ICLK13CFGR_DIV_B_0X0                    (0x0u<<16)
#define RCC_ICLK13CFGR_DIV_B_0X1                    (0x1u<<16)
#define RCC_ICLK13CFGR_DIV_B_0X2                    (0x2u<<16)
#define RCC_ICLK13CFGR_DIV_B_0X3                    (0x3u<<16)
#define RCC_ICLK13CFGR_DIV_B_0XFF                   (0xFFu<<16)
#define RCC_ICLK13CFGR_FRAC_B_0X0                   (0x0u<<11)
#define RCC_ICLK13CFGR_FRAC_B_0X1                   (0x1u<<11)
#define RCC_ICLK13CFGR_FRAC_B_0X2                   (0x2u<<11)
#define RCC_ICLK13CFGR_FRAC_B_0X1F                  (0x1Fu<<11)

