Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/STM32V873/Includes/Registers/stm32V873_rcc.h
// CCIPR1 Configuration

#define RCC_CCIPR1_UART8SEL                         (0xFu<<28)
#define RCC_CCIPR1_UART8SEL_0                       (0x1u<<28)
#define RCC_CCIPR1_UART7SEL                         (0xFu<<24)
#define RCC_CCIPR1_UART7SEL_0                       (0x1u<<24)
#define RCC_CCIPR1_USART6SEL                        (0xFu<<20)
#define RCC_CCIPR1_USART6SEL_0                      (0x1u<<20)
#define RCC_CCIPR1_UART5SEL                         (0xFu<<16)
#define RCC_CCIPR1_UART5SEL_0                       (0x1u<<16)
#define RCC_CCIPR1_UART4SEL                         (0xFu<<12)
#define RCC_CCIPR1_UART4SEL_0                       (0x1u<<12)
#define RCC_CCIPR1_USART3SEL                        (0xFu<<8)
#define RCC_CCIPR1_USART3SEL_0                      (0x1u<<8)
#define RCC_CCIPR1_USART2SEL                        (0xFu<<4)
#define RCC_CCIPR1_USART2SEL_0                      (0x1u<<4)
#define RCC_CCIPR1_USART1SEL                        (0xFu<<0)
#define RCC_CCIPR1_USART1SEL_0                      (0x1u<<0)

#define RCC_CCIPR1_UART8SEL_B_0X0                   (0x0u<<28)
#define RCC_CCIPR1_UART8SEL_B_0X1                   (0x1u<<28)
#define RCC_CCIPR1_UART8SEL_B_0X2                   (0x2u<<28)
#define RCC_CCIPR1_UART8SEL_B_0X3                   (0x3u<<28)
#define RCC_CCIPR1_UART8SEL_B_0X4                   (0x4u<<28)
#define RCC_CCIPR1_UART8SEL_B_0X5                   (0x5u<<28)
#define RCC_CCIPR1_UART8SEL_B_0X6                   (0x6u<<28)
#define RCC_CCIPR1_UART8SEL_B_0X7                   (0x7u<<28)
#define RCC_CCIPR1_UART8SEL_B_0X8                   (0x8u<<28)
#define RCC_CCIPR1_UART8SEL_B_0X9                   (0x9u<<28)
#define RCC_CCIPR1_UART7SEL_B_0X0                   (0x0u<<24)
#define RCC_CCIPR1_UART7SEL_B_0X1                   (0x1u<<24)
#define RCC_CCIPR1_UART7SEL_B_0X2                   (0x2u<<24)
#define RCC_CCIPR1_UART7SEL_B_0X3                   (0x3u<<24)
#define RCC_CCIPR1_UART7SEL_B_0X4                   (0x4u<<24)
#define RCC_CCIPR1_UART7SEL_B_0X5                   (0x5u<<24)
#define RCC_CCIPR1_UART7SEL_B_0X6                   (0x6u<<24)
#define RCC_CCIPR1_UART7SEL_B_0X7                   (0x7u<<24)
#define RCC_CCIPR1_UART7SEL_B_0X8                   (0x8u<<24)
#define RCC_CCIPR1_UART7SEL_B_0X9                   (0x9u<<24)
#define RCC_CCIPR1_USART6SEL_B_0X0                  (0x0u<<20)
#define RCC_CCIPR1_USART6SEL_B_0X1                  (0x1u<<20)
#define RCC_CCIPR1_USART6SEL_B_0X2                  (0x2u<<20)
#define RCC_CCIPR1_USART6SEL_B_0X3                  (0x3u<<20)
#define RCC_CCIPR1_USART6SEL_B_0X4                  (0x4u<<20)
#define RCC_CCIPR1_USART6SEL_B_0X5                  (0x5u<<20)
#define RCC_CCIPR1_USART6SEL_B_0X6                  (0x6u<<20)
#define RCC_CCIPR1_USART6SEL_B_0X7                  (0x7u<<20)
#define RCC_CCIPR1_USART6SEL_B_0X8                  (0x8u<<20)
#define RCC_CCIPR1_USART6SEL_B_0X9                  (0x9u<<20)
#define RCC_CCIPR1_UART5SEL_B_0X0                   (0x0u<<16)
#define RCC_CCIPR1_UART5SEL_B_0X1                   (0x1u<<16)
#define RCC_CCIPR1_UART5SEL_B_0X2                   (0x2u<<16)
#define RCC_CCIPR1_UART5SEL_B_0X3                   (0x3u<<16)
#define RCC_CCIPR1_UART5SEL_B_0X4                   (0x4u<<16)
#define RCC_CCIPR1_UART5SEL_B_0X5                   (0x5u<<16)
#define RCC_CCIPR1_UART5SEL_B_0X6                   (0x6u<<16)
#define RCC_CCIPR1_UART5SEL_B_0X7                   (0x7u<<16)
#define RCC_CCIPR1_UART5SEL_B_0X8                   (0x8u<<16)
#define RCC_CCIPR1_UART5SEL_B_0X9                   (0x9u<<16)
#define RCC_CCIPR1_UART4SEL_B_0X0                   (0x0u<<12)
#define RCC_CCIPR1_UART4SEL_B_0X1                   (0x1u<<12)
#define RCC_CCIPR1_UART4SEL_B_0X2                   (0x2u<<12)
#define RCC_CCIPR1_UART4SEL_B_0X3                   (0x3u<<12)
#define RCC_CCIPR1_UART4SEL_B_0X4                   (0x4u<<12)
#define RCC_CCIPR1_UART4SEL_B_0X5                   (0x5u<<12)
#define RCC_CCIPR1_UART4SEL_B_0X6                   (0x6u<<12)
#define RCC_CCIPR1_UART4SEL_B_0X7                   (0x7u<<12)
#define RCC_CCIPR1_UART4SEL_B_0X8                   (0x8u<<12)
#define RCC_CCIPR1_UART4SEL_B_0X9                   (0x9u<<12)
#define RCC_CCIPR1_USART3SEL_B_0X0                  (0x0u<<8)
#define RCC_CCIPR1_USART3SEL_B_0X1                  (0x1u<<8)
#define RCC_CCIPR1_USART3SEL_B_0X2                  (0x2u<<8)
#define RCC_CCIPR1_USART3SEL_B_0X3                  (0x3u<<8)
#define RCC_CCIPR1_USART3SEL_B_0X4                  (0x4u<<8)
#define RCC_CCIPR1_USART3SEL_B_0X5                  (0x5u<<8)
#define RCC_CCIPR1_USART3SEL_B_0X6                  (0x6u<<8)
#define RCC_CCIPR1_USART3SEL_B_0X7                  (0x7u<<8)
#define RCC_CCIPR1_USART3SEL_B_0X8                  (0x8u<<8)
#define RCC_CCIPR1_USART3SEL_B_0X9                  (0x9u<<8)
#define RCC_CCIPR1_USART2SEL_B_0X0                  (0x0u<<4)
#define RCC_CCIPR1_USART2SEL_B_0X1                  (0x1u<<4)
#define RCC_CCIPR1_USART2SEL_B_0X2                  (0x2u<<4)
#define RCC_CCIPR1_USART2SEL_B_0X3                  (0x3u<<4)
#define RCC_CCIPR1_USART2SEL_B_0X4                  (0x4u<<4)
#define RCC_CCIPR1_USART2SEL_B_0X5                  (0x5u<<4)
#define RCC_CCIPR1_USART2SEL_B_0X6                  (0x6u<<4)
#define RCC_CCIPR1_USART2SEL_B_0X7                  (0x7u<<4)
#define RCC_CCIPR1_USART2SEL_B_0X8                  (0x8u<<4)
#define RCC_CCIPR1_USART2SEL_B_0X9                  (0x9u<<4)
#define RCC_CCIPR1_USART1SEL_B_0X0                  (0x0u<<0)
#define RCC_CCIPR1_USART1SEL_B_0X1                  (0x1u<<0)
#define RCC_CCIPR1_USART1SEL_B_0X2                  (0x2u<<0)
#define RCC_CCIPR1_USART1SEL_B_0X3                  (0x3u<<0)
#define RCC_CCIPR1_USART1SEL_B_0X4                  (0x4u<<0)
#define RCC_CCIPR1_USART1SEL_B_0X5                  (0x5u<<0)
#define RCC_CCIPR1_USART1SEL_B_0X6                  (0x6u<<0)
#define RCC_CCIPR1_USART1SEL_B_0X7                  (0x7u<<0)
#define RCC_CCIPR1_USART1SEL_B_0X8                  (0x8u<<0)
#define RCC_CCIPR1_USART1SEL_B_0X9                  (0x9u<<0)

// CCIPR2 Configuration

#define RCC_CCIPR2_LPUART1SEL                       (0xFu<<16)
#define RCC_CCIPR2_LPUART1SEL_0                     (0x1u<<16)
#define RCC_CCIPR2_USART10SEL                       (0xFu<<4)
#define RCC_CCIPR2_USART10SEL_0                     (0x1u<<4)
#define RCC_CCIPR2_UART9SEL                         (0xFu<<0)
#define RCC_CCIPR2_UART9SEL_0                       (0x1u<<0)

