Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/STM32V873/Includes/Registers/stm32V873_rcc.h
#define RCC_CCIPR2_LPUART1SEL_B_0X0                 (0x0u<<16)
#define RCC_CCIPR2_LPUART1SEL_B_0X1                 (0x1u<<16)
#define RCC_CCIPR2_LPUART1SEL_B_0X2                 (0x2u<<16)
#define RCC_CCIPR2_LPUART1SEL_B_0X3                 (0x3u<<16)
#define RCC_CCIPR2_LPUART1SEL_B_0X4                 (0x4u<<16)
#define RCC_CCIPR2_LPUART1SEL_B_0X5                 (0x5u<<16)
#define RCC_CCIPR2_LPUART1SEL_B_0X6                 (0x6u<<16)
#define RCC_CCIPR2_LPUART1SEL_B_0X7                 (0x7u<<16)
#define RCC_CCIPR2_LPUART1SEL_B_0X8                 (0x8u<<16)
#define RCC_CCIPR2_LPUART1SEL_B_0X9                 (0x9u<<16)
#define RCC_CCIPR2_USART10SEL_B_0X0                 (0x0u<<4)
#define RCC_CCIPR2_USART10SEL_B_0X1                 (0x1u<<4)
#define RCC_CCIPR2_USART10SEL_B_0X2                 (0x2u<<4)
#define RCC_CCIPR2_USART10SEL_B_0X3                 (0x3u<<4)
#define RCC_CCIPR2_USART10SEL_B_0X4                 (0x4u<<4)
#define RCC_CCIPR2_USART10SEL_B_0X5                 (0x5u<<4)
#define RCC_CCIPR2_USART10SEL_B_0X6                 (0x6u<<4)
#define RCC_CCIPR2_USART10SEL_B_0X7                 (0x7u<<4)
#define RCC_CCIPR2_USART10SEL_B_0X8                 (0x8u<<4)
#define RCC_CCIPR2_USART10SEL_B_0X9                 (0x9u<<4)
#define RCC_CCIPR2_UART9SEL_B_0X0                   (0x0u<<0)
#define RCC_CCIPR2_UART9SEL_B_0X1                   (0x1u<<0)
#define RCC_CCIPR2_UART9SEL_B_0X2                   (0x2u<<0)
#define RCC_CCIPR2_UART9SEL_B_0X3                   (0x3u<<0)
#define RCC_CCIPR2_UART9SEL_B_0X4                   (0x4u<<0)
#define RCC_CCIPR2_UART9SEL_B_0X5                   (0x5u<<0)
#define RCC_CCIPR2_UART9SEL_B_0X6                   (0x6u<<0)
#define RCC_CCIPR2_UART9SEL_B_0X7                   (0x7u<<0)
#define RCC_CCIPR2_UART9SEL_B_0X8                   (0x8u<<0)
#define RCC_CCIPR2_UART9SEL_B_0X9                   (0x9u<<0)

// CCIPR3 Configuration

#define RCC_CCIPR3_SPI6SEL                          (0xFu<<20)
#define RCC_CCIPR3_SPI6SEL_0                        (0x1u<<20)
#define RCC_CCIPR3_SPI5SEL                          (0xFu<<16)
#define RCC_CCIPR3_SPI5SEL_0                        (0x1u<<16)
#define RCC_CCIPR3_SPI4SEL                          (0xFu<<12)
#define RCC_CCIPR3_SPI4SEL_0                        (0x1u<<12)
#define RCC_CCIPR3_SPI3SEL                          (0xFu<<8)
#define RCC_CCIPR3_SPI3SEL_0                        (0x1u<<8)
#define RCC_CCIPR3_SPI2SEL                          (0xFu<<4)
#define RCC_CCIPR3_SPI2SEL_0                        (0x1u<<4)
#define RCC_CCIPR3_SPI1SEL                          (0xFu<<0)
#define RCC_CCIPR3_SPI1SEL_0                        (0x1u<<0)

#define RCC_CCIPR3_SPI6SEL_B_0X0                    (0x0u<<20)
#define RCC_CCIPR3_SPI6SEL_B_0X1                    (0x1u<<20)
#define RCC_CCIPR3_SPI6SEL_B_0X2                    (0x2u<<20)
#define RCC_CCIPR3_SPI6SEL_B_0X3                    (0x3u<<20)
#define RCC_CCIPR3_SPI6SEL_B_0X4                    (0x4u<<20)
#define RCC_CCIPR3_SPI6SEL_B_0X5                    (0x5u<<20)
#define RCC_CCIPR3_SPI6SEL_B_0X6                    (0x6u<<20)
#define RCC_CCIPR3_SPI6SEL_B_0X7                    (0x7u<<20)
#define RCC_CCIPR3_SPI6SEL_B_0X8                    (0x8u<<20)
#define RCC_CCIPR3_SPI6SEL_B_0X9                    (0x9u<<20)
#define RCC_CCIPR3_SPI5SEL_B_0X0                    (0x0u<<16)
#define RCC_CCIPR3_SPI5SEL_B_0X1                    (0x1u<<16)
#define RCC_CCIPR3_SPI5SEL_B_0X2                    (0x2u<<16)
#define RCC_CCIPR3_SPI5SEL_B_0X3                    (0x3u<<16)
#define RCC_CCIPR3_SPI5SEL_B_0X4                    (0x4u<<16)
#define RCC_CCIPR3_SPI5SEL_B_0X5                    (0x5u<<16)
#define RCC_CCIPR3_SPI5SEL_B_0X6                    (0x6u<<16)
#define RCC_CCIPR3_SPI5SEL_B_0X7                    (0x7u<<16)
#define RCC_CCIPR3_SPI5SEL_B_0X8                    (0x8u<<16)
#define RCC_CCIPR3_SPI5SEL_B_0X9                    (0x9u<<16)
#define RCC_CCIPR3_SPI4SEL_B_0X0                    (0x0u<<12)
#define RCC_CCIPR3_SPI4SEL_B_0X1                    (0x1u<<12)
#define RCC_CCIPR3_SPI4SEL_B_0X2                    (0x2u<<12)
#define RCC_CCIPR3_SPI4SEL_B_0X3                    (0x3u<<12)
#define RCC_CCIPR3_SPI4SEL_B_0X4                    (0x4u<<12)
#define RCC_CCIPR3_SPI4SEL_B_0X5                    (0x5u<<12)
#define RCC_CCIPR3_SPI4SEL_B_0X6                    (0x6u<<12)
#define RCC_CCIPR3_SPI4SEL_B_0X7                    (0x7u<<12)
#define RCC_CCIPR3_SPI4SEL_B_0X8                    (0x8u<<12)
#define RCC_CCIPR3_SPI4SEL_B_0X9                    (0x9u<<12)
#define RCC_CCIPR3_SPI3SEL_B_0X0                    (0x0u<<8)
#define RCC_CCIPR3_SPI3SEL_B_0X1                    (0x1u<<8)
#define RCC_CCIPR3_SPI3SEL_B_0X2                    (0x2u<<8)
#define RCC_CCIPR3_SPI3SEL_B_0X3                    (0x3u<<8)
#define RCC_CCIPR3_SPI3SEL_B_0X4                    (0x4u<<8)
#define RCC_CCIPR3_SPI3SEL_B_0X5                    (0x5u<<8)
#define RCC_CCIPR3_SPI3SEL_B_0X6                    (0x6u<<8)
#define RCC_CCIPR3_SPI3SEL_B_0X7                    (0x7u<<8)
#define RCC_CCIPR3_SPI3SEL_B_0X8                    (0x8u<<8)
#define RCC_CCIPR3_SPI3SEL_B_0X9                    (0x9u<<8)
#define RCC_CCIPR3_SPI3SEL_B_0XA                    (0xAu<<8)
#define RCC_CCIPR3_SPI3SEL_B_0XB                    (0xBu<<8)
#define RCC_CCIPR3_SPI3SEL_B_0XC                    (0xCu<<8)
#define RCC_CCIPR3_SPI3SEL_B_0XD                    (0xDu<<8)
#define RCC_CCIPR3_SPI3SEL_B_0XE                    (0xEu<<8)
#define RCC_CCIPR3_SPI3SEL_B_0XF                    (0xFu<<8)
#define RCC_CCIPR3_SPI2SEL_B_0X0                    (0x0u<<4)
#define RCC_CCIPR3_SPI2SEL_B_0X1                    (0x1u<<4)
#define RCC_CCIPR3_SPI2SEL_B_0X2                    (0x2u<<4)
#define RCC_CCIPR3_SPI2SEL_B_0X3                    (0x3u<<4)
#define RCC_CCIPR3_SPI2SEL_B_0X4                    (0x4u<<4)
#define RCC_CCIPR3_SPI2SEL_B_0X5                    (0x5u<<4)
#define RCC_CCIPR3_SPI2SEL_B_0X6                    (0x6u<<4)
#define RCC_CCIPR3_SPI2SEL_B_0X7                    (0x7u<<4)
#define RCC_CCIPR3_SPI2SEL_B_0X8                    (0x8u<<4)
#define RCC_CCIPR3_SPI2SEL_B_0X9                    (0x9u<<4)
#define RCC_CCIPR3_SPI2SEL_B_0XA                    (0xAu<<4)
#define RCC_CCIPR3_SPI2SEL_B_0XB                    (0xBu<<4)
#define RCC_CCIPR3_SPI2SEL_B_0XC                    (0xCu<<4)
#define RCC_CCIPR3_SPI2SEL_B_0XD                    (0xDu<<4)
#define RCC_CCIPR3_SPI2SEL_B_0XE                    (0xEu<<4)
#define RCC_CCIPR3_SPI2SEL_B_0XF                    (0xFu<<4)
#define RCC_CCIPR3_SPI1SEL_B_0X0                    (0x0u<<0)
#define RCC_CCIPR3_SPI1SEL_B_0X1                    (0x1u<<0)
#define RCC_CCIPR3_SPI1SEL_B_0X2                    (0x2u<<0)
#define RCC_CCIPR3_SPI1SEL_B_0X3                    (0x3u<<0)
#define RCC_CCIPR3_SPI1SEL_B_0X4                    (0x4u<<0)
#define RCC_CCIPR3_SPI1SEL_B_0X5                    (0x5u<<0)
#define RCC_CCIPR3_SPI1SEL_B_0X6                    (0x6u<<0)
#define RCC_CCIPR3_SPI1SEL_B_0X7                    (0x7u<<0)
#define RCC_CCIPR3_SPI1SEL_B_0X8                    (0x8u<<0)
#define RCC_CCIPR3_SPI1SEL_B_0X9                    (0x9u<<0)
#define RCC_CCIPR3_SPI1SEL_B_0XA                    (0xAu<<0)
#define RCC_CCIPR3_SPI1SEL_B_0XB                    (0xBu<<0)
#define RCC_CCIPR3_SPI1SEL_B_0XC                    (0xCu<<0)
#define RCC_CCIPR3_SPI1SEL_B_0XD                    (0xDu<<0)
#define RCC_CCIPR3_SPI1SEL_B_0XE                    (0xEu<<0)
#define RCC_CCIPR3_SPI1SEL_B_0XF                    (0xFu<<0)

// CCIPR4 Configuration

#define RCC_CCIPR4_I2C3SEL                          (0xFu<<8)
#define RCC_CCIPR4_I2C3SEL_0                        (0x1u<<8)
#define RCC_CCIPR4_I2C2SEL                          (0xFu<<4)
#define RCC_CCIPR4_I2C2SEL_0                        (0x1u<<4)
#define RCC_CCIPR4_I2C1SEL                          (0xFu<<0)
#define RCC_CCIPR4_I2C1SEL_0                        (0x1u<<0)

#define RCC_CCIPR4_I2C3SEL_B_0X0                    (0x0u<<8)
#define RCC_CCIPR4_I2C3SEL_B_0X1                    (0x1u<<8)
#define RCC_CCIPR4_I2C3SEL_B_0X2                    (0x2u<<8)
#define RCC_CCIPR4_I2C3SEL_B_0X3                    (0x3u<<8)
#define RCC_CCIPR4_I2C3SEL_B_0X4                    (0x4u<<8)
#define RCC_CCIPR4_I2C3SEL_B_0X5                    (0x5u<<8)
#define RCC_CCIPR4_I2C3SEL_B_0X6                    (0x6u<<8)
#define RCC_CCIPR4_I2C3SEL_B_0X7                    (0x7u<<8)
#define RCC_CCIPR4_I2C3SEL_B_0X8                    (0x8u<<8)
#define RCC_CCIPR4_I2C3SEL_B_0X9                    (0x9u<<8)
#define RCC_CCIPR4_I2C2SEL_B_0X0                    (0x0u<<4)
#define RCC_CCIPR4_I2C2SEL_B_0X1                    (0x1u<<4)
#define RCC_CCIPR4_I2C2SEL_B_0X2                    (0x2u<<4)
#define RCC_CCIPR4_I2C2SEL_B_0X3                    (0x3u<<4)
#define RCC_CCIPR4_I2C2SEL_B_0X4                    (0x4u<<4)
#define RCC_CCIPR4_I2C2SEL_B_0X5                    (0x5u<<4)
#define RCC_CCIPR4_I2C2SEL_B_0X6                    (0x6u<<4)
#define RCC_CCIPR4_I2C2SEL_B_0X7                    (0x7u<<4)
#define RCC_CCIPR4_I2C2SEL_B_0X8                    (0x8u<<4)
#define RCC_CCIPR4_I2C2SEL_B_0X9                    (0x9u<<4)
#define RCC_CCIPR4_I2C1SEL_B_0X0                    (0x0u<<0)
#define RCC_CCIPR4_I2C1SEL_B_0X1                    (0x1u<<0)
#define RCC_CCIPR4_I2C1SEL_B_0X2                    (0x2u<<0)
#define RCC_CCIPR4_I2C1SEL_B_0X3                    (0x3u<<0)
#define RCC_CCIPR4_I2C1SEL_B_0X4                    (0x4u<<0)
#define RCC_CCIPR4_I2C1SEL_B_0X5                    (0x5u<<0)
#define RCC_CCIPR4_I2C1SEL_B_0X6                    (0x6u<<0)
#define RCC_CCIPR4_I2C1SEL_B_0X7                    (0x7u<<0)
#define RCC_CCIPR4_I2C1SEL_B_0X8                    (0x8u<<0)
#define RCC_CCIPR4_I2C1SEL_B_0X9                    (0x9u<<0)

// CCIPR5 Configuration

