Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/STM32V873/Includes/Registers/stm32V873_rcc.h
#define RCC_CCIPR5_SAI2SEL                          (0xFu<<20)
#define RCC_CCIPR5_SAI2SEL_0                        (0x1u<<20)
#define RCC_CCIPR5_SAI1SEL                          (0xFu<<16)
#define RCC_CCIPR5_SAI1SEL_0                        (0x1u<<16)
#define RCC_CCIPR5_I3C2SEL                          (0xFu<<4)
#define RCC_CCIPR5_I3C2SEL_0                        (0x1u<<4)
#define RCC_CCIPR5_I3C1SEL                          (0xFu<<0)
#define RCC_CCIPR5_I3C1SEL_0                        (0x1u<<0)

#define RCC_CCIPR5_SAI2SEL_B_0X0                    (0x0u<<20)
#define RCC_CCIPR5_SAI2SEL_B_0X1                    (0x1u<<20)
#define RCC_CCIPR5_SAI2SEL_B_0X2                    (0x2u<<20)
#define RCC_CCIPR5_SAI2SEL_B_0X3                    (0x3u<<20)
#define RCC_CCIPR5_SAI2SEL_B_0X4                    (0x4u<<20)
#define RCC_CCIPR5_SAI2SEL_B_0X5                    (0x5u<<20)
#define RCC_CCIPR5_SAI2SEL_B_0X6                    (0x6u<<20)
#define RCC_CCIPR5_SAI2SEL_B_0X7                    (0x7u<<20)
#define RCC_CCIPR5_SAI2SEL_B_0X8                    (0x8u<<20)
#define RCC_CCIPR5_SAI2SEL_B_0X9                    (0x9u<<20)
#define RCC_CCIPR5_SAI2SEL_B_0XA                    (0xAu<<20)
#define RCC_CCIPR5_SAI2SEL_B_0XB                    (0xBu<<20)
#define RCC_CCIPR5_SAI2SEL_B_0XC                    (0xCu<<20)
#define RCC_CCIPR5_SAI2SEL_B_0XD                    (0xDu<<20)
#define RCC_CCIPR5_SAI2SEL_B_0XE                    (0xEu<<20)
#define RCC_CCIPR5_SAI2SEL_B_0XF                    (0xFu<<20)
#define RCC_CCIPR5_SAI1SEL_B_0X0                    (0x0u<<16)
#define RCC_CCIPR5_SAI1SEL_B_0X1                    (0x1u<<16)
#define RCC_CCIPR5_SAI1SEL_B_0X2                    (0x2u<<16)
#define RCC_CCIPR5_SAI1SEL_B_0X3                    (0x3u<<16)
#define RCC_CCIPR5_SAI1SEL_B_0X4                    (0x4u<<16)
#define RCC_CCIPR5_SAI1SEL_B_0X5                    (0x5u<<16)
#define RCC_CCIPR5_SAI1SEL_B_0X6                    (0x6u<<16)
#define RCC_CCIPR5_SAI1SEL_B_0X7                    (0x7u<<16)
#define RCC_CCIPR5_SAI1SEL_B_0X8                    (0x8u<<16)
#define RCC_CCIPR5_SAI1SEL_B_0X9                    (0x9u<<16)
#define RCC_CCIPR5_SAI1SEL_B_0XA                    (0xAu<<16)
#define RCC_CCIPR5_SAI1SEL_B_0XB                    (0xBu<<16)
#define RCC_CCIPR5_SAI1SEL_B_0XC                    (0xCu<<16)
#define RCC_CCIPR5_SAI1SEL_B_0XD                    (0xDu<<16)
#define RCC_CCIPR5_SAI1SEL_B_0XE                    (0xEu<<16)
#define RCC_CCIPR5_SAI1SEL_B_0XF                    (0xFu<<16)
#define RCC_CCIPR5_I3C2SEL_B_0X0                    (0x0u<<4)
#define RCC_CCIPR5_I3C2SEL_B_0X1                    (0x1u<<4)
#define RCC_CCIPR5_I3C2SEL_B_0X2                    (0x2u<<4)
#define RCC_CCIPR5_I3C2SEL_B_0X3                    (0x3u<<4)
#define RCC_CCIPR5_I3C2SEL_B_0X4                    (0x4u<<4)
#define RCC_CCIPR5_I3C2SEL_B_0X5                    (0x5u<<4)
#define RCC_CCIPR5_I3C2SEL_B_0X6                    (0x6u<<4)
#define RCC_CCIPR5_I3C2SEL_B_0X7                    (0x7u<<4)
#define RCC_CCIPR5_I3C2SEL_B_0X8                    (0x8u<<4)
#define RCC_CCIPR5_I3C2SEL_B_0X9                    (0x9u<<4)
#define RCC_CCIPR5_I3C1SEL_B_0X0                    (0x0u<<0)
#define RCC_CCIPR5_I3C1SEL_B_0X1                    (0x1u<<0)
#define RCC_CCIPR5_I3C1SEL_B_0X2                    (0x2u<<0)
#define RCC_CCIPR5_I3C1SEL_B_0X3                    (0x3u<<0)
#define RCC_CCIPR5_I3C1SEL_B_0X4                    (0x4u<<0)
#define RCC_CCIPR5_I3C1SEL_B_0X5                    (0x5u<<0)
#define RCC_CCIPR5_I3C1SEL_B_0X6                    (0x6u<<0)
#define RCC_CCIPR5_I3C1SEL_B_0X7                    (0x7u<<0)
#define RCC_CCIPR5_I3C1SEL_B_0X8                    (0x8u<<0)
#define RCC_CCIPR5_I3C1SEL_B_0X9                    (0x9u<<0)

// CCIPR6 Configuration

#define RCC_CCIPR6_SYSTICKSEL                       (0x3u<<28)
#define RCC_CCIPR6_SYSTICKSEL_0                     (0x1u<<28)
#define RCC_CCIPR6_HRTIM1SEL                        (0x1u<<24)
#define RCC_CCIPR6_LPTIM5SEL                        (0xFu<<16)
#define RCC_CCIPR6_LPTIM5SEL_0                      (0x1u<<16)
#define RCC_CCIPR6_LPTIM4SEL                        (0xFu<<12)
#define RCC_CCIPR6_LPTIM4SEL_0                      (0x1u<<12)
#define RCC_CCIPR6_LPTIM3SEL                        (0xFu<<8)
#define RCC_CCIPR6_LPTIM3SEL_0                      (0x1u<<8)
#define RCC_CCIPR6_LPTIM2SEL                        (0xFu<<4)
#define RCC_CCIPR6_LPTIM2SEL_0                      (0x1u<<4)
#define RCC_CCIPR6_LPTIM1SEL                        (0xFu<<0)
#define RCC_CCIPR6_LPTIM1SEL_0                      (0x1u<<0)

#define RCC_CCIPR6_SYSTICKSEL_B_0X0                 (0x0u<<28)
#define RCC_CCIPR6_SYSTICKSEL_B_0X1                 (0x1u<<28)
#define RCC_CCIPR6_SYSTICKSEL_B_0X2                 (0x2u<<28)
#define RCC_CCIPR6_SYSTICKSEL_B_0X3                 (0x3u<<28)
#define RCC_CCIPR6_HRTIM1SEL_B_0X0                  (0x0u<<24)
#define RCC_CCIPR6_HRTIM1SEL_B_0X1                  (0x1u<<24)
#define RCC_CCIPR6_LPTIM5SEL_B_0X0                  (0x0u<<16)
#define RCC_CCIPR6_LPTIM5SEL_B_0X1                  (0x1u<<16)
#define RCC_CCIPR6_LPTIM5SEL_B_0X2                  (0x2u<<16)
#define RCC_CCIPR6_LPTIM5SEL_B_0X3                  (0x3u<<16)
#define RCC_CCIPR6_LPTIM5SEL_B_0X4                  (0x4u<<16)
#define RCC_CCIPR6_LPTIM5SEL_B_0X5                  (0x5u<<16)
#define RCC_CCIPR6_LPTIM5SEL_B_0X6                  (0x6u<<16)
#define RCC_CCIPR6_LPTIM5SEL_B_0X7                  (0x7u<<16)
#define RCC_CCIPR6_LPTIM5SEL_B_0X8                  (0x8u<<16)
#define RCC_CCIPR6_LPTIM5SEL_B_0X9                  (0x9u<<16)
#define RCC_CCIPR6_LPTIM5SEL_B_0XA                  (0xAu<<16)
#define RCC_CCIPR6_LPTIM5SEL_B_0XB                  (0xBu<<16)
#define RCC_CCIPR6_LPTIM5SEL_B_0XC                  (0xCu<<16)
#define RCC_CCIPR6_LPTIM5SEL_B_0XD                  (0xDu<<16)
#define RCC_CCIPR6_LPTIM4SEL_B_0X0                  (0x0u<<12)
#define RCC_CCIPR6_LPTIM4SEL_B_0X1                  (0x1u<<12)
#define RCC_CCIPR6_LPTIM4SEL_B_0X2                  (0x2u<<12)
#define RCC_CCIPR6_LPTIM4SEL_B_0X3                  (0x3u<<12)
#define RCC_CCIPR6_LPTIM4SEL_B_0X4                  (0x4u<<12)
#define RCC_CCIPR6_LPTIM4SEL_B_0X5                  (0x5u<<12)
#define RCC_CCIPR6_LPTIM4SEL_B_0X6                  (0x6u<<12)
#define RCC_CCIPR6_LPTIM4SEL_B_0X7                  (0x7u<<12)
#define RCC_CCIPR6_LPTIM4SEL_B_0X8                  (0x8u<<12)
#define RCC_CCIPR6_LPTIM4SEL_B_0X9                  (0x9u<<12)
#define RCC_CCIPR6_LPTIM4SEL_B_0XA                  (0xAu<<12)
#define RCC_CCIPR6_LPTIM4SEL_B_0XB                  (0xBu<<12)
#define RCC_CCIPR6_LPTIM4SEL_B_0XC                  (0xCu<<12)
#define RCC_CCIPR6_LPTIM4SEL_B_0XD                  (0xDu<<12)
#define RCC_CCIPR6_LPTIM3SEL_B_0X0                  (0x0u<<8)
#define RCC_CCIPR6_LPTIM3SEL_B_0X1                  (0x1u<<8)
#define RCC_CCIPR6_LPTIM3SEL_B_0X2                  (0x2u<<8)
#define RCC_CCIPR6_LPTIM3SEL_B_0X3                  (0x3u<<8)
#define RCC_CCIPR6_LPTIM3SEL_B_0X4                  (0x4u<<8)
#define RCC_CCIPR6_LPTIM3SEL_B_0X5                  (0x5u<<8)
#define RCC_CCIPR6_LPTIM3SEL_B_0X6                  (0x6u<<8)
#define RCC_CCIPR6_LPTIM3SEL_B_0X7                  (0x7u<<8)
#define RCC_CCIPR6_LPTIM3SEL_B_0X8                  (0x8u<<8)
#define RCC_CCIPR6_LPTIM3SEL_B_0X9                  (0x9u<<8)
#define RCC_CCIPR6_LPTIM3SEL_B_0XA                  (0xAu<<8)
#define RCC_CCIPR6_LPTIM3SEL_B_0XB                  (0xBu<<8)
#define RCC_CCIPR6_LPTIM3SEL_B_0XC                  (0xCu<<8)
#define RCC_CCIPR6_LPTIM3SEL_B_0XD                  (0xDu<<8)
#define RCC_CCIPR6_LPTIM2SEL_B_0X0                  (0x0u<<4)
#define RCC_CCIPR6_LPTIM2SEL_B_0X1                  (0x1u<<4)
#define RCC_CCIPR6_LPTIM2SEL_B_0X2                  (0x2u<<4)
#define RCC_CCIPR6_LPTIM2SEL_B_0X3                  (0x3u<<4)
#define RCC_CCIPR6_LPTIM2SEL_B_0X4                  (0x4u<<4)
#define RCC_CCIPR6_LPTIM2SEL_B_0X5                  (0x5u<<4)
#define RCC_CCIPR6_LPTIM2SEL_B_0X6                  (0x6u<<4)
#define RCC_CCIPR6_LPTIM2SEL_B_0X7                  (0x7u<<4)
#define RCC_CCIPR6_LPTIM2SEL_B_0X8                  (0x8u<<4)
#define RCC_CCIPR6_LPTIM2SEL_B_0X9                  (0x9u<<4)
#define RCC_CCIPR6_LPTIM2SEL_B_0XA                  (0xAu<<4)
#define RCC_CCIPR6_LPTIM2SEL_B_0XB                  (0xBu<<4)
#define RCC_CCIPR6_LPTIM2SEL_B_0XC                  (0xCu<<4)
#define RCC_CCIPR6_LPTIM2SEL_B_0XD                  (0xDu<<4)
#define RCC_CCIPR6_LPTIM1SEL_B_0X0                  (0x0u<<0)
#define RCC_CCIPR6_LPTIM1SEL_B_0X1                  (0x1u<<0)
#define RCC_CCIPR6_LPTIM1SEL_B_0X2                  (0x2u<<0)
#define RCC_CCIPR6_LPTIM1SEL_B_0X3                  (0x3u<<0)
#define RCC_CCIPR6_LPTIM1SEL_B_0X4                  (0x4u<<0)
#define RCC_CCIPR6_LPTIM1SEL_B_0X5                  (0x5u<<0)
#define RCC_CCIPR6_LPTIM1SEL_B_0X6                  (0x6u<<0)
#define RCC_CCIPR6_LPTIM1SEL_B_0X7                  (0x7u<<0)
#define RCC_CCIPR6_LPTIM1SEL_B_0X8                  (0x8u<<0)
#define RCC_CCIPR6_LPTIM1SEL_B_0X9                  (0x9u<<0)
#define RCC_CCIPR6_LPTIM1SEL_B_0XA                  (0xAu<<0)
#define RCC_CCIPR6_LPTIM1SEL_B_0XB                  (0xBu<<0)
#define RCC_CCIPR6_LPTIM1SEL_B_0XC                  (0xCu<<0)
#define RCC_CCIPR6_LPTIM1SEL_B_0XD                  (0xDu<<0)

// CCIPR7 Configuration

#define RCC_CCIPR7_FDCANSEL                         (0xFu<<24)
#define RCC_CCIPR7_FDCANSEL_0                       (0x1u<<24)
#define RCC_CCIPR7_SPDIFRXSEL                       (0xFu<<20)
#define RCC_CCIPR7_SPDIFRXSEL_0                     (0x1u<<20)
#define RCC_CCIPR7_HDMICECSEL                       (0xFu<<16)
#define RCC_CCIPR7_HDMICECSEL_0                     (0x1u<<16)
#define RCC_CCIPR7_ADF1SEL                          (0xFu<<8)
#define RCC_CCIPR7_ADF1SEL_0                        (0x1u<<8)
#define RCC_CCIPR7_MDF1SEL                          (0xFu<<0)
#define RCC_CCIPR7_MDF1SEL_0                        (0x1u<<0)

#define RCC_CCIPR7_FDCANSEL_B_0X0                   (0x0u<<24)
#define RCC_CCIPR7_FDCANSEL_B_0X1                   (0x1u<<24)
#define RCC_CCIPR7_FDCANSEL_B_0X2                   (0x2u<<24)
#define RCC_CCIPR7_FDCANSEL_B_0X3                   (0x3u<<24)
#define RCC_CCIPR7_FDCANSEL_B_0X4                   (0x4u<<24)
#define RCC_CCIPR7_FDCANSEL_B_0X5                   (0x5u<<24)
#define RCC_CCIPR7_FDCANSEL_B_0X6                   (0x6u<<24)
#define RCC_CCIPR7_FDCANSEL_B_0X7                   (0x7u<<24)
#define RCC_CCIPR7_FDCANSEL_B_0X8                   (0x8u<<24)
#define RCC_CCIPR7_FDCANSEL_B_0X9                   (0x9u<<24)
#define RCC_CCIPR7_FDCANSEL_B_0XA                   (0xAu<<24)
#define RCC_CCIPR7_FDCANSEL_B_0XB                   (0xBu<<24)
#define RCC_CCIPR7_SPDIFRXSEL_B_0X1                 (0x1u<<20)
#define RCC_CCIPR7_SPDIFRXSEL_B_0X2                 (0x2u<<20)
#define RCC_CCIPR7_SPDIFRXSEL_B_0X3                 (0x3u<<20)
#define RCC_CCIPR7_SPDIFRXSEL_B_0X4                 (0x4u<<20)
#define RCC_CCIPR7_SPDIFRXSEL_B_0X5                 (0x5u<<20)
#define RCC_CCIPR7_SPDIFRXSEL_B_0X6                 (0x6u<<20)
#define RCC_CCIPR7_SPDIFRXSEL_B_0X7                 (0x7u<<20)
#define RCC_CCIPR7_SPDIFRXSEL_B_0X8                 (0x8u<<20)
#define RCC_CCIPR7_SPDIFRXSEL_B_0X9                 (0x9u<<20)
#define RCC_CCIPR7_SPDIFRXSEL_B_0XA                 (0xAu<<20)
#define RCC_CCIPR7_SPDIFRXSEL_B_0XB                 (0xBu<<20)
#define RCC_CCIPR7_SPDIFRXSEL_B_0XC                 (0xCu<<20)
#define RCC_CCIPR7_SPDIFRXSEL_B_0XD                 (0xDu<<20)
#define RCC_CCIPR7_HDMICECSEL_B_0X0                 (0x0u<<16)
#define RCC_CCIPR7_HDMICECSEL_B_0X1                 (0x1u<<16)
#define RCC_CCIPR7_HDMICECSEL_B_0X2                 (0x2u<<16)
#define RCC_CCIPR7_HDMICECSEL_B_0X3                 (0x3u<<16)
#define RCC_CCIPR7_HDMICECSEL_B_0X4                 (0x4u<<16)
#define RCC_CCIPR7_HDMICECSEL_B_0X5                 (0x5u<<16)
#define RCC_CCIPR7_HDMICECSEL_B_0X6                 (0x6u<<16)
#define RCC_CCIPR7_HDMICECSEL_B_0X7                 (0x7u<<16)
#define RCC_CCIPR7_HDMICECSEL_B_0X8                 (0x8u<<16)
#define RCC_CCIPR7_ADF1SEL_B_0X0                    (0x0u<<8)
#define RCC_CCIPR7_ADF1SEL_B_0X1                    (0x1u<<8)
#define RCC_CCIPR7_ADF1SEL_B_0X2                    (0x2u<<8)
#define RCC_CCIPR7_ADF1SEL_B_0X3                    (0x3u<<8)
#define RCC_CCIPR7_ADF1SEL_B_0X4                    (0x4u<<8)
#define RCC_CCIPR7_ADF1SEL_B_0X5                    (0x5u<<8)
#define RCC_CCIPR7_ADF1SEL_B_0X6                    (0x6u<<8)
#define RCC_CCIPR7_ADF1SEL_B_0X7                    (0x7u<<8)
#define RCC_CCIPR7_ADF1SEL_B_0X8                    (0x8u<<8)
#define RCC_CCIPR7_ADF1SEL_B_0X9                    (0x9u<<8)
#define RCC_CCIPR7_ADF1SEL_B_0XA                    (0xAu<<8)
#define RCC_CCIPR7_ADF1SEL_B_0XB                    (0xBu<<8)
#define RCC_CCIPR7_ADF1SEL_B_0XC                    (0xCu<<8)
#define RCC_CCIPR7_ADF1SEL_B_0XD                    (0xDu<<8)
#define RCC_CCIPR7_ADF1SEL_B_0XE                    (0xEu<<8)
#define RCC_CCIPR7_ADF1SEL_B_0XF                    (0xFu<<8)
#define RCC_CCIPR7_MDF1SEL_B_0X0                    (0x0u<<0)
#define RCC_CCIPR7_MDF1SEL_B_0X1                    (0x1u<<0)
#define RCC_CCIPR7_MDF1SEL_B_0X2                    (0x2u<<0)
#define RCC_CCIPR7_MDF1SEL_B_0X3                    (0x3u<<0)
#define RCC_CCIPR7_MDF1SEL_B_0X4                    (0x4u<<0)
#define RCC_CCIPR7_MDF1SEL_B_0X5                    (0x5u<<0)
#define RCC_CCIPR7_MDF1SEL_B_0X6                    (0x6u<<0)
#define RCC_CCIPR7_MDF1SEL_B_0X7                    (0x7u<<0)
#define RCC_CCIPR7_MDF1SEL_B_0X8                    (0x8u<<0)
#define RCC_CCIPR7_MDF1SEL_B_0X9                    (0x9u<<0)
#define RCC_CCIPR7_MDF1SEL_B_0XA                    (0xAu<<0)
#define RCC_CCIPR7_MDF1SEL_B_0XB                    (0xBu<<0)
#define RCC_CCIPR7_MDF1SEL_B_0XC                    (0xCu<<0)
#define RCC_CCIPR7_MDF1SEL_B_0XD                    (0xDu<<0)
#define RCC_CCIPR7_MDF1SEL_B_0XE                    (0xEu<<0)
#define RCC_CCIPR7_MDF1SEL_B_0XF                    (0xFu<<0)

// CCIPR8 Configuration

#define RCC_CCIPR8_DACSHSEL                         (0x1u<<28)
#define RCC_CCIPR8_DACSEL                           (0xFu<<16)
#define RCC_CCIPR8_DACSEL_0                         (0x1u<<16)
#define RCC_CCIPR8_ADCDIV                           (0xFu<<4)
#define RCC_CCIPR8_ADCDIV_0                         (0x1u<<4)
#define RCC_CCIPR8_ADCSEL                           (0xFu<<0)
#define RCC_CCIPR8_ADCSEL_0                         (0x1u<<0)

#define RCC_CCIPR8_DACSHSEL_B_0X0                   (0x0u<<28)
#define RCC_CCIPR8_DACSHSEL_B_0X1                   (0x1u<<28)
#define RCC_CCIPR8_DACSEL_B_0X0                     (0x0u<<16)
#define RCC_CCIPR8_DACSEL_B_0X1                     (0x1u<<16)
#define RCC_CCIPR8_DACSEL_B_0X2                     (0x2u<<16)
#define RCC_CCIPR8_DACSEL_B_0X3                     (0x3u<<16)
#define RCC_CCIPR8_DACSEL_B_0X4                     (0x4u<<16)
#define RCC_CCIPR8_DACSEL_B_0X5                     (0x5u<<16)
#define RCC_CCIPR8_DACSEL_B_0X6                     (0x6u<<16)
#define RCC_CCIPR8_DACSEL_B_0X7                     (0x7u<<16)
#define RCC_CCIPR8_DACSEL_B_0X8                     (0x8u<<16)
#define RCC_CCIPR8_DACSEL_B_0X9                     (0x9u<<16)
#define RCC_CCIPR8_DACSEL_B_0XA                     (0xAu<<16)
#define RCC_CCIPR8_DACSEL_B_0XB                     (0xBu<<16)
#define RCC_CCIPR8_DACSEL_B_0XC                     (0xCu<<16)
#define RCC_CCIPR8_DACSEL_B_0XD                     (0xDu<<16)
#define RCC_CCIPR8_DACSEL_B_0XE                     (0xEu<<16)
#define RCC_CCIPR8_DACSEL_B_0XF                     (0xFu<<16)
#define RCC_CCIPR8_ADCDIV_B_0X0                     (0x0u<<4)
#define RCC_CCIPR8_ADCDIV_B_0X1                     (0x1u<<4)
#define RCC_CCIPR8_ADCDIV_B_0X2                     (0x2u<<4)
#define RCC_CCIPR8_ADCDIV_B_0X3                     (0x3u<<4)
#define RCC_CCIPR8_ADCDIV_B_0X4                     (0x4u<<4)
#define RCC_CCIPR8_ADCDIV_B_0X5                     (0x5u<<4)
#define RCC_CCIPR8_ADCDIV_B_0X6                     (0x6u<<4)
#define RCC_CCIPR8_ADCDIV_B_0X7                     (0x7u<<4)
#define RCC_CCIPR8_ADCDIV_B_0X8                     (0x8u<<4)
#define RCC_CCIPR8_ADCDIV_B_0X9                     (0x9u<<4)
#define RCC_CCIPR8_ADCDIV_B_0XA                     (0xAu<<4)
#define RCC_CCIPR8_ADCDIV_B_0XB                     (0xBu<<4)
#define RCC_CCIPR8_ADCSEL_B_0X0                     (0x0u<<0)
#define RCC_CCIPR8_ADCSEL_B_0X1                     (0x1u<<0)
#define RCC_CCIPR8_ADCSEL_B_0X2                     (0x2u<<0)
#define RCC_CCIPR8_ADCSEL_B_0X3                     (0x3u<<0)
#define RCC_CCIPR8_ADCSEL_B_0X4                     (0x4u<<0)
#define RCC_CCIPR8_ADCSEL_B_0X5                     (0x5u<<0)
#define RCC_CCIPR8_ADCSEL_B_0X6                     (0x6u<<0)
#define RCC_CCIPR8_ADCSEL_B_0X7                     (0x7u<<0)
#define RCC_CCIPR8_ADCSEL_B_0X8                     (0x8u<<0)
#define RCC_CCIPR8_ADCSEL_B_0X9                     (0x9u<<0)
#define RCC_CCIPR8_ADCSEL_B_0XA                     (0xAu<<0)
#define RCC_CCIPR8_ADCSEL_B_0XB                     (0xBu<<0)
#define RCC_CCIPR8_ADCSEL_B_0XC                     (0xCu<<0)
#define RCC_CCIPR8_ADCSEL_B_0XD                     (0xDu<<0)

// CCIPR9 Configuration

#define RCC_CCIPR9_PSSISEL                          (0xFu<<28)
#define RCC_CCIPR9_PSSISEL_0                        (0x1u<<28)
#define RCC_CCIPR9_DCMIPPSEL                        (0xFu<<24)
#define RCC_CCIPR9_DCMIPPSEL_0                      (0x1u<<24)
#define RCC_CCIPR9_LTDCSEL                          (0xFu<<20)
#define RCC_CCIPR9_LTDCSEL_0                        (0x1u<<20)
#define RCC_CCIPR9_SDMMC2SEL                        (0xFu<<16)
#define RCC_CCIPR9_SDMMC2SEL_0                      (0x1u<<16)
#define RCC_CCIPR9_SDMMC1SEL                        (0xFu<<12)
#define RCC_CCIPR9_SDMMC1SEL_0                      (0x1u<<12)
#define RCC_CCIPR9_FMCSEL                           (0xFu<<8)
#define RCC_CCIPR9_FMCSEL_0                         (0x1u<<8)
#define RCC_CCIPR9_XSPI2SEL                         (0xFu<<4)
#define RCC_CCIPR9_XSPI2SEL_0                       (0x1u<<4)
#define RCC_CCIPR9_XSPI1SEL                         (0xFu<<0)
#define RCC_CCIPR9_XSPI1SEL_0                       (0x1u<<0)

