Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/STM32V873/Includes/Registers/stm32V873_rcc.h
#define RCC_CCIPR11_ETH1TXCLKSEL_B_0X0              (0x0u<<12)
#define RCC_CCIPR11_ETH1TXCLKSEL_B_0X1              (0x1u<<12)
#define RCC_CCIPR11_ETH1TXCLKSEL_B_0X2              (0x2u<<12)
#define RCC_CCIPR11_ETH1TXCLKSEL_B_0X3              (0x3u<<12)
#define RCC_CCIPR11_ETH1TXCLKSEL_B_0X4              (0x4u<<12)
#define RCC_CCIPR11_ETH1TXCLKSEL_B_0X5              (0x5u<<12)
#define RCC_CCIPR11_ETH1TXCLKSEL_B_0X6              (0x6u<<12)
#define RCC_CCIPR11_ETH1TXCLKSEL_B_0X7              (0x7u<<12)
#define RCC_CCIPR11_ETH1TXCLKSEL_B_0X8              (0x8u<<12)
#define RCC_CCIPR11_ETH1TXCLKSEL_B_0X9              (0x9u<<12)
#define RCC_CCIPR11_ETH1TXCLKSEL_B_0XA              (0xAu<<12)
#define RCC_CCIPR11_ETH1TXCLKSEL_B_0XB              (0xBu<<12)
#define RCC_CCIPR11_ETH1TXCLKSEL_B_0XC              (0xCu<<12)
#define RCC_CCIPR11_ETH1TXCLKSEL_B_0XD              (0xDu<<12)
#define RCC_CCIPR11_ETH1TXCLKSEL_B_0XE              (0xEu<<12)
#define RCC_CCIPR11_ETH1TXCLKSEL_B_0XF              (0xFu<<12)
#define RCC_CCIPR11_ETH1CLKSEL_B_0X0                (0x0u<<8)
#define RCC_CCIPR11_ETH1CLKSEL_B_0X1                (0x1u<<8)
#define RCC_CCIPR11_ETH1CLKSEL_B_0X2                (0x2u<<8)
#define RCC_CCIPR11_ETH1CLKSEL_B_0X3                (0x3u<<8)
#define RCC_CCIPR11_ETH1CLKSEL_B_0X4                (0x4u<<8)
#define RCC_CCIPR11_ETH1CLKSEL_B_0X5                (0x5u<<8)
#define RCC_CCIPR11_ETH1CLKSEL_B_0X6                (0x6u<<8)
#define RCC_CCIPR11_ETH1CLKSEL_B_0X7                (0x7u<<8)
#define RCC_CCIPR11_ETH1CLKSEL_B_0X8                (0x8u<<8)
#define RCC_CCIPR11_ETH1CLKSEL_B_0X9                (0x9u<<8)
#define RCC_CCIPR11_ETH1CLKSEL_B_0XA                (0xAu<<8)
#define RCC_CCIPR11_ETH1CLKSEL_B_0XB                (0xBu<<8)
#define RCC_CCIPR11_ETH1PDACK_B_0X0                 (0x0u<<6)
#define RCC_CCIPR11_ETH1PDACK_B_0X1                 (0x1u<<6)
#define RCC_CCIPR11_ETH1REFCLKSEL_B_0X0             (0x0u<<4)
#define RCC_CCIPR11_ETH1REFCLKSEL_B_0X1             (0x1u<<4)
#define RCC_CCIPR11_ETH1SEL_B_0X0                   (0x0u<<0)
#define RCC_CCIPR11_ETH1SEL_B_0X1                   (0x1u<<0)
#define RCC_CCIPR11_ETH1SEL_B_0X4                   (0x4u<<0)
#define RCC_CCIPR11_ETH1SEL_B_0X8                   (0x8u<<0)

// CCIPR12 Configuration

#define RCC_CCIPR12_ETHPTPDIV                       (0xFu<<4)
#define RCC_CCIPR12_ETHPTPDIV_0                     (0x1u<<4)
#define RCC_CCIPR12_ETHPTPSEL                       (0xFu<<0)
#define RCC_CCIPR12_ETHPTPSEL_0                     (0x1u<<0)

#define RCC_CCIPR12_ETHPTPDIV_B_0X0                 (0x0u<<4)
#define RCC_CCIPR12_ETHPTPDIV_B_0X1                 (0x1u<<4)
#define RCC_CCIPR12_ETHPTPDIV_B_0XE                 (0xEu<<4)
#define RCC_CCIPR12_ETHPTPDIV_B_0XF                 (0xFu<<4)
#define RCC_CCIPR12_ETHPTPSEL_B_0X0                 (0x0u<<0)
#define RCC_CCIPR12_ETHPTPSEL_B_0X1                 (0x1u<<0)
#define RCC_CCIPR12_ETHPTPSEL_B_0X2                 (0x2u<<0)
#define RCC_CCIPR12_ETHPTPSEL_B_0X3                 (0x3u<<0)
#define RCC_CCIPR12_ETHPTPSEL_B_0X4                 (0x4u<<0)
#define RCC_CCIPR12_ETHPTPSEL_B_0X5                 (0x5u<<0)
#define RCC_CCIPR12_ETHPTPSEL_B_0X6                 (0x6u<<0)
#define RCC_CCIPR12_ETHPTPSEL_B_0X7                 (0x7u<<0)
#define RCC_CCIPR12_ETHPTPSEL_B_0X8                 (0x8u<<0)
#define RCC_CCIPR12_ETHPTPSEL_B_0X9                 (0x9u<<0)
#define RCC_CCIPR12_ETHPTPSEL_B_0XA                 (0xAu<<0)
#define RCC_CCIPR12_ETHPTPSEL_B_0XB                 (0xBu<<0)

// AHB1RSTR Configuration

#define RCC_AHB1RSTR_OTGFSRST                       (0x1u<<27)
#define RCC_AHB1RSTR_DACRST                         (0x1u<<5)
#define RCC_AHB1RSTR_ADC123RST                      (0x1u<<2)
#define RCC_AHB1RSTR_GPDMA2RST                      (0x1u<<1)
#define RCC_AHB1RSTR_GPDMA1RST                      (0x1u<<0)

#define RCC_AHB1RSTR_OTGFSRST_B_0X0                 (0x0u<<27)
#define RCC_AHB1RSTR_OTGFSRST_B_0X1                 (0x1u<<27)
#define RCC_AHB1RSTR_DACRST_B_0X0                   (0x0u<<5)
#define RCC_AHB1RSTR_DACRST_B_0X1                   (0x1u<<5)
#define RCC_AHB1RSTR_ADC123RST_B_0X0                (0x0u<<2)
#define RCC_AHB1RSTR_ADC123RST_B_0X1                (0x1u<<2)
#define RCC_AHB1RSTR_GPDMA2RST_B_0X0                (0x0u<<1)
#define RCC_AHB1RSTR_GPDMA2RST_B_0X1                (0x1u<<1)
#define RCC_AHB1RSTR_GPDMA1RST_B_0X0                (0x0u<<0)
#define RCC_AHB1RSTR_GPDMA1RST_B_0X1                (0x1u<<0)

// AHB2RSTR Configuration

#define RCC_AHB2RSTR_ADF1RST                        (0x1u<<17)
#define RCC_AHB2RSTR_MDF1RST                        (0x1u<<16)
#define RCC_AHB2RSTR_CORDICRST                      (0x1u<<14)
#define RCC_AHB2RSTR_FMACRST                        (0x1u<<13)

#define RCC_AHB2RSTR_ADF1RST_B_0X0                  (0x0u<<17)
#define RCC_AHB2RSTR_ADF1RST_B_0X1                  (0x1u<<17)
#define RCC_AHB2RSTR_MDF1RST_B_0X0                  (0x0u<<16)
#define RCC_AHB2RSTR_MDF1RST_B_0X1                  (0x1u<<16)
#define RCC_AHB2RSTR_CORDICRST_B_0X0                (0x0u<<14)
#define RCC_AHB2RSTR_CORDICRST_B_0X1                (0x1u<<14)
#define RCC_AHB2RSTR_FMACRST_B_0X0                  (0x0u<<13)
#define RCC_AHB2RSTR_FMACRST_B_0X1                  (0x1u<<13)

// AHB3RSTR Configuration

#define RCC_AHB3RSTR_CCBRST                         (0x1u<<15)
#define RCC_AHB3RSTR_PKARST                         (0x1u<<8)
#define RCC_AHB3RSTR_SAESRST                        (0x1u<<3)
#define RCC_AHB3RSTR_RNGRST                         (0x1u<<2)
#define RCC_AHB3RSTR_HASHRST                        (0x1u<<1)
#define RCC_AHB3RSTR_CRYPRST                        (0x1u<<0)

#define RCC_AHB3RSTR_CCBRST_B_0X0                   (0x0u<<15)
#define RCC_AHB3RSTR_CCBRST_B_0X1                   (0x1u<<15)
#define RCC_AHB3RSTR_PKARST_B_0X0                   (0x0u<<8)
#define RCC_AHB3RSTR_PKARST_B_0X1                   (0x1u<<8)
#define RCC_AHB3RSTR_SAESRST_B_0X0                  (0x0u<<3)
#define RCC_AHB3RSTR_SAESRST_B_0X1                  (0x1u<<3)
#define RCC_AHB3RSTR_RNGRST_B_0X0                   (0x0u<<2)
#define RCC_AHB3RSTR_RNGRST_B_0X1                   (0x1u<<2)
#define RCC_AHB3RSTR_HASHRST_B_0X0                  (0x0u<<1)
#define RCC_AHB3RSTR_HASHRST_B_0X1                  (0x1u<<1)
#define RCC_AHB3RSTR_CRYPRST_B_0X0                  (0x0u<<0)
#define RCC_AHB3RSTR_CRYPRST_B_0X1                  (0x1u<<0)

// AHB4RSTR Configuration

