Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/STM32V873/Includes/Registers/stm32V873_rcc.h
#define RCC_AHB4RSTR_RAMCFGRST                      (0x1u<<28)
#define RCC_AHB4RSTR_HSEMRST                        (0x1u<<25)
#define RCC_AHB4RSTR_SBSRST                         (0x1u<<23)
#define RCC_AHB4RSTR_CRCRST                         (0x1u<<19)
#define RCC_AHB4RSTR_GPIOMRST                       (0x1u<<12)
#define RCC_AHB4RSTR_GPIOKRST                       (0x1u<<10)
#define RCC_AHB4RSTR_GPIOJRST                       (0x1u<<9)
#define RCC_AHB4RSTR_GPIOIRST                       (0x1u<<8)
#define RCC_AHB4RSTR_GPIOHRST                       (0x1u<<7)
#define RCC_AHB4RSTR_GPIOGRST                       (0x1u<<6)
#define RCC_AHB4RSTR_GPIOFRST                       (0x1u<<5)
#define RCC_AHB4RSTR_GPIOERST                       (0x1u<<4)
#define RCC_AHB4RSTR_GPIODRST                       (0x1u<<3)
#define RCC_AHB4RSTR_GPIOCRST                       (0x1u<<2)
#define RCC_AHB4RSTR_GPIOBRST                       (0x1u<<1)
#define RCC_AHB4RSTR_GPIOARST                       (0x1u<<0)

#define RCC_AHB4RSTR_RAMCFGRST_B_0X0                (0x0u<<28)
#define RCC_AHB4RSTR_RAMCFGRST_B_0X1                (0x1u<<28)
#define RCC_AHB4RSTR_HSEMRST_B_0X0                  (0x0u<<25)
#define RCC_AHB4RSTR_HSEMRST_B_0X1                  (0x1u<<25)
#define RCC_AHB4RSTR_SBSRST_B_0X0                   (0x0u<<23)
#define RCC_AHB4RSTR_SBSRST_B_0X1                   (0x1u<<23)
#define RCC_AHB4RSTR_CRCRST_B_0X0                   (0x0u<<19)
#define RCC_AHB4RSTR_CRCRST_B_0X1                   (0x1u<<19)
#define RCC_AHB4RSTR_GPIOMRST_B_0X0                 (0x0u<<12)
#define RCC_AHB4RSTR_GPIOMRST_B_0X1                 (0x1u<<12)
#define RCC_AHB4RSTR_GPIOKRST_B_0X0                 (0x0u<<10)
#define RCC_AHB4RSTR_GPIOKRST_B_0X1                 (0x1u<<10)
#define RCC_AHB4RSTR_GPIOJRST_B_0X0                 (0x0u<<9)
#define RCC_AHB4RSTR_GPIOJRST_B_0X1                 (0x1u<<9)
#define RCC_AHB4RSTR_GPIOIRST_B_0X0                 (0x0u<<8)
#define RCC_AHB4RSTR_GPIOIRST_B_0X1                 (0x1u<<8)
#define RCC_AHB4RSTR_GPIOHRST_B_0X0                 (0x0u<<7)
#define RCC_AHB4RSTR_GPIOHRST_B_0X1                 (0x1u<<7)
#define RCC_AHB4RSTR_GPIOGRST_B_0X0                 (0x0u<<6)
#define RCC_AHB4RSTR_GPIOGRST_B_0X1                 (0x1u<<6)
#define RCC_AHB4RSTR_GPIOFRST_B_0X0                 (0x0u<<5)
#define RCC_AHB4RSTR_GPIOFRST_B_0X1                 (0x1u<<5)
#define RCC_AHB4RSTR_GPIOERST_B_0X0                 (0x0u<<4)
#define RCC_AHB4RSTR_GPIOERST_B_0X1                 (0x1u<<4)
#define RCC_AHB4RSTR_GPIODRST_B_0X0                 (0x0u<<3)
#define RCC_AHB4RSTR_GPIODRST_B_0X1                 (0x1u<<3)
#define RCC_AHB4RSTR_GPIOCRST_B_0X0                 (0x0u<<2)
#define RCC_AHB4RSTR_GPIOCRST_B_0X1                 (0x1u<<2)
#define RCC_AHB4RSTR_GPIOBRST_B_0X0                 (0x0u<<1)
#define RCC_AHB4RSTR_GPIOBRST_B_0X1                 (0x1u<<1)
#define RCC_AHB4RSTR_GPIOARST_B_0X0                 (0x0u<<0)
#define RCC_AHB4RSTR_GPIOARST_B_0X1                 (0x1u<<0)

// AHB5RSTR1 Configuration

#define RCC_AHB5RSTR1_OTG1PHYRST                    (0x1u<<31)
#define RCC_AHB5RSTR1_OTG1RST                       (0x1u<<30)
#define RCC_AHB5RSTR1_OTG1PHYAPBRST                 (0x1u<<29)
#define RCC_AHB5RSTR1_ETH1RST                       (0x1u<<20)
#define RCC_AHB5RSTR1_GFXMMURST                     (0x1u<<17)
#define RCC_AHB5RSTR1_XSPIMRST                      (0x1u<<13)
#define RCC_AHB5RSTR1_XSPI2RST                      (0x1u<<12)
#define RCC_AHB5RSTR1_SDMMC1RST                     (0x1u<<8)
#define RCC_AHB5RSTR1_SDMMC2RST                     (0x1u<<7)
#define RCC_AHB5RSTR1_PSSIRST                       (0x1u<<6)
#define RCC_AHB5RSTR1_XSPI1RST                      (0x1u<<5)
#define RCC_AHB5RSTR1_FMCRST                        (0x1u<<4)
#define RCC_AHB5RSTR1_JPEGRST                       (0x1u<<3)
#define RCC_AHB5RSTR1_DMA2DRST                      (0x1u<<1)
#define RCC_AHB5RSTR1_HPDMA1RST                     (0x1u<<0)

#define RCC_AHB5RSTR1_OTG1PHYRST_B_0X0              (0x0u<<31)
#define RCC_AHB5RSTR1_OTG1PHYRST_B_0X1              (0x1u<<31)
#define RCC_AHB5RSTR1_OTG1RST_B_0X0                 (0x0u<<30)
#define RCC_AHB5RSTR1_OTG1RST_B_0X1                 (0x1u<<30)
#define RCC_AHB5RSTR1_OTG1PHYAPBRST_B_0X0           (0x0u<<29)
#define RCC_AHB5RSTR1_OTG1PHYAPBRST_B_0X1           (0x1u<<29)
#define RCC_AHB5RSTR1_ETH1RST_B_0X0                 (0x0u<<20)
#define RCC_AHB5RSTR1_ETH1RST_B_0X1                 (0x1u<<20)
#define RCC_AHB5RSTR1_GFXMMURST_B_0X0               (0x0u<<17)
#define RCC_AHB5RSTR1_GFXMMURST_B_0X1               (0x1u<<17)
#define RCC_AHB5RSTR1_XSPIMRST_B_0X0                (0x0u<<13)
#define RCC_AHB5RSTR1_XSPIMRST_B_0X1                (0x1u<<13)
#define RCC_AHB5RSTR1_XSPI2RST_B_0X0                (0x0u<<12)
#define RCC_AHB5RSTR1_XSPI2RST_B_0X1                (0x1u<<12)
#define RCC_AHB5RSTR1_SDMMC1RST_B_0X0               (0x0u<<8)
#define RCC_AHB5RSTR1_SDMMC1RST_B_0X1               (0x1u<<8)
#define RCC_AHB5RSTR1_SDMMC2RST_B_0X0               (0x0u<<7)
#define RCC_AHB5RSTR1_SDMMC2RST_B_0X1               (0x1u<<7)
#define RCC_AHB5RSTR1_PSSIRST_B_0X0                 (0x0u<<6)
#define RCC_AHB5RSTR1_PSSIRST_B_0X1                 (0x1u<<6)
#define RCC_AHB5RSTR1_XSPI1RST_B_0X0                (0x0u<<5)
#define RCC_AHB5RSTR1_XSPI1RST_B_0X1                (0x1u<<5)
#define RCC_AHB5RSTR1_FMCRST_B_0X0                  (0x0u<<4)
#define RCC_AHB5RSTR1_FMCRST_B_0X1                  (0x1u<<4)
#define RCC_AHB5RSTR1_JPEGRST_B_0X0                 (0x0u<<3)
#define RCC_AHB5RSTR1_JPEGRST_B_0X1                 (0x1u<<3)
#define RCC_AHB5RSTR1_DMA2DRST_B_0X0                (0x0u<<1)
#define RCC_AHB5RSTR1_DMA2DRST_B_0X1                (0x1u<<1)
#define RCC_AHB5RSTR1_HPDMA1RST_B_0X0               (0x0u<<0)
#define RCC_AHB5RSTR1_HPDMA1RST_B_0X1               (0x1u<<0)

// APB1RSTR1 Configuration

#define RCC_APB1RSTR1_UART8RST                      (0x1u<<31)
#define RCC_APB1RSTR1_UART7RST                      (0x1u<<30)
#define RCC_APB1RSTR1_HDMICECRST                    (0x1u<<27)
#define RCC_APB1RSTR1_I3C2RST                       (0x1u<<25)
#define RCC_APB1RSTR1_I3C1RST                       (0x1u<<24)
#define RCC_APB1RSTR1_I2C3RST                       (0x1u<<23)
#define RCC_APB1RSTR1_I2C2RST                       (0x1u<<22)
#define RCC_APB1RSTR1_I2C1RST                       (0x1u<<21)
#define RCC_APB1RSTR1_UART5RST                      (0x1u<<20)
#define RCC_APB1RSTR1_UART4RST                      (0x1u<<19)
#define RCC_APB1RSTR1_USART3RST                     (0x1u<<18)
#define RCC_APB1RSTR1_USART2RST                     (0x1u<<17)
#define RCC_APB1RSTR1_SPDIFRXRST                    (0x1u<<16)
#define RCC_APB1RSTR1_SPI3RST                       (0x1u<<15)
#define RCC_APB1RSTR1_SPI2RST                       (0x1u<<14)
#define RCC_APB1RSTR1_TIM10RST                      (0x1u<<12)
#define RCC_APB1RSTR1_LPTIM1RST                     (0x1u<<9)
#define RCC_APB1RSTR1_TIM14RST                      (0x1u<<8)
#define RCC_APB1RSTR1_TIM13RST                      (0x1u<<7)
#define RCC_APB1RSTR1_TIM12RST                      (0x1u<<6)
#define RCC_APB1RSTR1_TIM7RST                       (0x1u<<5)
#define RCC_APB1RSTR1_TIM6RST                       (0x1u<<4)
#define RCC_APB1RSTR1_TIM5RST                       (0x1u<<3)
#define RCC_APB1RSTR1_TIM4RST                       (0x1u<<2)
#define RCC_APB1RSTR1_TIM3RST                       (0x1u<<1)
#define RCC_APB1RSTR1_TIM2RST                       (0x1u<<0)

