Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/STM32V873/Includes/Registers/stm32V873_rcc.h
#define RCC_APB1RSTR1_UART8RST_B_0X0                (0x0u<<31)
#define RCC_APB1RSTR1_UART8RST_B_0X1                (0x1u<<31)
#define RCC_APB1RSTR1_UART7RST_B_0X0                (0x0u<<30)
#define RCC_APB1RSTR1_UART7RST_B_0X1                (0x1u<<30)
#define RCC_APB1RSTR1_HDMICECRST_B_0X0              (0x0u<<27)
#define RCC_APB1RSTR1_HDMICECRST_B_0X1              (0x1u<<27)
#define RCC_APB1RSTR1_I3C2RST_B_0X0                 (0x0u<<25)
#define RCC_APB1RSTR1_I3C2RST_B_0X1                 (0x1u<<25)
#define RCC_APB1RSTR1_I3C1RST_B_0X0                 (0x0u<<24)
#define RCC_APB1RSTR1_I3C1RST_B_0X1                 (0x1u<<24)
#define RCC_APB1RSTR1_I2C3RST_B_0X0                 (0x0u<<23)
#define RCC_APB1RSTR1_I2C3RST_B_0X1                 (0x1u<<23)
#define RCC_APB1RSTR1_I2C2RST_B_0X0                 (0x0u<<22)
#define RCC_APB1RSTR1_I2C2RST_B_0X1                 (0x1u<<22)
#define RCC_APB1RSTR1_I2C1RST_B_0X0                 (0x0u<<21)
#define RCC_APB1RSTR1_I2C1RST_B_0X1                 (0x1u<<21)
#define RCC_APB1RSTR1_UART5RST_B_0X0                (0x0u<<20)
#define RCC_APB1RSTR1_UART5RST_B_0X1                (0x1u<<20)
#define RCC_APB1RSTR1_UART4RST_B_0X0                (0x0u<<19)
#define RCC_APB1RSTR1_UART4RST_B_0X1                (0x1u<<19)
#define RCC_APB1RSTR1_USART3RST_B_0X0               (0x0u<<18)
#define RCC_APB1RSTR1_USART3RST_B_0X1               (0x1u<<18)
#define RCC_APB1RSTR1_USART2RST_B_0X0               (0x0u<<17)
#define RCC_APB1RSTR1_USART2RST_B_0X1               (0x1u<<17)
#define RCC_APB1RSTR1_SPDIFRXRST_B_0X0              (0x0u<<16)
#define RCC_APB1RSTR1_SPDIFRXRST_B_0X1              (0x1u<<16)
#define RCC_APB1RSTR1_SPI3RST_B_0X0                 (0x0u<<15)
#define RCC_APB1RSTR1_SPI3RST_B_0X1                 (0x1u<<15)
#define RCC_APB1RSTR1_SPI2RST_B_0X0                 (0x0u<<14)
#define RCC_APB1RSTR1_SPI2RST_B_0X1                 (0x1u<<14)
#define RCC_APB1RSTR1_TIM10RST_B_0X0                (0x0u<<12)
#define RCC_APB1RSTR1_TIM10RST_B_0X1                (0x1u<<12)
#define RCC_APB1RSTR1_LPTIM1RST_B_0X0               (0x0u<<9)
#define RCC_APB1RSTR1_LPTIM1RST_B_0X1               (0x1u<<9)
#define RCC_APB1RSTR1_TIM14RST_B_0X0                (0x0u<<8)
#define RCC_APB1RSTR1_TIM14RST_B_0X1                (0x1u<<8)
#define RCC_APB1RSTR1_TIM13RST_B_0X0                (0x0u<<7)
#define RCC_APB1RSTR1_TIM13RST_B_0X1                (0x1u<<7)
#define RCC_APB1RSTR1_TIM12RST_B_0X0                (0x0u<<6)
#define RCC_APB1RSTR1_TIM12RST_B_0X1                (0x1u<<6)
#define RCC_APB1RSTR1_TIM7RST_B_0X0                 (0x0u<<5)
#define RCC_APB1RSTR1_TIM7RST_B_0X1                 (0x1u<<5)
#define RCC_APB1RSTR1_TIM6RST_B_0X0                 (0x0u<<4)
#define RCC_APB1RSTR1_TIM6RST_B_0X1                 (0x1u<<4)
#define RCC_APB1RSTR1_TIM5RST_B_0X0                 (0x0u<<3)
#define RCC_APB1RSTR1_TIM5RST_B_0X1                 (0x1u<<3)
#define RCC_APB1RSTR1_TIM4RST_B_0X0                 (0x0u<<2)
#define RCC_APB1RSTR1_TIM4RST_B_0X1                 (0x1u<<2)
#define RCC_APB1RSTR1_TIM3RST_B_0X0                 (0x0u<<1)
#define RCC_APB1RSTR1_TIM3RST_B_0X1                 (0x1u<<1)
#define RCC_APB1RSTR1_TIM2RST_B_0X0                 (0x0u<<0)
#define RCC_APB1RSTR1_TIM2RST_B_0X1                 (0x1u<<0)

// APB1RSTR2 Configuration

#define RCC_APB1RSTR2_UCPD1RST                      (0x1u<<31)
#define RCC_APB1RSTR2_FDCANRST                      (0x1u<<8)
#define RCC_APB1RSTR2_MDIOSRST                      (0x1u<<5)
#define RCC_APB1RSTR2_CRSRST                        (0x1u<<1)

#define RCC_APB1RSTR2_UCPD1RST_B_0X0                (0x0u<<31)
#define RCC_APB1RSTR2_UCPD1RST_B_0X1                (0x1u<<31)
#define RCC_APB1RSTR2_FDCANRST_B_0X0                (0x0u<<8)
#define RCC_APB1RSTR2_FDCANRST_B_0X1                (0x1u<<8)
#define RCC_APB1RSTR2_MDIOSRST_B_0X0                (0x0u<<5)
#define RCC_APB1RSTR2_MDIOSRST_B_0X1                (0x1u<<5)
#define RCC_APB1RSTR2_CRSRST_B_0X0                  (0x0u<<1)
#define RCC_APB1RSTR2_CRSRST_B_0X1                  (0x1u<<1)

// APB2RSTR Configuration

#define RCC_APB2RSTR_HRTIM1RST                      (0x1u<<28)
#define RCC_APB2RSTR_SAI2RST                        (0x1u<<23)
#define RCC_APB2RSTR_SAI1RST                        (0x1u<<22)
#define RCC_APB2RSTR_SPI5RST                        (0x1u<<20)
#define RCC_APB2RSTR_TIM9RST                        (0x1u<<19)
#define RCC_APB2RSTR_TIM17RST                       (0x1u<<18)
#define RCC_APB2RSTR_TIM16RST                       (0x1u<<17)
#define RCC_APB2RSTR_TIM15RST                       (0x1u<<16)
#define RCC_APB2RSTR_SPI4RST                        (0x1u<<13)
#define RCC_APB2RSTR_SPI1RST                        (0x1u<<12)
#define RCC_APB2RSTR_USART10RST                     (0x1u<<7)
#define RCC_APB2RSTR_UART9RST                       (0x1u<<6)
#define RCC_APB2RSTR_USART6RST                      (0x1u<<5)
#define RCC_APB2RSTR_USART1RST                      (0x1u<<4)
#define RCC_APB2RSTR_TIM20RST                       (0x1u<<2)
#define RCC_APB2RSTR_TIM8RST                        (0x1u<<1)
#define RCC_APB2RSTR_TIM1RST                        (0x1u<<0)

#define RCC_APB2RSTR_HRTIM1RST_B_0X0                (0x0u<<28)
#define RCC_APB2RSTR_HRTIM1RST_B_0X1                (0x1u<<28)
#define RCC_APB2RSTR_SAI2RST_B_0X0                  (0x0u<<23)
#define RCC_APB2RSTR_SAI2RST_B_0X1                  (0x1u<<23)
#define RCC_APB2RSTR_SAI1RST_B_0X0                  (0x0u<<22)
#define RCC_APB2RSTR_SAI1RST_B_0X1                  (0x1u<<22)
#define RCC_APB2RSTR_SPI5RST_B_0X0                  (0x0u<<20)
#define RCC_APB2RSTR_SPI5RST_B_0X1                  (0x1u<<20)
#define RCC_APB2RSTR_TIM9RST_B_0X0                  (0x0u<<19)
#define RCC_APB2RSTR_TIM9RST_B_0X1                  (0x1u<<19)
#define RCC_APB2RSTR_TIM17RST_B_0X0                 (0x0u<<18)
#define RCC_APB2RSTR_TIM17RST_B_0X1                 (0x1u<<18)
#define RCC_APB2RSTR_TIM16RST_B_0X0                 (0x0u<<17)
#define RCC_APB2RSTR_TIM16RST_B_0X1                 (0x1u<<17)
#define RCC_APB2RSTR_TIM15RST_B_0X0                 (0x0u<<16)
#define RCC_APB2RSTR_TIM15RST_B_0X1                 (0x1u<<16)
#define RCC_APB2RSTR_SPI4RST_B_0X0                  (0x0u<<13)
#define RCC_APB2RSTR_SPI4RST_B_0X1                  (0x1u<<13)
#define RCC_APB2RSTR_SPI1RST_B_0X0                  (0x0u<<12)
#define RCC_APB2RSTR_SPI1RST_B_0X1                  (0x1u<<12)
#define RCC_APB2RSTR_USART10RST_B_0X0               (0x0u<<7)
#define RCC_APB2RSTR_USART10RST_B_0X1               (0x1u<<7)
#define RCC_APB2RSTR_UART9RST_B_0X0                 (0x0u<<6)
#define RCC_APB2RSTR_UART9RST_B_0X1                 (0x1u<<6)
#define RCC_APB2RSTR_USART6RST_B_0X0                (0x0u<<5)
#define RCC_APB2RSTR_USART6RST_B_0X1                (0x1u<<5)
#define RCC_APB2RSTR_USART1RST_B_0X0                (0x0u<<4)
#define RCC_APB2RSTR_USART1RST_B_0X1                (0x1u<<4)
#define RCC_APB2RSTR_TIM20RST_B_0X0                 (0x0u<<2)
#define RCC_APB2RSTR_TIM20RST_B_0X1                 (0x1u<<2)
#define RCC_APB2RSTR_TIM8RST_B_0X0                  (0x0u<<1)
#define RCC_APB2RSTR_TIM8RST_B_0X1                  (0x1u<<1)
#define RCC_APB2RSTR_TIM1RST_B_0X0                  (0x0u<<0)
#define RCC_APB2RSTR_TIM1RST_B_0X1                  (0x1u<<0)

// APB4RSTR Configuration

#define RCC_APB4RSTR_PMBRST                         (0x1u<<27)
#define RCC_APB4RSTR_DTSRST                         (0x1u<<26)
#define RCC_APB4RSTR_VREFBUFRST                     (0x1u<<15)
#define RCC_APB4RSTR_LPTIM5RST                      (0x1u<<12)
#define RCC_APB4RSTR_LPTIM4RST                      (0x1u<<11)
#define RCC_APB4RSTR_LPTIM3RST                      (0x1u<<10)
#define RCC_APB4RSTR_LPTIM2RST                      (0x1u<<9)
#define RCC_APB4RSTR_SPI6RST                        (0x1u<<5)
#define RCC_APB4RSTR_LPUART1RST                     (0x1u<<3)

