Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/STM32V873/Includes/Registers/stm32V873_rcc.h
#define RCC_APB4RSTR_PMBRST_B_0X0                   (0x0u<<27)
#define RCC_APB4RSTR_PMBRST_B_0X1                   (0x1u<<27)
#define RCC_APB4RSTR_DTSRST_B_0X0                   (0x0u<<26)
#define RCC_APB4RSTR_DTSRST_B_0X1                   (0x1u<<26)
#define RCC_APB4RSTR_VREFBUFRST_B_0X0               (0x0u<<15)
#define RCC_APB4RSTR_VREFBUFRST_B_0X1               (0x1u<<15)
#define RCC_APB4RSTR_LPTIM5RST_B_0X0                (0x0u<<12)
#define RCC_APB4RSTR_LPTIM5RST_B_0X1                (0x1u<<12)
#define RCC_APB4RSTR_LPTIM4RST_B_0X0                (0x0u<<11)
#define RCC_APB4RSTR_LPTIM4RST_B_0X1                (0x1u<<11)
#define RCC_APB4RSTR_LPTIM3RST_B_0X0                (0x0u<<10)
#define RCC_APB4RSTR_LPTIM3RST_B_0X1                (0x1u<<10)
#define RCC_APB4RSTR_LPTIM2RST_B_0X0                (0x0u<<9)
#define RCC_APB4RSTR_LPTIM2RST_B_0X1                (0x1u<<9)
#define RCC_APB4RSTR_SPI6RST_B_0X0                  (0x0u<<5)
#define RCC_APB4RSTR_SPI6RST_B_0X1                  (0x1u<<5)
#define RCC_APB4RSTR_LPUART1RST_B_0X0               (0x0u<<3)
#define RCC_APB4RSTR_LPUART1RST_B_0X1               (0x1u<<3)

// APB5RSTR Configuration

#define RCC_APB5RSTR_GFXTIMRST                      (0x1u<<4)
#define RCC_APB5RSTR_DCMIPPRST                      (0x1u<<2)
#define RCC_APB5RSTR_LTDCRST                        (0x1u<<1)

#define RCC_APB5RSTR_GFXTIMRST_B_0X0                (0x0u<<4)
#define RCC_APB5RSTR_GFXTIMRST_B_0X1                (0x1u<<4)
#define RCC_APB5RSTR_DCMIPPRST_B_0X0                (0x0u<<2)
#define RCC_APB5RSTR_DCMIPPRST_B_0X1                (0x1u<<2)
#define RCC_APB5RSTR_LTDCRST_B_0X0                  (0x0u<<1)
#define RCC_APB5RSTR_LTDCRST_B_0X1                  (0x1u<<1)

// AHB1ENR Configuration

#define RCC_AHB1ENR_AHBSRAM2EN                      (0x1u<<29)
#define RCC_AHB1ENR_AHBSRAM1EN                      (0x1u<<28)
#define RCC_AHB1ENR_OTGFSEN                         (0x1u<<27)
#define RCC_AHB1ENR_DACEN                           (0x1u<<5)
#define RCC_AHB1ENR_ADC123EN                        (0x1u<<2)
#define RCC_AHB1ENR_GPDMA2EN                        (0x1u<<1)
#define RCC_AHB1ENR_GPDMA1EN                        (0x1u<<0)

#define RCC_AHB1ENR_AHBSRAM2EN_B_0X0                (0x0u<<29)
#define RCC_AHB1ENR_AHBSRAM2EN_B_0X1                (0x1u<<29)
#define RCC_AHB1ENR_AHBSRAM1EN_B_0X0                (0x0u<<28)
#define RCC_AHB1ENR_AHBSRAM1EN_B_0X1                (0x1u<<28)
#define RCC_AHB1ENR_OTGFSEN_B_0X0                   (0x0u<<27)
#define RCC_AHB1ENR_OTGFSEN_B_0X1                   (0x1u<<27)
#define RCC_AHB1ENR_DACEN_B_0X0                     (0x0u<<5)
#define RCC_AHB1ENR_DACEN_B_0X1                     (0x1u<<5)
#define RCC_AHB1ENR_ADC123EN_B_0X0                  (0x0u<<2)
#define RCC_AHB1ENR_ADC123EN_B_0X1                  (0x1u<<2)
#define RCC_AHB1ENR_GPDMA2EN_B_0X0                  (0x0u<<1)
#define RCC_AHB1ENR_GPDMA2EN_B_0X1                  (0x1u<<1)
#define RCC_AHB1ENR_GPDMA1EN_B_0X0                  (0x0u<<0)
#define RCC_AHB1ENR_GPDMA1EN_B_0X1                  (0x1u<<0)

// AHB2ENR Configuration

#define RCC_AHB2ENR_ADF1EN                          (0x1u<<17)
#define RCC_AHB2ENR_MDF1EN                          (0x1u<<16)
#define RCC_AHB2ENR_CORDICEN                        (0x1u<<14)
#define RCC_AHB2ENR_FMACEN                          (0x1u<<13)

#define RCC_AHB2ENR_ADF1EN_B_0X0                    (0x0u<<17)
#define RCC_AHB2ENR_ADF1EN_B_0X1                    (0x1u<<17)
#define RCC_AHB2ENR_MDF1EN_B_0X0                    (0x0u<<16)
#define RCC_AHB2ENR_MDF1EN_B_0X1                    (0x1u<<16)
#define RCC_AHB2ENR_CORDICEN_B_0X0                  (0x0u<<14)
#define RCC_AHB2ENR_CORDICEN_B_0X1                  (0x1u<<14)
#define RCC_AHB2ENR_FMACEN_B_0X0                    (0x0u<<13)
#define RCC_AHB2ENR_FMACEN_B_0X1                    (0x1u<<13)

// AHB3ENR Configuration

#define RCC_AHB3ENR_CCBEN                           (0x1u<<15)
#define RCC_AHB3ENR_PKAEN                           (0x1u<<8)
#define RCC_AHB3ENR_SAESEN                          (0x1u<<3)
#define RCC_AHB3ENR_RNGEN                           (0x1u<<2)
#define RCC_AHB3ENR_HASHEN                          (0x1u<<1)
#define RCC_AHB3ENR_CRYPEN                          (0x1u<<0)

#define RCC_AHB3ENR_CCBEN_B_0X0                     (0x0u<<15)
#define RCC_AHB3ENR_CCBEN_B_0X1                     (0x1u<<15)
#define RCC_AHB3ENR_PKAEN_B_0X0                     (0x0u<<8)
#define RCC_AHB3ENR_PKAEN_B_0X1                     (0x1u<<8)
#define RCC_AHB3ENR_SAESEN_B_0X0                    (0x0u<<3)
#define RCC_AHB3ENR_SAESEN_B_0X1                    (0x1u<<3)
#define RCC_AHB3ENR_RNGEN_B_0X0                     (0x0u<<2)
#define RCC_AHB3ENR_RNGEN_B_0X1                     (0x1u<<2)
#define RCC_AHB3ENR_HASHEN_B_0X0                    (0x0u<<1)
#define RCC_AHB3ENR_HASHEN_B_0X1                    (0x1u<<1)
#define RCC_AHB3ENR_CRYPEN_B_0X0                    (0x0u<<0)
#define RCC_AHB3ENR_CRYPEN_B_0X1                    (0x1u<<0)

// AHB4ENR Configuration

#define RCC_AHB4ENR_BKPSRAMEN                       (0x1u<<30)
#define RCC_AHB4ENR_RAMCFGEN                        (0x1u<<28)
#define RCC_AHB4ENR_HSEMEN                          (0x1u<<25)
#define RCC_AHB4ENR_SBSEN                           (0x1u<<23)
#define RCC_AHB4ENR_CRCEN                           (0x1u<<19)
#define RCC_AHB4ENR_GPIOMEN                         (0x1u<<12)
#define RCC_AHB4ENR_GPIOKEN                         (0x1u<<10)
#define RCC_AHB4ENR_GPIOJEN                         (0x1u<<9)
#define RCC_AHB4ENR_GPIOIEN                         (0x1u<<8)
#define RCC_AHB4ENR_GPIOHEN                         (0x1u<<7)
#define RCC_AHB4ENR_GPIOGEN                         (0x1u<<6)
#define RCC_AHB4ENR_GPIOFEN                         (0x1u<<5)
#define RCC_AHB4ENR_GPIOEEN                         (0x1u<<4)
#define RCC_AHB4ENR_GPIODEN                         (0x1u<<3)
#define RCC_AHB4ENR_GPIOCEN                         (0x1u<<2)
#define RCC_AHB4ENR_GPIOBEN                         (0x1u<<1)
#define RCC_AHB4ENR_GPIOAEN                         (0x1u<<0)

#define RCC_AHB4ENR_BKPSRAMEN_B_0X0                 (0x0u<<30)
#define RCC_AHB4ENR_BKPSRAMEN_B_0X1                 (0x1u<<30)
#define RCC_AHB4ENR_RAMCFGEN_B_0X0                  (0x0u<<28)
#define RCC_AHB4ENR_RAMCFGEN_B_0X1                  (0x1u<<28)
#define RCC_AHB4ENR_HSEMEN_B_0X0                    (0x0u<<25)
#define RCC_AHB4ENR_HSEMEN_B_0X1                    (0x1u<<25)
#define RCC_AHB4ENR_SBSEN_B_0X0                     (0x0u<<23)
#define RCC_AHB4ENR_SBSEN_B_0X1                     (0x1u<<23)
#define RCC_AHB4ENR_CRCEN_B_0X0                     (0x0u<<19)
#define RCC_AHB4ENR_CRCEN_B_0X1                     (0x1u<<19)
#define RCC_AHB4ENR_GPIOMEN_B_0X0                   (0x0u<<12)
#define RCC_AHB4ENR_GPIOMEN_B_0X1                   (0x1u<<12)
#define RCC_AHB4ENR_GPIOKEN_B_0X0                   (0x0u<<10)
#define RCC_AHB4ENR_GPIOKEN_B_0X1                   (0x1u<<10)
#define RCC_AHB4ENR_GPIOJEN_B_0X0                   (0x0u<<9)
#define RCC_AHB4ENR_GPIOJEN_B_0X1                   (0x1u<<9)
#define RCC_AHB4ENR_GPIOIEN_B_0X0                   (0x0u<<8)
#define RCC_AHB4ENR_GPIOIEN_B_0X1                   (0x1u<<8)
#define RCC_AHB4ENR_GPIOHEN_B_0X0                   (0x0u<<7)
#define RCC_AHB4ENR_GPIOHEN_B_0X1                   (0x1u<<7)
#define RCC_AHB4ENR_GPIOGEN_B_0X0                   (0x0u<<6)
#define RCC_AHB4ENR_GPIOGEN_B_0X1                   (0x1u<<6)
#define RCC_AHB4ENR_GPIOFEN_B_0X0                   (0x0u<<5)
#define RCC_AHB4ENR_GPIOFEN_B_0X1                   (0x1u<<5)
#define RCC_AHB4ENR_GPIOEEN_B_0X0                   (0x0u<<4)
#define RCC_AHB4ENR_GPIOEEN_B_0X1                   (0x1u<<4)
#define RCC_AHB4ENR_GPIODEN_B_0X0                   (0x0u<<3)
#define RCC_AHB4ENR_GPIODEN_B_0X1                   (0x1u<<3)
#define RCC_AHB4ENR_GPIOCEN_B_0X0                   (0x0u<<2)
#define RCC_AHB4ENR_GPIOCEN_B_0X1                   (0x1u<<2)
#define RCC_AHB4ENR_GPIOBEN_B_0X0                   (0x0u<<1)
#define RCC_AHB4ENR_GPIOBEN_B_0X1                   (0x1u<<1)
#define RCC_AHB4ENR_GPIOAEN_B_0X0                   (0x0u<<0)
#define RCC_AHB4ENR_GPIOAEN_B_0X1                   (0x1u<<0)

// AHB5ENR1 Configuration

#define RCC_AHB5ENR1_OTG1EN                         (0x1u<<30)
#define RCC_AHB5ENR1_ETH1CKEN                       (0x1u<<23)
#define RCC_AHB5ENR1_ETH1RXEN                       (0x1u<<22)
#define RCC_AHB5ENR1_ETH1TXEN                       (0x1u<<21)
#define RCC_AHB5ENR1_ETH1MACEN                      (0x1u<<20)
#define RCC_AHB5ENR1_GFXMMUEN                       (0x1u<<17)
#define RCC_AHB5ENR1_XSPIMEN                        (0x1u<<13)
#define RCC_AHB5ENR1_XSPI2EN                        (0x1u<<12)
#define RCC_AHB5ENR1_SDMMC1EN                       (0x1u<<8)
#define RCC_AHB5ENR1_SDMMC2EN                       (0x1u<<7)
#define RCC_AHB5ENR1_PSSIEN                         (0x1u<<6)
#define RCC_AHB5ENR1_XSPI1EN                        (0x1u<<5)
#define RCC_AHB5ENR1_FMCEN                          (0x1u<<4)
#define RCC_AHB5ENR1_JPEGEN                         (0x1u<<3)
#define RCC_AHB5ENR1_DMA2DEN                        (0x1u<<1)
#define RCC_AHB5ENR1_HPDMA1EN                       (0x1u<<0)

#define RCC_AHB5ENR1_OTG1EN_B_0X0                   (0x0u<<30)
#define RCC_AHB5ENR1_OTG1EN_B_0X1                   (0x1u<<30)
#define RCC_AHB5ENR1_ETH1CKEN_B_0X0                 (0x0u<<23)
#define RCC_AHB5ENR1_ETH1CKEN_B_0X1                 (0x1u<<23)
#define RCC_AHB5ENR1_ETH1RXEN_B_0X0                 (0x0u<<22)
#define RCC_AHB5ENR1_ETH1RXEN_B_0X1                 (0x1u<<22)
#define RCC_AHB5ENR1_ETH1TXEN_B_0X0                 (0x0u<<21)
#define RCC_AHB5ENR1_ETH1TXEN_B_0X1                 (0x1u<<21)
#define RCC_AHB5ENR1_ETH1MACEN_B_0X0                (0x0u<<20)
#define RCC_AHB5ENR1_ETH1MACEN_B_0X1                (0x1u<<20)
#define RCC_AHB5ENR1_GFXMMUEN_B_0X0                 (0x0u<<17)
#define RCC_AHB5ENR1_GFXMMUEN_B_0X1                 (0x1u<<17)
#define RCC_AHB5ENR1_XSPIMEN_B_0X0                  (0x0u<<13)
#define RCC_AHB5ENR1_XSPIMEN_B_0X1                  (0x1u<<13)
#define RCC_AHB5ENR1_XSPI2EN_B_0X0                  (0x0u<<12)
#define RCC_AHB5ENR1_XSPI2EN_B_0X1                  (0x1u<<12)
#define RCC_AHB5ENR1_SDMMC1EN_B_0X0                 (0x0u<<8)
#define RCC_AHB5ENR1_SDMMC1EN_B_0X1                 (0x1u<<8)
#define RCC_AHB5ENR1_SDMMC2EN_B_0X0                 (0x0u<<7)
#define RCC_AHB5ENR1_SDMMC2EN_B_0X1                 (0x1u<<7)
#define RCC_AHB5ENR1_PSSIEN_B_0X0                   (0x0u<<6)
#define RCC_AHB5ENR1_PSSIEN_B_0X1                   (0x1u<<6)
#define RCC_AHB5ENR1_XSPI1EN_B_0X0                  (0x0u<<5)
#define RCC_AHB5ENR1_XSPI1EN_B_0X1                  (0x1u<<5)
#define RCC_AHB5ENR1_FMCEN_B_0X0                    (0x0u<<4)
#define RCC_AHB5ENR1_FMCEN_B_0X1                    (0x1u<<4)
#define RCC_AHB5ENR1_JPEGEN_B_0X0                   (0x0u<<3)
#define RCC_AHB5ENR1_JPEGEN_B_0X1                   (0x1u<<3)
#define RCC_AHB5ENR1_DMA2DEN_B_0X0                  (0x0u<<1)
#define RCC_AHB5ENR1_DMA2DEN_B_0X1                  (0x1u<<1)
#define RCC_AHB5ENR1_HPDMA1EN_B_0X0                 (0x0u<<0)
#define RCC_AHB5ENR1_HPDMA1EN_B_0X1                 (0x1u<<0)

// AHB5ENR2 Configuration

