Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/STM32V873/Includes/Registers/stm32V873_rcc.h
#define RCC_AHB5ENR2_RISABDTCMEN                    (0x1u<<27)
#define RCC_AHB5ENR2_RISABITCMEN                    (0x1u<<26)
#define RCC_AHB5ENR2_RISABAXISRAM6FLEXEN            (0x1u<<25)
#define RCC_AHB5ENR2_RISABAXISRAM6FIXEN             (0x1u<<24)
#define RCC_AHB5ENR2_RISABAXISRAM5EN                (0x1u<<23)
#define RCC_AHB5ENR2_RISABAXISRAM4EN                (0x1u<<22)
#define RCC_AHB5ENR2_RISABAXISRAM3EN                (0x1u<<21)
#define RCC_AHB5ENR2_RISABAXISRAM2EN                (0x1u<<20)
#define RCC_AHB5ENR2_RISABAXISRAM1EN                (0x1u<<19)
#define RCC_AHB5ENR2_RISABAHBSRAM2EN                (0x1u<<18)
#define RCC_AHB5ENR2_RISABAHBSRAM1EN                (0x1u<<17)
#define RCC_AHB5ENR2_RISAFBKPSRAMEN                 (0x1u<<16)
#define RCC_AHB5ENR2_RISAFFMCEN                     (0x1u<<15)
#define RCC_AHB5ENR2_RISAFXSPI2EN                   (0x1u<<14)
#define RCC_AHB5ENR2_RISAFXSPI1EN                   (0x1u<<13)
#define RCC_AHB5ENR2_RIFSCEN                        (0x1u<<11)

#define RCC_AHB5ENR2_RISABDTCMEN_B_0X0              (0x0u<<27)
#define RCC_AHB5ENR2_RISABDTCMEN_B_0X1              (0x1u<<27)
#define RCC_AHB5ENR2_RISABITCMEN_B_0X0              (0x0u<<26)
#define RCC_AHB5ENR2_RISABITCMEN_B_0X1              (0x1u<<26)
#define RCC_AHB5ENR2_RISABAXISRAM6FLEXEN_B_0X0      (0x0u<<25)
#define RCC_AHB5ENR2_RISABAXISRAM6FLEXEN_B_0X1      (0x1u<<25)
#define RCC_AHB5ENR2_RISABAXISRAM6FIXEN_B_0X0       (0x0u<<24)
#define RCC_AHB5ENR2_RISABAXISRAM6FIXEN_B_0X1       (0x1u<<24)
#define RCC_AHB5ENR2_RISABAXISRAM5EN_B_0X0          (0x0u<<23)
#define RCC_AHB5ENR2_RISABAXISRAM5EN_B_0X1          (0x1u<<23)
#define RCC_AHB5ENR2_RISABAXISRAM4EN_B_0X0          (0x0u<<22)
#define RCC_AHB5ENR2_RISABAXISRAM4EN_B_0X1          (0x1u<<22)
#define RCC_AHB5ENR2_RISABAXISRAM3EN_B_0X0          (0x0u<<21)
#define RCC_AHB5ENR2_RISABAXISRAM3EN_B_0X1          (0x1u<<21)
#define RCC_AHB5ENR2_RISABAXISRAM2EN_B_0X0          (0x0u<<20)
#define RCC_AHB5ENR2_RISABAXISRAM2EN_B_0X1          (0x1u<<20)
#define RCC_AHB5ENR2_RISABAXISRAM1EN_B_0X0          (0x0u<<19)
#define RCC_AHB5ENR2_RISABAXISRAM1EN_B_0X1          (0x1u<<19)
#define RCC_AHB5ENR2_RISABAHBSRAM2EN_B_0X0          (0x0u<<18)
#define RCC_AHB5ENR2_RISABAHBSRAM2EN_B_0X1          (0x1u<<18)
#define RCC_AHB5ENR2_RISABAHBSRAM1EN_B_0X0          (0x0u<<17)
#define RCC_AHB5ENR2_RISABAHBSRAM1EN_B_0X1          (0x1u<<17)
#define RCC_AHB5ENR2_RISAFBKPSRAMEN_B_0X0           (0x0u<<16)
#define RCC_AHB5ENR2_RISAFBKPSRAMEN_B_0X1           (0x1u<<16)
#define RCC_AHB5ENR2_RISAFFMCEN_B_0X0               (0x0u<<15)
#define RCC_AHB5ENR2_RISAFFMCEN_B_0X1               (0x1u<<15)
#define RCC_AHB5ENR2_RISAFXSPI2EN_B_0X0             (0x0u<<14)
#define RCC_AHB5ENR2_RISAFXSPI2EN_B_0X1             (0x1u<<14)
#define RCC_AHB5ENR2_RISAFXSPI1EN_B_0X0             (0x0u<<13)
#define RCC_AHB5ENR2_RISAFXSPI1EN_B_0X1             (0x1u<<13)
#define RCC_AHB5ENR2_RIFSCEN_B_0X0                  (0x0u<<11)
#define RCC_AHB5ENR2_RIFSCEN_B_0X1                  (0x1u<<11)

// APB1ENR1 Configuration

#define RCC_APB1ENR1_UART8EN                        (0x1u<<31)
#define RCC_APB1ENR1_UART7EN                        (0x1u<<30)
#define RCC_APB1ENR1_HDMICECEN                      (0x1u<<27)
#define RCC_APB1ENR1_I3C2EN                         (0x1u<<25)
#define RCC_APB1ENR1_I3C1EN                         (0x1u<<24)
#define RCC_APB1ENR1_I2C3EN                         (0x1u<<23)
#define RCC_APB1ENR1_I2C2EN                         (0x1u<<22)
#define RCC_APB1ENR1_I2C1EN                         (0x1u<<21)
#define RCC_APB1ENR1_UART5EN                        (0x1u<<20)
#define RCC_APB1ENR1_UART4EN                        (0x1u<<19)
#define RCC_APB1ENR1_USART3EN                       (0x1u<<18)
#define RCC_APB1ENR1_USART2EN                       (0x1u<<17)
#define RCC_APB1ENR1_SPDIFRXEN                      (0x1u<<16)
#define RCC_APB1ENR1_SPI3EN                         (0x1u<<15)
#define RCC_APB1ENR1_SPI2EN                         (0x1u<<14)
#define RCC_APB1ENR1_TIM10EN                        (0x1u<<12)
#define RCC_APB1ENR1_WWDGEN                         (0x1u<<11)
#define RCC_APB1ENR1_LPTIM1EN                       (0x1u<<9)
#define RCC_APB1ENR1_TIM14EN                        (0x1u<<8)
#define RCC_APB1ENR1_TIM13EN                        (0x1u<<7)
#define RCC_APB1ENR1_TIM12EN                        (0x1u<<6)
#define RCC_APB1ENR1_TIM7EN                         (0x1u<<5)
#define RCC_APB1ENR1_TIM6EN                         (0x1u<<4)
#define RCC_APB1ENR1_TIM5EN                         (0x1u<<3)
#define RCC_APB1ENR1_TIM4EN                         (0x1u<<2)
#define RCC_APB1ENR1_TIM3EN                         (0x1u<<1)
#define RCC_APB1ENR1_TIM2EN                         (0x1u<<0)

#define RCC_APB1ENR1_UART8EN_B_0X0                  (0x0u<<31)
#define RCC_APB1ENR1_UART8EN_B_0X1                  (0x1u<<31)
#define RCC_APB1ENR1_UART7EN_B_0X0                  (0x0u<<30)
#define RCC_APB1ENR1_UART7EN_B_0X1                  (0x1u<<30)
#define RCC_APB1ENR1_HDMICECEN_B_0X0                (0x0u<<27)
#define RCC_APB1ENR1_HDMICECEN_B_0X1                (0x1u<<27)
#define RCC_APB1ENR1_I3C2EN_B_0X0                   (0x0u<<25)
#define RCC_APB1ENR1_I3C2EN_B_0X1                   (0x1u<<25)
#define RCC_APB1ENR1_I3C1EN_B_0X0                   (0x0u<<24)
#define RCC_APB1ENR1_I3C1EN_B_0X1                   (0x1u<<24)
#define RCC_APB1ENR1_I2C3EN_B_0X0                   (0x0u<<23)
#define RCC_APB1ENR1_I2C3EN_B_0X1                   (0x1u<<23)
#define RCC_APB1ENR1_I2C2EN_B_0X0                   (0x0u<<22)
#define RCC_APB1ENR1_I2C2EN_B_0X1                   (0x1u<<22)
#define RCC_APB1ENR1_I2C1EN_B_0X0                   (0x0u<<21)
#define RCC_APB1ENR1_I2C1EN_B_0X1                   (0x1u<<21)
#define RCC_APB1ENR1_UART5EN_B_0X0                  (0x0u<<20)
#define RCC_APB1ENR1_UART5EN_B_0X1                  (0x1u<<20)
#define RCC_APB1ENR1_UART4EN_B_0X0                  (0x0u<<19)
#define RCC_APB1ENR1_UART4EN_B_0X1                  (0x1u<<19)
#define RCC_APB1ENR1_USART3EN_B_0X0                 (0x0u<<18)
#define RCC_APB1ENR1_USART3EN_B_0X1                 (0x1u<<18)
#define RCC_APB1ENR1_USART2EN_B_0X0                 (0x0u<<17)
#define RCC_APB1ENR1_USART2EN_B_0X1                 (0x1u<<17)
#define RCC_APB1ENR1_SPDIFRXEN_B_0X0                (0x0u<<16)
#define RCC_APB1ENR1_SPDIFRXEN_B_0X1                (0x1u<<16)
#define RCC_APB1ENR1_SPI3EN_B_0X0                   (0x0u<<15)
#define RCC_APB1ENR1_SPI3EN_B_0X1                   (0x1u<<15)
#define RCC_APB1ENR1_SPI2EN_B_0X0                   (0x0u<<14)
#define RCC_APB1ENR1_SPI2EN_B_0X1                   (0x1u<<14)
#define RCC_APB1ENR1_TIM10EN_B_0X0                  (0x0u<<12)
#define RCC_APB1ENR1_TIM10EN_B_0X1                  (0x1u<<12)
#define RCC_APB1ENR1_WWDGEN_B_0X0                   (0x0u<<11)
#define RCC_APB1ENR1_WWDGEN_B_0X1                   (0x1u<<11)
#define RCC_APB1ENR1_LPTIM1EN_B_0X0                 (0x0u<<9)
#define RCC_APB1ENR1_LPTIM1EN_B_0X1                 (0x1u<<9)
#define RCC_APB1ENR1_TIM14EN_B_0X0                  (0x0u<<8)
#define RCC_APB1ENR1_TIM14EN_B_0X1                  (0x1u<<8)
#define RCC_APB1ENR1_TIM13EN_B_0X0                  (0x0u<<7)
#define RCC_APB1ENR1_TIM13EN_B_0X1                  (0x1u<<7)
#define RCC_APB1ENR1_TIM12EN_B_0X0                  (0x0u<<6)
#define RCC_APB1ENR1_TIM12EN_B_0X1                  (0x1u<<6)
#define RCC_APB1ENR1_TIM7EN_B_0X0                   (0x0u<<5)
#define RCC_APB1ENR1_TIM7EN_B_0X1                   (0x1u<<5)
#define RCC_APB1ENR1_TIM6EN_B_0X0                   (0x0u<<4)
#define RCC_APB1ENR1_TIM6EN_B_0X1                   (0x1u<<4)
#define RCC_APB1ENR1_TIM5EN_B_0X0                   (0x0u<<3)
#define RCC_APB1ENR1_TIM5EN_B_0X1                   (0x1u<<3)
#define RCC_APB1ENR1_TIM4EN_B_0X0                   (0x0u<<2)
#define RCC_APB1ENR1_TIM4EN_B_0X1                   (0x1u<<2)
#define RCC_APB1ENR1_TIM3EN_B_0X0                   (0x0u<<1)
#define RCC_APB1ENR1_TIM3EN_B_0X1                   (0x1u<<1)
#define RCC_APB1ENR1_TIM2EN_B_0X0                   (0x0u<<0)
#define RCC_APB1ENR1_TIM2EN_B_0X1                   (0x1u<<0)

// APB1ENR2 Configuration

#define RCC_APB1ENR2_UCPD1EN                        (0x1u<<31)
#define RCC_APB1ENR2_FDCANEN                        (0x1u<<8)
#define RCC_APB1ENR2_MDIOSEN                        (0x1u<<5)
#define RCC_APB1ENR2_CRSEN                          (0x1u<<1)

#define RCC_APB1ENR2_UCPD1EN_B_0X0                  (0x0u<<31)
#define RCC_APB1ENR2_UCPD1EN_B_0X1                  (0x1u<<31)
#define RCC_APB1ENR2_FDCANEN_B_0X0                  (0x0u<<8)
#define RCC_APB1ENR2_FDCANEN_B_0X1                  (0x1u<<8)
#define RCC_APB1ENR2_MDIOSEN_B_0X0                  (0x0u<<5)
#define RCC_APB1ENR2_MDIOSEN_B_0X1                  (0x1u<<5)
#define RCC_APB1ENR2_CRSEN_B_0X0                    (0x0u<<1)
#define RCC_APB1ENR2_CRSEN_B_0X1                    (0x1u<<1)

