Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/STM32V873/Includes/Registers/stm32V873_rcc.h
// APB2ENR Configuration

#define RCC_APB2ENR_HRTIM1EN                        (0x1u<<28)
#define RCC_APB2ENR_SAI2EN                          (0x1u<<23)
#define RCC_APB2ENR_SAI1EN                          (0x1u<<22)
#define RCC_APB2ENR_SPI5EN                          (0x1u<<20)
#define RCC_APB2ENR_TIM9EN                          (0x1u<<19)
#define RCC_APB2ENR_TIM17EN                         (0x1u<<18)
#define RCC_APB2ENR_TIM16EN                         (0x1u<<17)
#define RCC_APB2ENR_TIM15EN                         (0x1u<<16)
#define RCC_APB2ENR_SPI4EN                          (0x1u<<13)
#define RCC_APB2ENR_SPI1EN                          (0x1u<<12)
#define RCC_APB2ENR_USART10EN                       (0x1u<<7)
#define RCC_APB2ENR_UART9EN                         (0x1u<<6)
#define RCC_APB2ENR_USART6EN                        (0x1u<<5)
#define RCC_APB2ENR_USART1EN                        (0x1u<<4)
#define RCC_APB2ENR_TIM20EN                         (0x1u<<2)
#define RCC_APB2ENR_TIM8EN                          (0x1u<<1)
#define RCC_APB2ENR_TIM1EN                          (0x1u<<0)

#define RCC_APB2ENR_HRTIM1EN_B_0X0                  (0x0u<<28)
#define RCC_APB2ENR_HRTIM1EN_B_0X1                  (0x1u<<28)
#define RCC_APB2ENR_SAI2EN_B_0X0                    (0x0u<<23)
#define RCC_APB2ENR_SAI2EN_B_0X1                    (0x1u<<23)
#define RCC_APB2ENR_SAI1EN_B_0X0                    (0x0u<<22)
#define RCC_APB2ENR_SAI1EN_B_0X1                    (0x1u<<22)
#define RCC_APB2ENR_SPI5EN_B_0X0                    (0x0u<<20)
#define RCC_APB2ENR_SPI5EN_B_0X1                    (0x1u<<20)
#define RCC_APB2ENR_TIM9EN_B_0X0                    (0x0u<<19)
#define RCC_APB2ENR_TIM9EN_B_0X1                    (0x1u<<19)
#define RCC_APB2ENR_TIM17EN_B_0X0                   (0x0u<<18)
#define RCC_APB2ENR_TIM17EN_B_0X1                   (0x1u<<18)
#define RCC_APB2ENR_TIM16EN_B_0X0                   (0x0u<<17)
#define RCC_APB2ENR_TIM16EN_B_0X1                   (0x1u<<17)
#define RCC_APB2ENR_TIM15EN_B_0X0                   (0x0u<<16)
#define RCC_APB2ENR_TIM15EN_B_0X1                   (0x1u<<16)
#define RCC_APB2ENR_SPI4EN_B_0X0                    (0x0u<<13)
#define RCC_APB2ENR_SPI4EN_B_0X1                    (0x1u<<13)
#define RCC_APB2ENR_SPI1EN_B_0X0                    (0x0u<<12)
#define RCC_APB2ENR_SPI1EN_B_0X1                    (0x1u<<12)
#define RCC_APB2ENR_USART10EN_B_0X0                 (0x0u<<7)
#define RCC_APB2ENR_USART10EN_B_0X1                 (0x1u<<7)
#define RCC_APB2ENR_UART9EN_B_0X0                   (0x0u<<6)
#define RCC_APB2ENR_UART9EN_B_0X1                   (0x1u<<6)
#define RCC_APB2ENR_USART6EN_B_0X0                  (0x0u<<5)
#define RCC_APB2ENR_USART6EN_B_0X1                  (0x1u<<5)
#define RCC_APB2ENR_USART1EN_B_0X0                  (0x0u<<4)
#define RCC_APB2ENR_USART1EN_B_0X1                  (0x1u<<4)
#define RCC_APB2ENR_TIM20EN_B_0X0                   (0x0u<<2)
#define RCC_APB2ENR_TIM20EN_B_0X1                   (0x1u<<2)
#define RCC_APB2ENR_TIM8EN_B_0X0                    (0x0u<<1)
#define RCC_APB2ENR_TIM8EN_B_0X1                    (0x1u<<1)
#define RCC_APB2ENR_TIM1EN_B_0X0                    (0x0u<<0)
#define RCC_APB2ENR_TIM1EN_B_0X1                    (0x1u<<0)

// APB4ENR Configuration

#define RCC_APB4ENR_DTSEN                           (0x1u<<26)
#define RCC_APB4ENR_RTCAPBEN                        (0x1u<<16)
#define RCC_APB4ENR_VREFBUFEN                       (0x1u<<15)
#define RCC_APB4ENR_LPTIM5EN                        (0x1u<<12)
#define RCC_APB4ENR_LPTIM4EN                        (0x1u<<11)
#define RCC_APB4ENR_LPTIM3EN                        (0x1u<<10)
#define RCC_APB4ENR_LPTIM2EN                        (0x1u<<9)
#define RCC_APB4ENR_SPI6EN                          (0x1u<<5)
#define RCC_APB4ENR_LPUART1EN                       (0x1u<<3)

#define RCC_APB4ENR_DTSEN_B_0X0                     (0x0u<<26)
#define RCC_APB4ENR_DTSEN_B_0X1                     (0x1u<<26)
#define RCC_APB4ENR_RTCAPBEN_B_0X0                  (0x0u<<16)
#define RCC_APB4ENR_RTCAPBEN_B_0X1                  (0x1u<<16)
#define RCC_APB4ENR_VREFBUFEN_B_0X0                 (0x0u<<15)
#define RCC_APB4ENR_VREFBUFEN_B_0X1                 (0x1u<<15)
#define RCC_APB4ENR_LPTIM5EN_B_0X0                  (0x0u<<12)
#define RCC_APB4ENR_LPTIM5EN_B_0X1                  (0x1u<<12)
#define RCC_APB4ENR_LPTIM4EN_B_0X0                  (0x0u<<11)
#define RCC_APB4ENR_LPTIM4EN_B_0X1                  (0x1u<<11)
#define RCC_APB4ENR_LPTIM3EN_B_0X0                  (0x0u<<10)
#define RCC_APB4ENR_LPTIM3EN_B_0X1                  (0x1u<<10)
#define RCC_APB4ENR_LPTIM2EN_B_0X0                  (0x0u<<9)
#define RCC_APB4ENR_LPTIM2EN_B_0X1                  (0x1u<<9)
#define RCC_APB4ENR_SPI6EN_B_0X0                    (0x0u<<5)
#define RCC_APB4ENR_SPI6EN_B_0X1                    (0x1u<<5)
#define RCC_APB4ENR_LPUART1EN_B_0X0                 (0x0u<<3)
#define RCC_APB4ENR_LPUART1EN_B_0X1                 (0x1u<<3)

// APB5ENR Configuration

#define RCC_APB5ENR_GFXTIMEN                        (0x1u<<4)
#define RCC_APB5ENR_DCMIPPEN                        (0x1u<<2)
#define RCC_APB5ENR_LTDCEN                          (0x1u<<1)

#define RCC_APB5ENR_GFXTIMEN_B_0X0                  (0x0u<<4)
#define RCC_APB5ENR_GFXTIMEN_B_0X1                  (0x1u<<4)
#define RCC_APB5ENR_DCMIPPEN_B_0X0                  (0x0u<<2)
#define RCC_APB5ENR_DCMIPPEN_B_0X1                  (0x1u<<2)
#define RCC_APB5ENR_LTDCEN_B_0X0                    (0x0u<<1)
#define RCC_APB5ENR_LTDCEN_B_0X1                    (0x1u<<1)

// AHB1LPENR Configuration

#define RCC_AHB1LPENR_AHBSRAM2LPEN                  (0x1u<<29)
#define RCC_AHB1LPENR_AHBSRAM1LPEN                  (0x1u<<28)
#define RCC_AHB1LPENR_OTGFSLPEN                     (0x1u<<27)
#define RCC_AHB1LPENR_DACLPEN                       (0x1u<<5)
#define RCC_AHB1LPENR_ADC123LPEN                    (0x1u<<2)
#define RCC_AHB1LPENR_GPDMA2LPEN                    (0x1u<<1)
#define RCC_AHB1LPENR_GPDMA1LPEN                    (0x1u<<0)

#define RCC_AHB1LPENR_AHBSRAM2LPEN_B_0X0            (0x0u<<29)
#define RCC_AHB1LPENR_AHBSRAM2LPEN_B_0X1            (0x1u<<29)
#define RCC_AHB1LPENR_AHBSRAM1LPEN_B_0X0            (0x0u<<28)
#define RCC_AHB1LPENR_AHBSRAM1LPEN_B_0X1            (0x1u<<28)
#define RCC_AHB1LPENR_OTGFSLPEN_B_0X0               (0x0u<<27)
#define RCC_AHB1LPENR_OTGFSLPEN_B_0X1               (0x1u<<27)
#define RCC_AHB1LPENR_DACLPEN_B_0X0                 (0x0u<<5)
#define RCC_AHB1LPENR_DACLPEN_B_0X1                 (0x1u<<5)
#define RCC_AHB1LPENR_ADC123LPEN_B_0X0              (0x0u<<2)
#define RCC_AHB1LPENR_ADC123LPEN_B_0X1              (0x1u<<2)
#define RCC_AHB1LPENR_GPDMA2LPEN_B_0X0              (0x0u<<1)
#define RCC_AHB1LPENR_GPDMA2LPEN_B_0X1              (0x1u<<1)
#define RCC_AHB1LPENR_GPDMA1LPEN_B_0X0              (0x0u<<0)
#define RCC_AHB1LPENR_GPDMA1LPEN_B_0X1              (0x1u<<0)

