Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/STM32V873/Includes/Registers/stm32V873_rcc.h
// AHB2LPENR Configuration

#define RCC_AHB2LPENR_ADF1LPEN                      (0x1u<<17)
#define RCC_AHB2LPENR_MDF1LPEN                      (0x1u<<16)
#define RCC_AHB2LPENR_CORDICLPEN                    (0x1u<<14)
#define RCC_AHB2LPENR_FMACLPEN                      (0x1u<<13)

#define RCC_AHB2LPENR_ADF1LPEN_B_0X0                (0x0u<<17)
#define RCC_AHB2LPENR_ADF1LPEN_B_0X1                (0x1u<<17)
#define RCC_AHB2LPENR_MDF1LPEN_B_0X0                (0x0u<<16)
#define RCC_AHB2LPENR_MDF1LPEN_B_0X1                (0x1u<<16)
#define RCC_AHB2LPENR_CORDICLPEN_B_0X0              (0x0u<<14)
#define RCC_AHB2LPENR_CORDICLPEN_B_0X1              (0x1u<<14)
#define RCC_AHB2LPENR_FMACLPEN_B_0X0                (0x0u<<13)
#define RCC_AHB2LPENR_FMACLPEN_B_0X1                (0x1u<<13)

// AHB3LPENR Configuration

#define RCC_AHB3LPENR_CCBLPEN                       (0x1u<<15)
#define RCC_AHB3LPENR_PKALPEN                       (0x1u<<8)
#define RCC_AHB3LPENR_SAESLPEN                      (0x1u<<3)
#define RCC_AHB3LPENR_RNGLPEN                       (0x1u<<2)
#define RCC_AHB3LPENR_HASHLPEN                      (0x1u<<1)
#define RCC_AHB3LPENR_CRYPLPEN                      (0x1u<<0)

#define RCC_AHB3LPENR_CCBLPEN_B_0X0                 (0x0u<<15)
#define RCC_AHB3LPENR_CCBLPEN_B_0X1                 (0x1u<<15)
#define RCC_AHB3LPENR_PKALPEN_B_0X0                 (0x0u<<8)
#define RCC_AHB3LPENR_PKALPEN_B_0X1                 (0x1u<<8)
#define RCC_AHB3LPENR_SAESLPEN_B_0X0                (0x0u<<3)
#define RCC_AHB3LPENR_SAESLPEN_B_0X1                (0x1u<<3)
#define RCC_AHB3LPENR_RNGLPEN_B_0X0                 (0x0u<<2)
#define RCC_AHB3LPENR_RNGLPEN_B_0X1                 (0x1u<<2)
#define RCC_AHB3LPENR_HASHLPEN_B_0X0                (0x0u<<1)
#define RCC_AHB3LPENR_HASHLPEN_B_0X1                (0x1u<<1)
#define RCC_AHB3LPENR_CRYPLPEN_B_0X0                (0x0u<<0)
#define RCC_AHB3LPENR_CRYPLPEN_B_0X1                (0x1u<<0)

// AHB4LPENR Configuration

#define RCC_AHB4LPENR_BKPSRAMLPEN                   (0x1u<<30)
#define RCC_AHB4LPENR_RAMCFGLPEN                    (0x1u<<28)
#define RCC_AHB4LPENR_HSEMLPEN                      (0x1u<<25)
#define RCC_AHB4LPENR_SBSLPEN                       (0x1u<<23)
#define RCC_AHB4LPENR_CRCLPEN                       (0x1u<<19)
#define RCC_AHB4LPENR_GPIOMLPEN                     (0x1u<<12)
#define RCC_AHB4LPENR_GPIOKLPEN                     (0x1u<<10)
#define RCC_AHB4LPENR_GPIOJLPEN                     (0x1u<<9)
#define RCC_AHB4LPENR_GPIOILPEN                     (0x1u<<8)
#define RCC_AHB4LPENR_GPIOHLPEN                     (0x1u<<7)
#define RCC_AHB4LPENR_GPIOGLPEN                     (0x1u<<6)
#define RCC_AHB4LPENR_GPIOFLPEN                     (0x1u<<5)
#define RCC_AHB4LPENR_GPIOELPEN                     (0x1u<<4)
#define RCC_AHB4LPENR_GPIODLPEN                     (0x1u<<3)
#define RCC_AHB4LPENR_GPIOCLPEN                     (0x1u<<2)
#define RCC_AHB4LPENR_GPIOBLPEN                     (0x1u<<1)
#define RCC_AHB4LPENR_GPIOALPEN                     (0x1u<<0)

#define RCC_AHB4LPENR_BKPSRAMLPEN_B_0X0             (0x0u<<30)
#define RCC_AHB4LPENR_BKPSRAMLPEN_B_0X1             (0x1u<<30)
#define RCC_AHB4LPENR_RAMCFGLPEN_B_0X0              (0x0u<<28)
#define RCC_AHB4LPENR_RAMCFGLPEN_B_0X1              (0x1u<<28)
#define RCC_AHB4LPENR_HSEMLPEN_B_0X0                (0x0u<<25)
#define RCC_AHB4LPENR_HSEMLPEN_B_0X1                (0x1u<<25)
#define RCC_AHB4LPENR_SBSLPEN_B_0X0                 (0x0u<<23)
#define RCC_AHB4LPENR_SBSLPEN_B_0X1                 (0x1u<<23)
#define RCC_AHB4LPENR_CRCLPEN_B_0X0                 (0x0u<<19)
#define RCC_AHB4LPENR_CRCLPEN_B_0X1                 (0x1u<<19)
#define RCC_AHB4LPENR_GPIOMLPEN_B_0X0               (0x0u<<12)
#define RCC_AHB4LPENR_GPIOMLPEN_B_0X1               (0x1u<<12)
#define RCC_AHB4LPENR_GPIOKLPEN_B_0X0               (0x0u<<10)
#define RCC_AHB4LPENR_GPIOKLPEN_B_0X1               (0x1u<<10)
#define RCC_AHB4LPENR_GPIOJLPEN_B_0X0               (0x0u<<9)
#define RCC_AHB4LPENR_GPIOJLPEN_B_0X1               (0x1u<<9)
#define RCC_AHB4LPENR_GPIOILPEN_B_0X0               (0x0u<<8)
#define RCC_AHB4LPENR_GPIOILPEN_B_0X1               (0x1u<<8)
#define RCC_AHB4LPENR_GPIOHLPEN_B_0X0               (0x0u<<7)
#define RCC_AHB4LPENR_GPIOHLPEN_B_0X1               (0x1u<<7)
#define RCC_AHB4LPENR_GPIOGLPEN_B_0X0               (0x0u<<6)
#define RCC_AHB4LPENR_GPIOGLPEN_B_0X1               (0x1u<<6)
#define RCC_AHB4LPENR_GPIOFLPEN_B_0X0               (0x0u<<5)
#define RCC_AHB4LPENR_GPIOFLPEN_B_0X1               (0x1u<<5)
#define RCC_AHB4LPENR_GPIOELPEN_B_0X0               (0x0u<<4)
#define RCC_AHB4LPENR_GPIOELPEN_B_0X1               (0x1u<<4)
#define RCC_AHB4LPENR_GPIODLPEN_B_0X0               (0x0u<<3)
#define RCC_AHB4LPENR_GPIODLPEN_B_0X1               (0x1u<<3)
#define RCC_AHB4LPENR_GPIOCLPEN_B_0X0               (0x0u<<2)
#define RCC_AHB4LPENR_GPIOCLPEN_B_0X1               (0x1u<<2)
#define RCC_AHB4LPENR_GPIOBLPEN_B_0X0               (0x0u<<1)
#define RCC_AHB4LPENR_GPIOBLPEN_B_0X1               (0x1u<<1)
#define RCC_AHB4LPENR_GPIOALPEN_B_0X0               (0x0u<<0)
#define RCC_AHB4LPENR_GPIOALPEN_B_0X1               (0x1u<<0)

// AHB5LPENR1 Configuration

#define RCC_AHB5LPENR1_OTG1LPEN                     (0x1u<<30)
#define RCC_AHB5LPENR1_ETH1CKLPEN                   (0x1u<<23)
#define RCC_AHB5LPENR1_ETH1RXLPEN                   (0x1u<<22)
#define RCC_AHB5LPENR1_ETH1TXLPEN                   (0x1u<<21)
#define RCC_AHB5LPENR1_ETH1MACLPEN                  (0x1u<<20)
#define RCC_AHB5LPENR1_GFXMMULPEN                   (0x1u<<17)
#define RCC_AHB5LPENR1_XSPIMLPEN                    (0x1u<<13)
#define RCC_AHB5LPENR1_XSPI2LPEN                    (0x1u<<12)
#define RCC_AHB5LPENR1_SDMMC1LPEN                   (0x1u<<8)
#define RCC_AHB5LPENR1_SDMMC2LPEN                   (0x1u<<7)
#define RCC_AHB5LPENR1_PSSILPEN                     (0x1u<<6)
#define RCC_AHB5LPENR1_XSPI1LPEN                    (0x1u<<5)
#define RCC_AHB5LPENR1_FMCLPEN                      (0x1u<<4)
#define RCC_AHB5LPENR1_JPEGLPEN                     (0x1u<<3)
#define RCC_AHB5LPENR1_NVMIFLPEN                    (0x1u<<2)
#define RCC_AHB5LPENR1_DMA2DLPEN                    (0x1u<<1)
#define RCC_AHB5LPENR1_HPDMA1LPEN                   (0x1u<<0)

