Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/STM32V873/Includes/Registers/stm32V873_rcc.h
#define RCC_AHB5LPENR1_OTG1LPEN_B_0X0               (0x0u<<30)
#define RCC_AHB5LPENR1_OTG1LPEN_B_0X1               (0x1u<<30)
#define RCC_AHB5LPENR1_ETH1CKLPEN_B_0X0             (0x0u<<23)
#define RCC_AHB5LPENR1_ETH1CKLPEN_B_0X1             (0x1u<<23)
#define RCC_AHB5LPENR1_ETH1RXLPEN_B_0X0             (0x0u<<22)
#define RCC_AHB5LPENR1_ETH1RXLPEN_B_0X1             (0x1u<<22)
#define RCC_AHB5LPENR1_ETH1TXLPEN_B_0X0             (0x0u<<21)
#define RCC_AHB5LPENR1_ETH1TXLPEN_B_0X1             (0x1u<<21)
#define RCC_AHB5LPENR1_ETH1MACLPEN_B_0X0            (0x0u<<20)
#define RCC_AHB5LPENR1_ETH1MACLPEN_B_0X1            (0x1u<<20)
#define RCC_AHB5LPENR1_GFXMMULPEN_B_0X0             (0x0u<<17)
#define RCC_AHB5LPENR1_GFXMMULPEN_B_0X1             (0x1u<<17)
#define RCC_AHB5LPENR1_XSPIMLPEN_B_0X0              (0x0u<<13)
#define RCC_AHB5LPENR1_XSPIMLPEN_B_0X1              (0x1u<<13)
#define RCC_AHB5LPENR1_XSPI2LPEN_B_0X0              (0x0u<<12)
#define RCC_AHB5LPENR1_XSPI2LPEN_B_0X1              (0x1u<<12)
#define RCC_AHB5LPENR1_SDMMC1LPEN_B_0X0             (0x0u<<8)
#define RCC_AHB5LPENR1_SDMMC1LPEN_B_0X1             (0x1u<<8)
#define RCC_AHB5LPENR1_SDMMC2LPEN_B_0X0             (0x0u<<7)
#define RCC_AHB5LPENR1_SDMMC2LPEN_B_0X1             (0x1u<<7)
#define RCC_AHB5LPENR1_PSSILPEN_B_0X0               (0x0u<<6)
#define RCC_AHB5LPENR1_PSSILPEN_B_0X1               (0x1u<<6)
#define RCC_AHB5LPENR1_XSPI1LPEN_B_0X0              (0x0u<<5)
#define RCC_AHB5LPENR1_XSPI1LPEN_B_0X1              (0x1u<<5)
#define RCC_AHB5LPENR1_FMCLPEN_B_0X0                (0x0u<<4)
#define RCC_AHB5LPENR1_FMCLPEN_B_0X1                (0x1u<<4)
#define RCC_AHB5LPENR1_JPEGLPEN_B_0X0               (0x0u<<3)
#define RCC_AHB5LPENR1_JPEGLPEN_B_0X1               (0x1u<<3)
#define RCC_AHB5LPENR1_NVMIFLPEN_B_0X0              (0x0u<<2)
#define RCC_AHB5LPENR1_NVMIFLPEN_B_0X1              (0x1u<<2)
#define RCC_AHB5LPENR1_DMA2DLPEN_B_0X0              (0x0u<<1)
#define RCC_AHB5LPENR1_DMA2DLPEN_B_0X1              (0x1u<<1)
#define RCC_AHB5LPENR1_HPDMA1LPEN_B_0X0             (0x0u<<0)
#define RCC_AHB5LPENR1_HPDMA1LPEN_B_0X1             (0x1u<<0)

// AHB5LPENR2 Configuration

#define RCC_AHB5LPENR2_AXISRAMLPEN                  (0x1u<<31)
#define RCC_AHB5LPENR2_ITCMLPEN                     (0x1u<<30)
#define RCC_AHB5LPENR2_DTCMLPEN                     (0x1u<<29)
#define RCC_AHB5LPENR2_RISABDTCMLPEN                (0x1u<<27)
#define RCC_AHB5LPENR2_RISABITCMLPEN                (0x1u<<26)
#define RCC_AHB5LPENR2_RISABAXISRAM6FLEXLPEN        (0x1u<<25)
#define RCC_AHB5LPENR2_RISABAXISRAM6FIXLPEN         (0x1u<<24)
#define RCC_AHB5LPENR2_RISABAXISRAM5LPEN            (0x1u<<23)
#define RCC_AHB5LPENR2_RISABAXISRAM4LPEN            (0x1u<<22)
#define RCC_AHB5LPENR2_RISABAXISRAM3LPEN            (0x1u<<21)
#define RCC_AHB5LPENR2_RISABAXISRAM2LPEN            (0x1u<<20)
#define RCC_AHB5LPENR2_RISABAXISRAM1LPEN            (0x1u<<19)
#define RCC_AHB5LPENR2_RISABAHBSRAM2LPEN            (0x1u<<18)
#define RCC_AHB5LPENR2_RISABAHBSRAM1LPEN            (0x1u<<17)
#define RCC_AHB5LPENR2_RISAFBKPSRAMLPEN             (0x1u<<16)
#define RCC_AHB5LPENR2_RISAFFMCLPEN                 (0x1u<<15)
#define RCC_AHB5LPENR2_RISAFXSPI2LPEN               (0x1u<<14)
#define RCC_AHB5LPENR2_RISAFXSPI1LPEN               (0x1u<<13)
#define RCC_AHB5LPENR2_RIFSCLPEN                    (0x1u<<11)

#define RCC_AHB5LPENR2_AXISRAMLPEN_B_0X0            (0x0u<<31)
#define RCC_AHB5LPENR2_AXISRAMLPEN_B_0X1            (0x1u<<31)
#define RCC_AHB5LPENR2_ITCMLPEN_B_0X0               (0x0u<<30)
#define RCC_AHB5LPENR2_ITCMLPEN_B_0X1               (0x1u<<30)
#define RCC_AHB5LPENR2_DTCMLPEN_B_0X0               (0x0u<<29)
#define RCC_AHB5LPENR2_DTCMLPEN_B_0X1               (0x1u<<29)
#define RCC_AHB5LPENR2_RISABDTCMLPEN_B_0X0          (0x0u<<27)
#define RCC_AHB5LPENR2_RISABDTCMLPEN_B_0X1          (0x1u<<27)
#define RCC_AHB5LPENR2_RISABITCMLPEN_B_0X0          (0x0u<<26)
#define RCC_AHB5LPENR2_RISABITCMLPEN_B_0X1          (0x1u<<26)
#define RCC_AHB5LPENR2_RISABAXISRAM6FLEXLPEN_B_0X0  (0x0u<<25)
#define RCC_AHB5LPENR2_RISABAXISRAM6FLEXLPEN_B_0X1  (0x1u<<25)
#define RCC_AHB5LPENR2_RISABAXISRAM6FIXLPEN_B_0X0   (0x0u<<24)
#define RCC_AHB5LPENR2_RISABAXISRAM6FIXLPEN_B_0X1   (0x1u<<24)
#define RCC_AHB5LPENR2_RISABAXISRAM5LPEN_B_0X0      (0x0u<<23)
#define RCC_AHB5LPENR2_RISABAXISRAM5LPEN_B_0X1      (0x1u<<23)
#define RCC_AHB5LPENR2_RISABAXISRAM4LPEN_B_0X0      (0x0u<<22)
#define RCC_AHB5LPENR2_RISABAXISRAM4LPEN_B_0X1      (0x1u<<22)
#define RCC_AHB5LPENR2_RISABAXISRAM3LPEN_B_0X0      (0x0u<<21)
#define RCC_AHB5LPENR2_RISABAXISRAM3LPEN_B_0X1      (0x1u<<21)
#define RCC_AHB5LPENR2_RISABAXISRAM2LPEN_B_0X0      (0x0u<<20)
#define RCC_AHB5LPENR2_RISABAXISRAM2LPEN_B_0X1      (0x1u<<20)
#define RCC_AHB5LPENR2_RISABAXISRAM1LPEN_B_0X0      (0x0u<<19)
#define RCC_AHB5LPENR2_RISABAXISRAM1LPEN_B_0X1      (0x1u<<19)
#define RCC_AHB5LPENR2_RISABAHBSRAM2LPEN_B_0X0      (0x0u<<18)
#define RCC_AHB5LPENR2_RISABAHBSRAM2LPEN_B_0X1      (0x1u<<18)
#define RCC_AHB5LPENR2_RISABAHBSRAM1LPEN_B_0X0      (0x0u<<17)
#define RCC_AHB5LPENR2_RISABAHBSRAM1LPEN_B_0X1      (0x1u<<17)
#define RCC_AHB5LPENR2_RISAFBKPSRAMLPEN_B_0X0       (0x0u<<16)
#define RCC_AHB5LPENR2_RISAFBKPSRAMLPEN_B_0X1       (0x1u<<16)
#define RCC_AHB5LPENR2_RISAFFMCLPEN_B_0X0           (0x0u<<15)
#define RCC_AHB5LPENR2_RISAFFMCLPEN_B_0X1           (0x1u<<15)
#define RCC_AHB5LPENR2_RISAFXSPI2LPEN_B_0X0         (0x0u<<14)
#define RCC_AHB5LPENR2_RISAFXSPI2LPEN_B_0X1         (0x1u<<14)
#define RCC_AHB5LPENR2_RISAFXSPI1LPEN_B_0X0         (0x0u<<13)
#define RCC_AHB5LPENR2_RISAFXSPI1LPEN_B_0X1         (0x1u<<13)
#define RCC_AHB5LPENR2_RIFSCLPEN_B_0X0              (0x0u<<11)
#define RCC_AHB5LPENR2_RIFSCLPEN_B_0X1              (0x1u<<11)

// APB1LPENR1 Configuration

#define RCC_APB1LPENR1_UART8LPEN                    (0x1u<<31)
#define RCC_APB1LPENR1_UART7LPEN                    (0x1u<<30)
#define RCC_APB1LPENR1_HDMICECLPEN                  (0x1u<<27)
#define RCC_APB1LPENR1_I3C2LPEN                     (0x1u<<25)
#define RCC_APB1LPENR1_I3C1LPEN                     (0x1u<<24)
#define RCC_APB1LPENR1_I2C3LPEN                     (0x1u<<23)
#define RCC_APB1LPENR1_I2C2LPEN                     (0x1u<<22)
#define RCC_APB1LPENR1_I2C1LPEN                     (0x1u<<21)
#define RCC_APB1LPENR1_UART5LPEN                    (0x1u<<20)
#define RCC_APB1LPENR1_UART4LPEN                    (0x1u<<19)
#define RCC_APB1LPENR1_USART3LPEN                   (0x1u<<18)
#define RCC_APB1LPENR1_USART2LPEN                   (0x1u<<17)
#define RCC_APB1LPENR1_SPDIFRXLPEN                  (0x1u<<16)
#define RCC_APB1LPENR1_SPI3LPEN                     (0x1u<<15)
#define RCC_APB1LPENR1_SPI2LPEN                     (0x1u<<14)
#define RCC_APB1LPENR1_TIM10LPEN                    (0x1u<<12)
#define RCC_APB1LPENR1_WWDGLPEN                     (0x1u<<11)
#define RCC_APB1LPENR1_LPTIM1LPEN                   (0x1u<<9)
#define RCC_APB1LPENR1_TIM14LPEN                    (0x1u<<8)
#define RCC_APB1LPENR1_TIM13LPEN                    (0x1u<<7)
#define RCC_APB1LPENR1_TIM12LPEN                    (0x1u<<6)
#define RCC_APB1LPENR1_TIM7LPEN                     (0x1u<<5)
#define RCC_APB1LPENR1_TIM6LPEN                     (0x1u<<4)
#define RCC_APB1LPENR1_TIM5LPEN                     (0x1u<<3)
#define RCC_APB1LPENR1_TIM4LPEN                     (0x1u<<2)
#define RCC_APB1LPENR1_TIM3LPEN                     (0x1u<<1)
#define RCC_APB1LPENR1_TIM2LPEN                     (0x1u<<0)

