Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/STM32V873/Includes/Registers/stm32V873_rcc.h
#define RCC_APB1LPENR1_UART8LPEN_B_0X0              (0x0u<<31)
#define RCC_APB1LPENR1_UART8LPEN_B_0X1              (0x1u<<31)
#define RCC_APB1LPENR1_UART7LPEN_B_0X0              (0x0u<<30)
#define RCC_APB1LPENR1_UART7LPEN_B_0X1              (0x1u<<30)
#define RCC_APB1LPENR1_HDMICECLPEN_B_0X0            (0x0u<<27)
#define RCC_APB1LPENR1_HDMICECLPEN_B_0X1            (0x1u<<27)
#define RCC_APB1LPENR1_I3C2LPEN_B_0X0               (0x0u<<25)
#define RCC_APB1LPENR1_I3C2LPEN_B_0X1               (0x1u<<25)
#define RCC_APB1LPENR1_I3C1LPEN_B_0X0               (0x0u<<24)
#define RCC_APB1LPENR1_I3C1LPEN_B_0X1               (0x1u<<24)
#define RCC_APB1LPENR1_I2C3LPEN_B_0X0               (0x0u<<23)
#define RCC_APB1LPENR1_I2C3LPEN_B_0X1               (0x1u<<23)
#define RCC_APB1LPENR1_I2C2LPEN_B_0X0               (0x0u<<22)
#define RCC_APB1LPENR1_I2C2LPEN_B_0X1               (0x1u<<22)
#define RCC_APB1LPENR1_I2C1LPEN_B_0X0               (0x0u<<21)
#define RCC_APB1LPENR1_I2C1LPEN_B_0X1               (0x1u<<21)
#define RCC_APB1LPENR1_UART5LPEN_B_0X0              (0x0u<<20)
#define RCC_APB1LPENR1_UART5LPEN_B_0X1              (0x1u<<20)
#define RCC_APB1LPENR1_UART4LPEN_B_0X0              (0x0u<<19)
#define RCC_APB1LPENR1_UART4LPEN_B_0X1              (0x1u<<19)
#define RCC_APB1LPENR1_USART3LPEN_B_0X0             (0x0u<<18)
#define RCC_APB1LPENR1_USART3LPEN_B_0X1             (0x1u<<18)
#define RCC_APB1LPENR1_USART2LPEN_B_0X0             (0x0u<<17)
#define RCC_APB1LPENR1_USART2LPEN_B_0X1             (0x1u<<17)
#define RCC_APB1LPENR1_SPDIFRXLPEN_B_0X0            (0x0u<<16)
#define RCC_APB1LPENR1_SPDIFRXLPEN_B_0X1            (0x1u<<16)
#define RCC_APB1LPENR1_SPI3LPEN_B_0X0               (0x0u<<15)
#define RCC_APB1LPENR1_SPI3LPEN_B_0X1               (0x1u<<15)
#define RCC_APB1LPENR1_SPI2LPEN_B_0X0               (0x0u<<14)
#define RCC_APB1LPENR1_SPI2LPEN_B_0X1               (0x1u<<14)
#define RCC_APB1LPENR1_TIM10LPEN_B_0X0              (0x0u<<12)
#define RCC_APB1LPENR1_TIM10LPEN_B_0X1              (0x1u<<12)
#define RCC_APB1LPENR1_WWDGLPEN_B_0X0               (0x0u<<11)
#define RCC_APB1LPENR1_WWDGLPEN_B_0X1               (0x1u<<11)
#define RCC_APB1LPENR1_LPTIM1LPEN_B_0X0             (0x0u<<9)
#define RCC_APB1LPENR1_LPTIM1LPEN_B_0X1             (0x1u<<9)
#define RCC_APB1LPENR1_TIM14LPEN_B_0X0              (0x0u<<8)
#define RCC_APB1LPENR1_TIM14LPEN_B_0X1              (0x1u<<8)
#define RCC_APB1LPENR1_TIM13LPEN_B_0X0              (0x0u<<7)
#define RCC_APB1LPENR1_TIM13LPEN_B_0X1              (0x1u<<7)
#define RCC_APB1LPENR1_TIM12LPEN_B_0X0              (0x0u<<6)
#define RCC_APB1LPENR1_TIM12LPEN_B_0X1              (0x1u<<6)
#define RCC_APB1LPENR1_TIM7LPEN_B_0X0               (0x0u<<5)
#define RCC_APB1LPENR1_TIM7LPEN_B_0X1               (0x1u<<5)
#define RCC_APB1LPENR1_TIM6LPEN_B_0X0               (0x0u<<4)
#define RCC_APB1LPENR1_TIM6LPEN_B_0X1               (0x1u<<4)
#define RCC_APB1LPENR1_TIM5LPEN_B_0X0               (0x0u<<3)
#define RCC_APB1LPENR1_TIM5LPEN_B_0X1               (0x1u<<3)
#define RCC_APB1LPENR1_TIM4LPEN_B_0X0               (0x0u<<2)
#define RCC_APB1LPENR1_TIM4LPEN_B_0X1               (0x1u<<2)
#define RCC_APB1LPENR1_TIM3LPEN_B_0X0               (0x0u<<1)
#define RCC_APB1LPENR1_TIM3LPEN_B_0X1               (0x1u<<1)
#define RCC_APB1LPENR1_TIM2LPEN_B_0X0               (0x0u<<0)
#define RCC_APB1LPENR1_TIM2LPEN_B_0X1               (0x1u<<0)

// APB1LPENR2 Configuration

#define RCC_APB1LPENR2_UCPD1LPEN                    (0x1u<<31)
#define RCC_APB1LPENR2_FDCANLPEN                    (0x1u<<8)
#define RCC_APB1LPENR2_MDIOSLPEN                    (0x1u<<5)
#define RCC_APB1LPENR2_CRSLPEN                      (0x1u<<1)

#define RCC_APB1LPENR2_UCPD1LPEN_B_0X0              (0x0u<<31)
#define RCC_APB1LPENR2_UCPD1LPEN_B_0X1              (0x1u<<31)
#define RCC_APB1LPENR2_FDCANLPEN_B_0X0              (0x0u<<8)
#define RCC_APB1LPENR2_FDCANLPEN_B_0X1              (0x1u<<8)
#define RCC_APB1LPENR2_MDIOSLPEN_B_0X0              (0x0u<<5)
#define RCC_APB1LPENR2_MDIOSLPEN_B_0X1              (0x1u<<5)
#define RCC_APB1LPENR2_CRSLPEN_B_0X0                (0x0u<<1)
#define RCC_APB1LPENR2_CRSLPEN_B_0X1                (0x1u<<1)

// APB2LPENR Configuration

#define RCC_APB2LPENR_HRTIM1LPEN                    (0x1u<<28)
#define RCC_APB2LPENR_SAI2LPEN                      (0x1u<<23)
#define RCC_APB2LPENR_SAI1LPEN                      (0x1u<<22)
#define RCC_APB2LPENR_SPI5LPEN                      (0x1u<<20)
#define RCC_APB2LPENR_TIM9LPEN                      (0x1u<<19)
#define RCC_APB2LPENR_TIM17LPEN                     (0x1u<<18)
#define RCC_APB2LPENR_TIM16LPEN                     (0x1u<<17)
#define RCC_APB2LPENR_TIM15LPEN                     (0x1u<<16)
#define RCC_APB2LPENR_SPI4LPEN                      (0x1u<<13)
#define RCC_APB2LPENR_SPI1LPEN                      (0x1u<<12)
#define RCC_APB2LPENR_USART10LPEN                   (0x1u<<7)
#define RCC_APB2LPENR_UART9LPEN                     (0x1u<<6)
#define RCC_APB2LPENR_USART6LPEN                    (0x1u<<5)
#define RCC_APB2LPENR_USART1LPEN                    (0x1u<<4)
#define RCC_APB2LPENR_TIM20LPEN                     (0x1u<<2)
#define RCC_APB2LPENR_TIM8LPEN                      (0x1u<<1)
#define RCC_APB2LPENR_TIM1LPEN                      (0x1u<<0)

#define RCC_APB2LPENR_HRTIM1LPEN_B_0X0              (0x0u<<28)
#define RCC_APB2LPENR_HRTIM1LPEN_B_0X1              (0x1u<<28)
#define RCC_APB2LPENR_SAI2LPEN_B_0X0                (0x0u<<23)
#define RCC_APB2LPENR_SAI2LPEN_B_0X1                (0x1u<<23)
#define RCC_APB2LPENR_SAI1LPEN_B_0X0                (0x0u<<22)
#define RCC_APB2LPENR_SAI1LPEN_B_0X1                (0x1u<<22)
#define RCC_APB2LPENR_SPI5LPEN_B_0X0                (0x0u<<20)
#define RCC_APB2LPENR_SPI5LPEN_B_0X1                (0x1u<<20)
#define RCC_APB2LPENR_TIM9LPEN_B_0X0                (0x0u<<19)
#define RCC_APB2LPENR_TIM9LPEN_B_0X1                (0x1u<<19)
#define RCC_APB2LPENR_TIM17LPEN_B_0X0               (0x0u<<18)
#define RCC_APB2LPENR_TIM17LPEN_B_0X1               (0x1u<<18)
#define RCC_APB2LPENR_TIM16LPEN_B_0X0               (0x0u<<17)
#define RCC_APB2LPENR_TIM16LPEN_B_0X1               (0x1u<<17)
#define RCC_APB2LPENR_TIM15LPEN_B_0X0               (0x0u<<16)
#define RCC_APB2LPENR_TIM15LPEN_B_0X1               (0x1u<<16)
#define RCC_APB2LPENR_SPI4LPEN_B_0X0                (0x0u<<13)
#define RCC_APB2LPENR_SPI4LPEN_B_0X1                (0x1u<<13)
#define RCC_APB2LPENR_SPI1LPEN_B_0X0                (0x0u<<12)
#define RCC_APB2LPENR_SPI1LPEN_B_0X1                (0x1u<<12)
#define RCC_APB2LPENR_USART10LPEN_B_0X0             (0x0u<<7)
#define RCC_APB2LPENR_USART10LPEN_B_0X1             (0x1u<<7)
#define RCC_APB2LPENR_UART9LPEN_B_0X0               (0x0u<<6)
#define RCC_APB2LPENR_UART9LPEN_B_0X1               (0x1u<<6)
#define RCC_APB2LPENR_USART6LPEN_B_0X0              (0x0u<<5)
#define RCC_APB2LPENR_USART6LPEN_B_0X1              (0x1u<<5)
#define RCC_APB2LPENR_USART1LPEN_B_0X0              (0x0u<<4)
#define RCC_APB2LPENR_USART1LPEN_B_0X1              (0x1u<<4)
#define RCC_APB2LPENR_TIM20LPEN_B_0X0               (0x0u<<2)
#define RCC_APB2LPENR_TIM20LPEN_B_0X1               (0x1u<<2)
#define RCC_APB2LPENR_TIM8LPEN_B_0X0                (0x0u<<1)
#define RCC_APB2LPENR_TIM8LPEN_B_0X1                (0x1u<<1)
#define RCC_APB2LPENR_TIM1LPEN_B_0X0                (0x0u<<0)
#define RCC_APB2LPENR_TIM1LPEN_B_0X1                (0x1u<<0)

