Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/STM32V873/Includes/Registers/stm32V873_rcc.h
// APB4LPENR Configuration

#define RCC_APB4LPENR_PMBLPEN                       (0x1u<<27)
#define RCC_APB4LPENR_DTSLPEN                       (0x1u<<26)
#define RCC_APB4LPENR_RTCAPBLPEN                    (0x1u<<16)
#define RCC_APB4LPENR_VREFBUFLPEN                   (0x1u<<15)
#define RCC_APB4LPENR_LPTIM5LPEN                    (0x1u<<12)
#define RCC_APB4LPENR_LPTIM4LPEN                    (0x1u<<11)
#define RCC_APB4LPENR_LPTIM3LPEN                    (0x1u<<10)
#define RCC_APB4LPENR_LPTIM2LPEN                    (0x1u<<9)
#define RCC_APB4LPENR_SPI6LPEN                      (0x1u<<5)
#define RCC_APB4LPENR_LPUART1LPEN                   (0x1u<<3)

#define RCC_APB4LPENR_PMBLPEN_B_0X0                 (0x0u<<27)
#define RCC_APB4LPENR_PMBLPEN_B_0X1                 (0x1u<<27)
#define RCC_APB4LPENR_DTSLPEN_B_0X0                 (0x0u<<26)
#define RCC_APB4LPENR_DTSLPEN_B_0X1                 (0x1u<<26)
#define RCC_APB4LPENR_RTCAPBLPEN_B_0X0              (0x0u<<16)
#define RCC_APB4LPENR_RTCAPBLPEN_B_0X1              (0x1u<<16)
#define RCC_APB4LPENR_VREFBUFLPEN_B_0X0             (0x0u<<15)
#define RCC_APB4LPENR_VREFBUFLPEN_B_0X1             (0x1u<<15)
#define RCC_APB4LPENR_LPTIM5LPEN_B_0X0              (0x0u<<12)
#define RCC_APB4LPENR_LPTIM5LPEN_B_0X1              (0x1u<<12)
#define RCC_APB4LPENR_LPTIM4LPEN_B_0X0              (0x0u<<11)
#define RCC_APB4LPENR_LPTIM4LPEN_B_0X1              (0x1u<<11)
#define RCC_APB4LPENR_LPTIM3LPEN_B_0X0              (0x0u<<10)
#define RCC_APB4LPENR_LPTIM3LPEN_B_0X1              (0x1u<<10)
#define RCC_APB4LPENR_LPTIM2LPEN_B_0X0              (0x0u<<9)
#define RCC_APB4LPENR_LPTIM2LPEN_B_0X1              (0x1u<<9)
#define RCC_APB4LPENR_SPI6LPEN_B_0X0                (0x0u<<5)
#define RCC_APB4LPENR_SPI6LPEN_B_0X1                (0x1u<<5)
#define RCC_APB4LPENR_LPUART1LPEN_B_0X0             (0x0u<<3)
#define RCC_APB4LPENR_LPUART1LPEN_B_0X1             (0x1u<<3)

// APB5LPENR Configuration

#define RCC_APB5LPENR_GFXTIMLPEN                    (0x1u<<4)
#define RCC_APB5LPENR_DCMIPPLPEN                    (0x1u<<2)
#define RCC_APB5LPENR_LTDCLPEN                      (0x1u<<1)

#define RCC_APB5LPENR_GFXTIMLPEN_B_0X0              (0x0u<<4)
#define RCC_APB5LPENR_GFXTIMLPEN_B_0X1              (0x1u<<4)
#define RCC_APB5LPENR_DCMIPPLPEN_B_0X0              (0x0u<<2)
#define RCC_APB5LPENR_DCMIPPLPEN_B_0X1              (0x1u<<2)
#define RCC_APB5LPENR_LTDCLPEN_B_0X0                (0x0u<<1)
#define RCC_APB5LPENR_LTDCLPEN_B_0X1                (0x1u<<1)

// BDCR Configuration

#define RCC_BDCR_LSEDRT                             (0x7u<<20)
#define RCC_BDCR_LSEDRT_0                           (0x1u<<20)
#define RCC_BDCR_VSWRST                             (0x1u<<16)
#define RCC_BDCR_RTCEN                              (0x1u<<15)
#define RCC_BDCR_LSECSSRA                           (0x1u<<12)
#define RCC_BDCR_RTCSEL                             (0x3u<<8)
#define RCC_BDCR_RTCSEL_0                           (0x1u<<8)
#define RCC_BDCR_LSEEXT                             (0x1u<<7)
#define RCC_BDCR_LSECSSD                            (0x1u<<6)
#define RCC_BDCR_LSECSSON                           (0x1u<<5)
#define RCC_BDCR_LSEXCR                             (0x3u<<3)
#define RCC_BDCR_LSEXCR_0                           (0x1u<<3)
#define RCC_BDCR_LSEBYP                             (0x1u<<2)
#define RCC_BDCR_LSERDY                             (0x1u<<1)
#define RCC_BDCR_LSEON                              (0x1u<<0)

#define RCC_BDCR_LSEDRT_B_0X3                       (0x3u<<20)
#define RCC_BDCR_LSEDRT_B_0X4                       (0x4u<<20)
#define RCC_BDCR_LSEDRT_B_0X5                       (0x5u<<20)
#define RCC_BDCR_LSEDRT_B_0X6                       (0x6u<<20)
#define RCC_BDCR_LSEDRT_B_0X7                       (0x7u<<20)
#define RCC_BDCR_VSWRST_B_0X0                       (0x0u<<16)
#define RCC_BDCR_VSWRST_B_0X1                       (0x1u<<16)
#define RCC_BDCR_RTCEN_B_0X0                        (0x0u<<15)
#define RCC_BDCR_RTCEN_B_0X1                        (0x1u<<15)
#define RCC_BDCR_LSECSSRA_B_0X0                     (0x0u<<12)
#define RCC_BDCR_LSECSSRA_B_0X1                     (0x1u<<12)
#define RCC_BDCR_RTCSEL_B_0X0                       (0x0u<<8)
#define RCC_BDCR_RTCSEL_B_0X1                       (0x1u<<8)
#define RCC_BDCR_RTCSEL_B_0X2                       (0x2u<<8)
#define RCC_BDCR_RTCSEL_B_0X3                       (0x3u<<8)
#define RCC_BDCR_LSEEXT_B_0X0                       (0x0u<<7)
#define RCC_BDCR_LSEEXT_B_0X1                       (0x1u<<7)
#define RCC_BDCR_LSECSSD_B_0X0                      (0x0u<<6)
#define RCC_BDCR_LSECSSD_B_0X1                      (0x1u<<6)
#define RCC_BDCR_LSECSSON_B_0X0                     (0x0u<<5)
#define RCC_BDCR_LSECSSON_B_0X1                     (0x1u<<5)
#define RCC_BDCR_LSEXCR_B_0X0                       (0x0u<<3)
#define RCC_BDCR_LSEXCR_B_0X1                       (0x1u<<3)
#define RCC_BDCR_LSEXCR_B_0X2                       (0x2u<<3)
#define RCC_BDCR_LSEXCR_B_0X3                       (0x3u<<3)
#define RCC_BDCR_LSEBYP_B_0X0                       (0x0u<<2)
#define RCC_BDCR_LSEBYP_B_0X1                       (0x1u<<2)
#define RCC_BDCR_LSERDY_B_0X0                       (0x0u<<1)
#define RCC_BDCR_LSERDY_B_0X1                       (0x1u<<1)
#define RCC_BDCR_LSEON_B_0X0                        (0x0u<<0)
#define RCC_BDCR_LSEON_B_0X1                        (0x1u<<0)

// CSR Configuration

#define RCC_CSR_LSIRDY                              (0x1u<<1)
#define RCC_CSR_LSION                               (0x1u<<0)

#define RCC_CSR_LSIRDY_B_0X0                        (0x0u<<1)
#define RCC_CSR_LSIRDY_B_0X1                        (0x1u<<1)
#define RCC_CSR_LSION_B_0X0                         (0x0u<<0)
#define RCC_CSR_LSION_B_0X1                         (0x1u<<0)

// RSR Configuration

#define RCC_RSR_LPWRRSTF                            (0x1u<<30)
#define RCC_RSR_WWDGRSTF                            (0x1u<<28)
#define RCC_RSR_IWDGRSTF                            (0x1u<<26)
#define RCC_RSR_SFTRSTF                             (0x1u<<24)
#define RCC_RSR_PORRSTF                             (0x1u<<23)
#define RCC_RSR_PINRSTF                             (0x1u<<22)
#define RCC_RSR_BORRSTF                             (0x1u<<21)
#define RCC_RSR_OBLF                                (0x1u<<17)
#define RCC_RSR_RMVF                                (0x1u<<16)

#define RCC_RSR_LPWRRSTF_B_0X0                      (0x0u<<30)
#define RCC_RSR_LPWRRSTF_B_0X1                      (0x1u<<30)
#define RCC_RSR_WWDGRSTF_B_0X0                      (0x0u<<28)
#define RCC_RSR_WWDGRSTF_B_0X1                      (0x1u<<28)
#define RCC_RSR_IWDGRSTF_B_0X0                      (0x0u<<26)
#define RCC_RSR_IWDGRSTF_B_0X1                      (0x1u<<26)
#define RCC_RSR_SFTRSTF_B_0X0                       (0x0u<<24)
#define RCC_RSR_SFTRSTF_B_0X1                       (0x1u<<24)
#define RCC_RSR_PORRSTF_B_0X0                       (0x0u<<23)
#define RCC_RSR_PORRSTF_B_0X1                       (0x1u<<23)
#define RCC_RSR_PINRSTF_B_0X0                       (0x0u<<22)
#define RCC_RSR_PINRSTF_B_0X1                       (0x1u<<22)
#define RCC_RSR_BORRSTF_B_0X0                       (0x0u<<21)
#define RCC_RSR_BORRSTF_B_0X1                       (0x1u<<21)
#define RCC_RSR_OBLF_B_0X0                          (0x0u<<17)
#define RCC_RSR_OBLF_B_0X1                          (0x1u<<17)
#define RCC_RSR_RMVF_B_0X0                          (0x0u<<16)
#define RCC_RSR_RMVF_B_0X1                          (0x1u<<16)

// DBGCR Configuration

