Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/STM32V873/Includes/Registers/stm32V873_rcc.h
#define RCC_DBGCR_TRACEDIV                          (0x7u<<8)
#define RCC_DBGCR_TRACEDIV_0                        (0x1u<<8)
#define RCC_DBGCR_TRACESEL                          (0xFu<<4)
#define RCC_DBGCR_TRACESEL_0                        (0x1u<<4)
#define RCC_DBGCR_DBGCKM                            (0x1u<<2)
#define RCC_DBGCR_DBGCKEN                           (0x1u<<1)
#define RCC_DBGCR_DBGCKS                            (0x1u<<0)

#define RCC_DBGCR_TRACEDIV_B_0X0                    (0x0u<<8)
#define RCC_DBGCR_TRACEDIV_B_0X1                    (0x1u<<8)
#define RCC_DBGCR_TRACEDIV_B_0X2                    (0x2u<<8)
#define RCC_DBGCR_TRACEDIV_B_0X3                    (0x3u<<8)
#define RCC_DBGCR_TRACEDIV_B_0X4                    (0x4u<<8)
#define RCC_DBGCR_TRACEDIV_B_0X5                    (0x5u<<8)
#define RCC_DBGCR_TRACEDIV_B_0X6                    (0x6u<<8)
#define RCC_DBGCR_TRACEDIV_B_0X7                    (0x7u<<8)
#define RCC_DBGCR_TRACESEL_B_0X0                    (0x0u<<4)
#define RCC_DBGCR_TRACESEL_B_0X1                    (0x1u<<4)
#define RCC_DBGCR_TRACESEL_B_0X2                    (0x2u<<4)
#define RCC_DBGCR_TRACESEL_B_0X3                    (0x3u<<4)
#define RCC_DBGCR_TRACESEL_B_0X4                    (0x4u<<4)
#define RCC_DBGCR_TRACESEL_B_0X5                    (0x5u<<4)
#define RCC_DBGCR_TRACESEL_B_0X6                    (0x6u<<4)
#define RCC_DBGCR_TRACESEL_B_0X7                    (0x7u<<4)
#define RCC_DBGCR_TRACESEL_B_0X8                    (0x8u<<4)
#define RCC_DBGCR_TRACESEL_B_0X9                    (0x9u<<4)
#define RCC_DBGCR_DBGCKM_B_0X0                      (0x0u<<2)
#define RCC_DBGCR_DBGCKM_B_0X1                      (0x1u<<2)
#define RCC_DBGCR_DBGCKEN_B_0X0                     (0x0u<<1)
#define RCC_DBGCR_DBGCKEN_B_0X1                     (0x1u<<1)
#define RCC_DBGCR_DBGCKS_B_0X0                      (0x0u<<0)
#define RCC_DBGCR_DBGCKS_B_0X1                      (0x1u<<0)

// SECCFGR Configuration

#define RCC_SECCFGR_ICLK13SEC                       (0x1u<<28)
#define RCC_SECCFGR_ICLK12SEC                       (0x1u<<27)
#define RCC_SECCFGR_ICLK11SEC                       (0x1u<<26)
#define RCC_SECCFGR_ICLK10SEC                       (0x1u<<25)
#define RCC_SECCFGR_ICLK9SEC                        (0x1u<<24)
#define RCC_SECCFGR_ICLK8SEC                        (0x1u<<23)
#define RCC_SECCFGR_ICLK7SEC                        (0x1u<<22)
#define RCC_SECCFGR_ICLK6SEC                        (0x1u<<21)
#define RCC_SECCFGR_ICLK5SEC                        (0x1u<<20)
#define RCC_SECCFGR_ICLK4SEC                        (0x1u<<19)
#define RCC_SECCFGR_ICLK3SEC                        (0x1u<<18)
#define RCC_SECCFGR_ICLK2SEC                        (0x1u<<17)
#define RCC_SECCFGR_ICLK1SEC                        (0x1u<<16)
#define RCC_SECCFGR_PLL2SEC                         (0x1u<<13)
#define RCC_SECCFGR_PLL1SEC                         (0x1u<<12)
#define RCC_SECCFGR_RMVFSEC                         (0x1u<<10)
#define RCC_SECCFGR_PERSEC                          (0x1u<<9)
#define RCC_SECCFGR_SYSSEC                          (0x1u<<8)
#define RCC_SECCFGR_LSESEC                          (0x1u<<3)
#define RCC_SECCFGR_LSISEC                          (0x1u<<2)
#define RCC_SECCFGR_HSESEC                          (0x1u<<1)
#define RCC_SECCFGR_MCGSEC                          (0x1u<<0)

#define RCC_SECCFGR_ICLK13SEC_B_0X0                 (0x0u<<28)
#define RCC_SECCFGR_ICLK13SEC_B_0X1                 (0x1u<<28)
#define RCC_SECCFGR_ICLK12SEC_B_0X0                 (0x0u<<27)
#define RCC_SECCFGR_ICLK12SEC_B_0X1                 (0x1u<<27)
#define RCC_SECCFGR_ICLK11SEC_B_0X0                 (0x0u<<26)
#define RCC_SECCFGR_ICLK11SEC_B_0X1                 (0x1u<<26)
#define RCC_SECCFGR_ICLK10SEC_B_0X0                 (0x0u<<25)
#define RCC_SECCFGR_ICLK10SEC_B_0X1                 (0x1u<<25)
#define RCC_SECCFGR_ICLK9SEC_B_0X0                  (0x0u<<24)
#define RCC_SECCFGR_ICLK9SEC_B_0X1                  (0x1u<<24)
#define RCC_SECCFGR_ICLK8SEC_B_0X0                  (0x0u<<23)
#define RCC_SECCFGR_ICLK8SEC_B_0X1                  (0x1u<<23)
#define RCC_SECCFGR_ICLK7SEC_B_0X0                  (0x0u<<22)
#define RCC_SECCFGR_ICLK7SEC_B_0X1                  (0x1u<<22)
#define RCC_SECCFGR_ICLK6SEC_B_0X0                  (0x0u<<21)
#define RCC_SECCFGR_ICLK6SEC_B_0X1                  (0x1u<<21)
#define RCC_SECCFGR_ICLK5SEC_B_0X0                  (0x0u<<20)
#define RCC_SECCFGR_ICLK5SEC_B_0X1                  (0x1u<<20)
#define RCC_SECCFGR_ICLK4SEC_B_0X0                  (0x0u<<19)
#define RCC_SECCFGR_ICLK4SEC_B_0X1                  (0x1u<<19)
#define RCC_SECCFGR_ICLK3SEC_B_0X0                  (0x0u<<18)
#define RCC_SECCFGR_ICLK3SEC_B_0X1                  (0x1u<<18)
#define RCC_SECCFGR_ICLK2SEC_B_0X0                  (0x0u<<17)
#define RCC_SECCFGR_ICLK2SEC_B_0X1                  (0x1u<<17)
#define RCC_SECCFGR_ICLK1SEC_B_0X0                  (0x0u<<16)
#define RCC_SECCFGR_ICLK1SEC_B_0X1                  (0x1u<<16)
#define RCC_SECCFGR_PLL2SEC_B_0X0                   (0x0u<<13)
#define RCC_SECCFGR_PLL2SEC_B_0X1                   (0x1u<<13)
#define RCC_SECCFGR_PLL1SEC_B_0X0                   (0x0u<<12)
#define RCC_SECCFGR_PLL1SEC_B_0X1                   (0x1u<<12)
#define RCC_SECCFGR_RMVFSEC_B_0X0                   (0x0u<<10)
#define RCC_SECCFGR_RMVFSEC_B_0X1                   (0x1u<<10)
#define RCC_SECCFGR_PERSEC_B_0X0                    (0x0u<<9)
#define RCC_SECCFGR_PERSEC_B_0X1                    (0x1u<<9)
#define RCC_SECCFGR_SYSSEC_B_0X0                    (0x0u<<8)
#define RCC_SECCFGR_SYSSEC_B_0X1                    (0x1u<<8)
#define RCC_SECCFGR_LSESEC_B_0X0                    (0x0u<<3)
#define RCC_SECCFGR_LSESEC_B_0X1                    (0x1u<<3)
#define RCC_SECCFGR_LSISEC_B_0X0                    (0x0u<<2)
#define RCC_SECCFGR_LSISEC_B_0X1                    (0x1u<<2)
#define RCC_SECCFGR_HSESEC_B_0X0                    (0x0u<<1)
#define RCC_SECCFGR_HSESEC_B_0X1                    (0x1u<<1)
#define RCC_SECCFGR_MCGSEC_B_0X0                    (0x0u<<0)
#define RCC_SECCFGR_MCGSEC_B_0X1                    (0x1u<<0)

