Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/STM32V873/Includes/Registers/stm32V873_rcc.h
// PRIVCFGR Configuration

#define RCC_PRIVCFGR_ICLK13PRIV                     (0x1u<<28)
#define RCC_PRIVCFGR_ICLK12PRIV                     (0x1u<<27)
#define RCC_PRIVCFGR_ICLK11PRIV                     (0x1u<<26)
#define RCC_PRIVCFGR_ICLK10PRIV                     (0x1u<<25)
#define RCC_PRIVCFGR_ICLK9PRIV                      (0x1u<<24)
#define RCC_PRIVCFGR_ICLK8PRIV                      (0x1u<<23)
#define RCC_PRIVCFGR_ICLK7PRIV                      (0x1u<<22)
#define RCC_PRIVCFGR_ICLK6PRIV                      (0x1u<<21)
#define RCC_PRIVCFGR_ICLK5PRIV                      (0x1u<<20)
#define RCC_PRIVCFGR_ICLK4PRIV                      (0x1u<<19)
#define RCC_PRIVCFGR_ICLK3PRIV                      (0x1u<<18)
#define RCC_PRIVCFGR_ICLK2PRIV                      (0x1u<<17)
#define RCC_PRIVCFGR_ICLK1PRIV                      (0x1u<<16)
#define RCC_PRIVCFGR_PLL2PRIV                       (0x1u<<13)
#define RCC_PRIVCFGR_PLL1PRIV                       (0x1u<<12)
#define RCC_PRIVCFGR_RMVFPRIV                       (0x1u<<10)
#define RCC_PRIVCFGR_PERPRIV                        (0x1u<<9)
#define RCC_PRIVCFGR_SYSPRIV                        (0x1u<<8)
#define RCC_PRIVCFGR_LSEPRIV                        (0x1u<<3)
#define RCC_PRIVCFGR_LSIPRIV                        (0x1u<<2)
#define RCC_PRIVCFGR_HSEPRIV                        (0x1u<<1)
#define RCC_PRIVCFGR_MCGPRIV                        (0x1u<<0)

#define RCC_PRIVCFGR_ICLK13PRIV_B_0X0               (0x0u<<28)
#define RCC_PRIVCFGR_ICLK13PRIV_B_0X1               (0x1u<<28)
#define RCC_PRIVCFGR_ICLK12PRIV_B_0X0               (0x0u<<27)
#define RCC_PRIVCFGR_ICLK12PRIV_B_0X1               (0x1u<<27)
#define RCC_PRIVCFGR_ICLK11PRIV_B_0X0               (0x0u<<26)
#define RCC_PRIVCFGR_ICLK11PRIV_B_0X1               (0x1u<<26)
#define RCC_PRIVCFGR_ICLK10PRIV_B_0X0               (0x0u<<25)
#define RCC_PRIVCFGR_ICLK10PRIV_B_0X1               (0x1u<<25)
#define RCC_PRIVCFGR_ICLK9PRIV_B_0X0                (0x0u<<24)
#define RCC_PRIVCFGR_ICLK9PRIV_B_0X1                (0x1u<<24)
#define RCC_PRIVCFGR_ICLK8PRIV_B_0X0                (0x0u<<23)
#define RCC_PRIVCFGR_ICLK8PRIV_B_0X1                (0x1u<<23)
#define RCC_PRIVCFGR_ICLK7PRIV_B_0X0                (0x0u<<22)
#define RCC_PRIVCFGR_ICLK7PRIV_B_0X1                (0x1u<<22)
#define RCC_PRIVCFGR_ICLK6PRIV_B_0X0                (0x0u<<21)
#define RCC_PRIVCFGR_ICLK6PRIV_B_0X1                (0x1u<<21)
#define RCC_PRIVCFGR_ICLK5PRIV_B_0X0                (0x0u<<20)
#define RCC_PRIVCFGR_ICLK5PRIV_B_0X1                (0x1u<<20)
#define RCC_PRIVCFGR_ICLK4PRIV_B_0X0                (0x0u<<19)
#define RCC_PRIVCFGR_ICLK4PRIV_B_0X1                (0x1u<<19)
#define RCC_PRIVCFGR_ICLK3PRIV_B_0X0                (0x0u<<18)
#define RCC_PRIVCFGR_ICLK3PRIV_B_0X1                (0x1u<<18)
#define RCC_PRIVCFGR_ICLK2PRIV_B_0X0                (0x0u<<17)
#define RCC_PRIVCFGR_ICLK2PRIV_B_0X1                (0x1u<<17)
#define RCC_PRIVCFGR_ICLK1PRIV_B_0X0                (0x0u<<16)
#define RCC_PRIVCFGR_ICLK1PRIV_B_0X1                (0x1u<<16)
#define RCC_PRIVCFGR_PLL2PRIV_B_0X0                 (0x0u<<13)
#define RCC_PRIVCFGR_PLL2PRIV_B_0X1                 (0x1u<<13)
#define RCC_PRIVCFGR_PLL1PRIV_B_0X0                 (0x0u<<12)
#define RCC_PRIVCFGR_PLL1PRIV_B_0X1                 (0x1u<<12)
#define RCC_PRIVCFGR_RMVFPRIV_B_0X0                 (0x0u<<10)
#define RCC_PRIVCFGR_RMVFPRIV_B_0X1                 (0x1u<<10)
#define RCC_PRIVCFGR_PERPRIV_B_0X0                  (0x0u<<9)
#define RCC_PRIVCFGR_PERPRIV_B_0X1                  (0x1u<<9)
#define RCC_PRIVCFGR_SYSPRIV_B_0X0                  (0x0u<<8)
#define RCC_PRIVCFGR_SYSPRIV_B_0X1                  (0x1u<<8)
#define RCC_PRIVCFGR_LSEPRIV_B_0X0                  (0x0u<<3)
#define RCC_PRIVCFGR_LSEPRIV_B_0X1                  (0x1u<<3)
#define RCC_PRIVCFGR_LSIPRIV_B_0X0                  (0x0u<<2)
#define RCC_PRIVCFGR_LSIPRIV_B_0X1                  (0x1u<<2)
#define RCC_PRIVCFGR_HSEPRIV_B_0X0                  (0x0u<<1)
#define RCC_PRIVCFGR_HSEPRIV_B_0X1                  (0x1u<<1)
#define RCC_PRIVCFGR_MCGPRIV_B_0X0                  (0x0u<<0)
#define RCC_PRIVCFGR_MCGPRIV_B_0X1                  (0x1u<<0)

// RCFGLOCKR Configuration

#define RCC_RCFGLOCKR_ICLK13LOCK                    (0x1u<<28)
#define RCC_RCFGLOCKR_ICLK12LOCK                    (0x1u<<27)
#define RCC_RCFGLOCKR_ICLK11LOCK                    (0x1u<<26)
#define RCC_RCFGLOCKR_ICLK10LOCK                    (0x1u<<25)
#define RCC_RCFGLOCKR_ICLK9LOCK                     (0x1u<<24)
#define RCC_RCFGLOCKR_ICLK8LOCK                     (0x1u<<23)
#define RCC_RCFGLOCKR_ICLK7LOCK                     (0x1u<<22)
#define RCC_RCFGLOCKR_ICLK6LOCK                     (0x1u<<21)
#define RCC_RCFGLOCKR_ICLK5LOCK                     (0x1u<<20)
#define RCC_RCFGLOCKR_ICLK4LOCK                     (0x1u<<19)
#define RCC_RCFGLOCKR_ICLK3LOCK                     (0x1u<<18)
#define RCC_RCFGLOCKR_ICLK2LOCK                     (0x1u<<17)
#define RCC_RCFGLOCKR_ICLK1LOCK                     (0x1u<<16)
#define RCC_RCFGLOCKR_PLL2LOCK                      (0x1u<<13)
#define RCC_RCFGLOCKR_PLL1LOCK                      (0x1u<<12)
#define RCC_RCFGLOCKR_RMVFLOCK                      (0x1u<<10)
#define RCC_RCFGLOCKR_PERLOCK                       (0x1u<<9)
#define RCC_RCFGLOCKR_SYSLOCK                       (0x1u<<8)
#define RCC_RCFGLOCKR_LSELOCK                       (0x1u<<3)
#define RCC_RCFGLOCKR_LSILOCK                       (0x1u<<2)
#define RCC_RCFGLOCKR_HSELOCK                       (0x1u<<1)
#define RCC_RCFGLOCKR_MCGLOCK                       (0x1u<<0)

#define RCC_RCFGLOCKR_ICLK13LOCK_B_0X0              (0x0u<<28)
#define RCC_RCFGLOCKR_ICLK13LOCK_B_0X1              (0x1u<<28)
#define RCC_RCFGLOCKR_ICLK12LOCK_B_0X0              (0x0u<<27)
#define RCC_RCFGLOCKR_ICLK12LOCK_B_0X1              (0x1u<<27)
#define RCC_RCFGLOCKR_ICLK11LOCK_B_0X0              (0x0u<<26)
#define RCC_RCFGLOCKR_ICLK11LOCK_B_0X1              (0x1u<<26)
#define RCC_RCFGLOCKR_ICLK10LOCK_B_0X0              (0x0u<<25)
#define RCC_RCFGLOCKR_ICLK10LOCK_B_0X1              (0x1u<<25)
#define RCC_RCFGLOCKR_ICLK9LOCK_B_0X0               (0x0u<<24)
#define RCC_RCFGLOCKR_ICLK9LOCK_B_0X1               (0x1u<<24)
#define RCC_RCFGLOCKR_ICLK8LOCK_B_0X0               (0x0u<<23)
#define RCC_RCFGLOCKR_ICLK8LOCK_B_0X1               (0x1u<<23)
#define RCC_RCFGLOCKR_ICLK7LOCK_B_0X0               (0x0u<<22)
#define RCC_RCFGLOCKR_ICLK7LOCK_B_0X1               (0x1u<<22)
#define RCC_RCFGLOCKR_ICLK6LOCK_B_0X0               (0x0u<<21)
#define RCC_RCFGLOCKR_ICLK6LOCK_B_0X1               (0x1u<<21)
#define RCC_RCFGLOCKR_ICLK5LOCK_B_0X0               (0x0u<<20)
#define RCC_RCFGLOCKR_ICLK5LOCK_B_0X1               (0x1u<<20)
#define RCC_RCFGLOCKR_ICLK4LOCK_B_0X0               (0x0u<<19)
#define RCC_RCFGLOCKR_ICLK4LOCK_B_0X1               (0x1u<<19)
#define RCC_RCFGLOCKR_ICLK3LOCK_B_0X0               (0x0u<<18)
#define RCC_RCFGLOCKR_ICLK3LOCK_B_0X1               (0x1u<<18)
#define RCC_RCFGLOCKR_ICLK2LOCK_B_0X0               (0x0u<<17)
#define RCC_RCFGLOCKR_ICLK2LOCK_B_0X1               (0x1u<<17)
#define RCC_RCFGLOCKR_ICLK1LOCK_B_0X0               (0x0u<<16)
#define RCC_RCFGLOCKR_ICLK1LOCK_B_0X1               (0x1u<<16)
#define RCC_RCFGLOCKR_PLL2LOCK_B_0X0                (0x0u<<13)
#define RCC_RCFGLOCKR_PLL2LOCK_B_0X1                (0x1u<<13)
#define RCC_RCFGLOCKR_PLL1LOCK_B_0X0                (0x0u<<12)
#define RCC_RCFGLOCKR_PLL1LOCK_B_0X1                (0x1u<<12)
#define RCC_RCFGLOCKR_RMVFLOCK_B_0X0                (0x0u<<10)
#define RCC_RCFGLOCKR_RMVFLOCK_B_0X1                (0x1u<<10)
#define RCC_RCFGLOCKR_PERLOCK_B_0X0                 (0x0u<<9)
#define RCC_RCFGLOCKR_PERLOCK_B_0X1                 (0x1u<<9)
#define RCC_RCFGLOCKR_SYSLOCK_B_0X0                 (0x0u<<8)
#define RCC_RCFGLOCKR_SYSLOCK_B_0X1                 (0x1u<<8)
#define RCC_RCFGLOCKR_LSELOCK_B_0X0                 (0x0u<<3)
#define RCC_RCFGLOCKR_LSELOCK_B_0X1                 (0x1u<<3)
#define RCC_RCFGLOCKR_LSILOCK_B_0X0                 (0x0u<<2)
#define RCC_RCFGLOCKR_LSILOCK_B_0X1                 (0x1u<<2)
#define RCC_RCFGLOCKR_HSELOCK_B_0X0                 (0x0u<<1)
#define RCC_RCFGLOCKR_HSELOCK_B_0X1                 (0x1u<<1)
#define RCC_RCFGLOCKR_MCGLOCK_B_0X0                 (0x0u<<0)
#define RCC_RCFGLOCKR_MCGLOCK_B_0X1                 (0x1u<<0)

// PUBCFGR Configuration

#define RCC_PUBCFGR_ICLK13PUB                       (0x1u<<28)
#define RCC_PUBCFGR_ICLK12PUB                       (0x1u<<27)
#define RCC_PUBCFGR_ICLK11PUB                       (0x1u<<26)
#define RCC_PUBCFGR_ICLK10PUB                       (0x1u<<25)
#define RCC_PUBCFGR_ICLK9PUB                        (0x1u<<24)
#define RCC_PUBCFGR_ICLK8PUB                        (0x1u<<23)
#define RCC_PUBCFGR_ICLK7PUB                        (0x1u<<22)
#define RCC_PUBCFGR_ICLK6PUB                        (0x1u<<21)
#define RCC_PUBCFGR_ICLK5PUB                        (0x1u<<20)
#define RCC_PUBCFGR_ICLK4PUB                        (0x1u<<19)
#define RCC_PUBCFGR_ICLK3PUB                        (0x1u<<18)
#define RCC_PUBCFGR_ICLK2PUB                        (0x1u<<17)
#define RCC_PUBCFGR_ICLK1PUB                        (0x1u<<16)
#define RCC_PUBCFGR_PLL2PUB                         (0x1u<<13)
#define RCC_PUBCFGR_PLL1PUB                         (0x1u<<12)
#define RCC_PUBCFGR_RMVFPUB                         (0x1u<<10)
#define RCC_PUBCFGR_PERPUB                          (0x1u<<9)
#define RCC_PUBCFGR_SYSPUB                          (0x1u<<8)
#define RCC_PUBCFGR_LSEPUB                          (0x1u<<3)
#define RCC_PUBCFGR_LSIPUB                          (0x1u<<2)
#define RCC_PUBCFGR_HSEPUB                          (0x1u<<1)
#define RCC_PUBCFGR_MCGPUB                          (0x1u<<0)

#define RCC_PUBCFGR_ICLK13PUB_B_0X0                 (0x0u<<28)
#define RCC_PUBCFGR_ICLK13PUB_B_0X1                 (0x1u<<28)
#define RCC_PUBCFGR_ICLK12PUB_B_0X0                 (0x0u<<27)
#define RCC_PUBCFGR_ICLK12PUB_B_0X1                 (0x1u<<27)
#define RCC_PUBCFGR_ICLK11PUB_B_0X0                 (0x0u<<26)
#define RCC_PUBCFGR_ICLK11PUB_B_0X1                 (0x1u<<26)
#define RCC_PUBCFGR_ICLK10PUB_B_0X0                 (0x0u<<25)
#define RCC_PUBCFGR_ICLK10PUB_B_0X1                 (0x1u<<25)
#define RCC_PUBCFGR_ICLK9PUB_B_0X0                  (0x0u<<24)
#define RCC_PUBCFGR_ICLK9PUB_B_0X1                  (0x1u<<24)
#define RCC_PUBCFGR_ICLK8PUB_B_0X0                  (0x0u<<23)
#define RCC_PUBCFGR_ICLK8PUB_B_0X1                  (0x1u<<23)
#define RCC_PUBCFGR_ICLK7PUB_B_0X0                  (0x0u<<22)
#define RCC_PUBCFGR_ICLK7PUB_B_0X1                  (0x1u<<22)
#define RCC_PUBCFGR_ICLK6PUB_B_0X0                  (0x0u<<21)
#define RCC_PUBCFGR_ICLK6PUB_B_0X1                  (0x1u<<21)
#define RCC_PUBCFGR_ICLK5PUB_B_0X0                  (0x0u<<20)
#define RCC_PUBCFGR_ICLK5PUB_B_0X1                  (0x1u<<20)
#define RCC_PUBCFGR_ICLK4PUB_B_0X0                  (0x0u<<19)
#define RCC_PUBCFGR_ICLK4PUB_B_0X1                  (0x1u<<19)
#define RCC_PUBCFGR_ICLK3PUB_B_0X0                  (0x0u<<18)
#define RCC_PUBCFGR_ICLK3PUB_B_0X1                  (0x1u<<18)
#define RCC_PUBCFGR_ICLK2PUB_B_0X0                  (0x0u<<17)
#define RCC_PUBCFGR_ICLK2PUB_B_0X1                  (0x1u<<17)
#define RCC_PUBCFGR_ICLK1PUB_B_0X0                  (0x0u<<16)
#define RCC_PUBCFGR_ICLK1PUB_B_0X1                  (0x1u<<16)
#define RCC_PUBCFGR_PLL2PUB_B_0X0                   (0x0u<<13)
#define RCC_PUBCFGR_PLL2PUB_B_0X1                   (0x1u<<13)
#define RCC_PUBCFGR_PLL1PUB_B_0X0                   (0x0u<<12)
#define RCC_PUBCFGR_PLL1PUB_B_0X1                   (0x1u<<12)
#define RCC_PUBCFGR_RMVFPUB_B_0X0                   (0x0u<<10)
#define RCC_PUBCFGR_RMVFPUB_B_0X1                   (0x1u<<10)
#define RCC_PUBCFGR_PERPUB_B_0X0                    (0x0u<<9)
#define RCC_PUBCFGR_PERPUB_B_0X1                    (0x1u<<9)
#define RCC_PUBCFGR_SYSPUB_B_0X0                    (0x0u<<8)
#define RCC_PUBCFGR_SYSPUB_B_0X1                    (0x1u<<8)
#define RCC_PUBCFGR_LSEPUB_B_0X0                    (0x0u<<3)
#define RCC_PUBCFGR_LSEPUB_B_0X1                    (0x1u<<3)
#define RCC_PUBCFGR_LSIPUB_B_0X0                    (0x0u<<2)
#define RCC_PUBCFGR_LSIPUB_B_0X1                    (0x1u<<2)
#define RCC_PUBCFGR_HSEPUB_B_0X0                    (0x0u<<1)
#define RCC_PUBCFGR_HSEPUB_B_0X1                    (0x1u<<1)
#define RCC_PUBCFGR_MCGPUB_B_0X0                    (0x0u<<0)
#define RCC_PUBCFGR_MCGPUB_B_0X1                    (0x1u<<0)
